[{"id":"agile-delivery-phases","name":"Agile delivery phases","content":"In 2011, the UK government established the Government Digital Service (GDS) to\nimplement the ‘Digital by Default’ strategy proposed by Martha Lane Fox. GDS and\nthe ‘Digital by Default’ strategy intended to revolutionise the way citizens\ninteract with public services and government departments. Central to GDS’\napproach is the Service Manual. The Service Manual provides guidance and support\nto public sector organisations for creating and running better digital services.\n\n[www.gov.uk/service-manual](https://www.gov.uk/service-manual)\n\nThe Service Manual describes how an [agile approach](http://agilemanifesto.org/)\nto delivering projects can lead to better digital services.\n\nThe core principles of an agile approach are:\n\n* Focus on user needs\n* Deliver iteratively\n* Keep improving how your team works\n* Fail fast and learn quickly\n* Responding to change over following a plan\n\nThe Service Manual describes four stages of agile delivery:\n\n* Discovery\n* Alpha\n* Beta\n* Live\n\n## Discovery\n\nBefore committing to building something, we need to understand what the user\nneeds are and if a new thing is needed. This is **discovery**.\n\nDiscovery de-risks the future. It allows us to understand the scope of a problem\nand the best way to proceed in response.\n\nActivities in discovery include:\n\n* User research\n* Analysis of business needs\n* Market research\n* Journey mapping\n* Cost analysis\n\n**We are not building software in discovery.** The outputs of a discovery\ninclude:\n\n* Recommendations on the best way to proceed.\n* A prioritised list of user needs that future development work can be planned\n  against.\n* Findings about current processes or the existing service.\n* Estimated scale and costs for developing a new service.\n\n## Alpha\n\nAfter committing to building a new service, we need to understand how it will\nwork for users and how it will integrate with existing processes and systems.\n**This is alpha.**\n\nAlpha results in a better and more focused service. It allows us to understand\nhow users will interact with the service and what is technically possible.\n\nActivities in alpha include:\n\n* Building test designs or concepts\n* User testing\n* Service design\n* Technical audit and exploration of existing and legacy systems\n\n**We are usually not building software in alpha, even though it might look like\nit.** The outputs of an alpha will include:\n\n* Designs that have been tested and iterated with users.\n* A roadmap and plan for a beta phase.\n* Metrics to measure performance.\n* Research findings in the form of user stories and journey maps.\n\n## Beta\n\nWith a clear scope, user needs, and technical approach in place, we are ready to\nbuild a working version of the service. **This is beta.**\n\nBeta results in software that can handle real transactions and is ready to work\nat scale. It allows us to develop better services that meet user needs.\n\nActivities in beta include:\n\n* Developing working software\n* Testing and iterating\n* Getting the service accredited\n* Measuring performance\n* Developing and testing a security approach\n\n**We *are* building software and technical infrastructure in beta.** The outputs\nof a beta will include:\n\n* Working software that is being used for real transactions\n* Technical infrastructure to support the new service\n* Metrics about the performance of the service\n* A backlog of development tasks for ongoing iterations\n* An approach for security\n\n## Live\n\nOnce a service is being used for real transactions, continuous improvements can\nbe made based on feedback, research and data. **This is live.**\n\nAn active digital service is never ‘done’. The live phase allows us to respond\nto change and new research findings in order to keep iterating the service.\n\nActivities in live include:\n\n* Iterating and improving the service\n* Measuring performance\n* User support\n* Testing the service for security\n\n**We are continuously improving and supporting working software.** The outputs\nof live will include:\n\n* Iterations and improvements to the service\n* Metrics on performance\n* A backlog of development tasks for ongoing iterations\n* Security tests\n\n## Adapting our approach\n\nClients have different ways of working. They may not be familiar with the\nService Manual. Or they may have a slightly different approach to agile to us.\n\nThe principles behind the Service Manual should be consistently applied in any\nproject we deliver. But this doesn’t mean we need to follow a rigid, gated\nprocess to get things done.\n\nWe can support our clients by:\n\n* Explaining the content and value of the service manual\n* Helping them understand terminology such as “sprint ceremonies”\n* Coaching them to think about user needs, lead ceremonies, or work openly\n* Helping them to apply the principles of the Service Manual in their own\n  context"},{"id":"being-a-tech-lead-at-dxw","name":"Being a tech lead at dxw","content":"## Being a tech lead…\n\n### …at an agency\n\nOur work with a client is always temporary. Sometimes we know the end before we\nstart, and sometimes it seems like it will go on forever. But eventually the\nrelationship will end.\n\nAs an agency, our clients bring us in when there's something they can't do or\nsomething they don't have the time to do.\n\n#### Working with clients short of expertise\n\nIf our client can't do the thing, then you're explicitly there as the expert.\nYou're there because you're the one who knows how to build the software they\nneed. That means when you tell the client how to build it, they'll listen.\n\nThey might be trying to build their own in-house capability; if so they'll be\nlooking to you to help them learn. Yes, you're there to deliver working software\nthat meets the needs of their users. But you're also there to help them get\nbetter. When we leave, we need to leave them with working software and an\nin-house team that has the expertise to maintain and develop it.\n\nHowever, they might not be trying to build their own team. Although software is\nnever done, we need to try our best to get there by the time we leave. Their\nservice needs to be:\n\n* maintainable with minimal effort\n* reliable, as there's no standing team to respond to issues\n* feature-complete enough and with a good enough user experience to meet their\n  service users' core needs\n\nGetting your software into that state is no mean feat, but knowing that's the\nend state can help your prioritisation from the start.\n\n#### Working with clients short of time\n\nIf our client can do the thing, but doesn't have the time, then you're no longer\nthe expert. You're a specialist, sure, but if they can do what we can, you're\none of many. Instead of teaching them our best practices, you have to adopt\ntheirs. You might get a few chances to work with some individuals who are keen\nto learn, but really you're there to deliver working software. Any capability\nbuilding is a side effect.\n\nThe exit plan in these cases is almost always handing over your service to their\nin-house teams. Many organisations in this state will have internal governance\nto ensure that handover will be possible. So, as well as adopting their best\npractices and technology standards, you'll be spending some of your time\nengaging with the technical governance the client has in place. Hopefully you\ncan use the things your team is already doing – like architecture decision\nrecords – to do that engagement. Sometimes you'll need to do extra work.\nSometimes quite a lot of it.\n\nThis extra work can feel really frustrating when you're trying to ship a\nservice, but it's really important. Just as we wouldn't take on a service we had\nno hand in that doesn't meet any of our standards, we shouldn't expect our\nclients to. Part of your role is to build relationships with the technology\nfolks in the client's organisation, find out which bits of governance we need to\ncare about, and make sure your team is in a good position to satisfy them. Often\nthose people you build relationships with will be happy to help if you involve\nthem early enough!\n\nSometimes the amount of governance we need to go through takes an unexpected\namount of effort, particularly when the drive for governance comes from a\ndifferent place to the drive for delivery. We do our best to meet all the\ngovernance needs but when that effort starts to risk delivery, we present those\nrisks, along with alternatives, to the client. Ultimately, it's up to them what\nrisk they're prepared to carry. We often have to do some amount of mediation in\nthat case (usually biased towards delivery - it's what we're there for after\nall).\n\n### …for public services\n\nThe public sector has a history of abdicating digital and technology decisions\nto suppliers. That's caused a loss of the expertise needed even to make sound\ndecisions about those suppliers. That's slowly changing, but it's still very\nnormal to be working with (passionate, driven, experienced) civil servants who\nhaven't worked in an agile way, who don't know how software is built, and who\ndon't know how much software costs.\n\nThat means part of your role is education. For the public sector to properly\ncomplete their digital transformation, it's not enough to put some services on\nthe internet. We need to reverse that loss of expertise, so that all the folks\ninvolved in building services are able to make well informed decisions. As a\ntech lead:\n\n* you understand how software is built\n* you understand how to work in an agile way\n* hopefully you understand how much software costs (though we're always happy to\n  teach you how to think about this)\n\nShare that understanding.\n\nAnother feature of public sector technology (though by no means unique to the\npublic sector) is a lack of money to compete with big tech and venture capital\nwhen hiring. That means there can be a lack of experienced technologists, and a\nshort tenure for those technologists they do manage to hire. But it also means\nyou'll often be working with folks who are motivated more by doing public good\nthan they are by chasing money.\n\n### …at the intersection of the two\n\nWhen building a public service, it can be hard to ever call it done. Especially\nwhen much of your team's time is spent dealing with broken foundations (lack of\nAPIs, legacy systems, or messy and incomplete data) rather than building the\nservice. But the lack of money in the public sector means we often have to\nsupport our clients in building something that's good enough, before they\nredirect their resources onto other priorities. You can serve the users and\nclient best by building in an agile way throughout. Always find the minimal\nversion of the feature your team can ship, and leave it open for iteration\nlater. With luck you'll get to do that iteration, but if you don't our client\nwill have a service that's always in a workable state no matter where we stop.\n\nGovernance is generally a good thing when built from an understanding of how to\nwork in an agile way and how software is built. When it comes from a history of\nsupplier management, it can instead smell a lot like waterfall approaches and\narse covering. If you're in this situation then building relationships becomes\neven more important. You'll need to engage with the governance processes, but\nyou'll also need to push back against parts of them. It's likely that the client\nis undergoing something of a digital transformation, so there are probably\npeople there who can help you push an agile approach. You're not on your own in\ndoing this; get other folks in the team (like your delivery lead or technical\narchitect) to help, and call on the wider dxw team when you need it.\n\n## What our tech leads do inside teams\n\nThe role of a tech lead at dxw is to lead the technical work of the team. Given\nsoftware is built by and for people, that means it's very much at the squishy\nintersection of technical expertise and people skills.\n\nA tech lead's job is to:\n\n* translate the problems to be solved into pieces of technical work for the team\n  to pick up\n* advocate for building software that meets user needs\n* make sure the rest of the developers understand the domain and the work, and\n  aren't blocked from doing it\n* encourage people to pair together on tricky work or to build team knowledge\n* teach other members of the team, directly and by example, encouraging them to\n  make sure their work is clear and maintainable\n* make sure that the team has the opportunity to learn\n* keep an eye on the development processes of the team, and address issues (e.g.\n  stories continually taking much longer than expected, people being blocked by\n  PRs not being reviewed, lots of time spent chasing down bugs)\n* be a technical representative for the team - taking (necessary) meetings and\n  answering questions on behalf of the whole team, allowing them to focus on\n  development work\n* be responsible for the team learning from failure and for incident reviews\n  happening when something goes wrong\n* ensure that the development process and repository follow our\n  [RFCs](https://github.com/dxw/tech-team-rfcs)\n\nYou will often, but not always, be the most experienced developer on the team.\nWhen you are you'll also be expected to make clear and informed architectural\ndecisions, and communicate those with the team and stakeholders.\n\nA lot of those points overlap to various degrees with things a delivery lead or\nproduct manager do. The relationship between the tech lead and the people in\nthose roles is very important. Addressing issues with team processes is a lot\neasier when done together with the delivery lead. Ensuring the team understands\nthe domain and that developers are included early enough in story planning\nshould be done with the help of the product manager."},{"id":"card-sort","name":"Card sorting","content":"**Things you'll need:** Index cards, post-it notes, pens, a large table, 3-5\nparticipants, an observer/note taker, a smartphone for pictures.\n\n**Estimated time:** 60 minutes\n\n## Best to use when\n\nCard sorts are a good way to figure out what to call things and how they should\nbe organised so that users can find what they are looking for.\n\n### There are two types of card sorts:\n\nOpen - participants group content, ideas, needs and come up with a name for the\ncategory.\n\nClosed - participants move content, ideas, and needs to already named\ncategories. This is useful for later stages of the design process. This might be\nwhen initial rounds of sorting are already done or content needs to be revised\nwith established structure already in place.\n\n### You can also think of these as two parts of the design process:\n\nUse open sorts to understand what goes together and what it should be called.\nUse closed sorts to test, validate and revise what you already have with more\npeople and other types of users.\n\nHybrid sessions are also useful. You provide categories but let people create\nnew ones, and remove and rename categories if they feel it doesn’t fit into any\nof the existing ones.\n\n## Instructions\n\n1. Prepare category cards for each participant\n\n   * Write categories on cards for a closed sort. You might have identified\n     these through a quantitative/automated sorting, through discussion/design\n     sprint or in previous card sort sessions.\n2. Prepare some content cards for each category (a set for each participant)\n3. Ask participants to group the cards in the way that makes sense to them and\n   give the groups names\n\n   * For a closed sort participants move content cards into categories you’ve\n     prepared\n   * A variation of ‘other pile’ and allowing participants to amend and create\n     new categories are often useful particularly in the first round of sorting\n4. Discuss why they grouped the cards the way they did\n\n   * This part is where the notetaker/observer must really listen for comments,\n     reasoning and questions. Equally, the notetaker should take notes of\n     comments and questions that arise as poeple work on the groupings.\n5. If there too many categories and time allows, you can try to get participants\n   to reach a consensus\n6. Repeat\n\n## Things to remember\n\n* **Quantitative vs. qualitative sorts** An automated quantitative sort online\n  can be a good start to identify categories. They can also be used to test your\n  sort on a larger scale after the in-person sessions.\n* **Granularity is important** Pieces of content selected for the cards can be\n  from individual pages, functionality, small groups of pages, or whole sections\n  of the site. Be consistent with the groups you are working with otherwise\n  participants will struggle and there will be a lot of inconditency between\n  groupings.\n* **People get tired** Avoid the temptation to sort everything in one go. Limit\n  the number to 30-40 cards\n* **Consider the loudest voices** When discussing the reasons for groupings and\n  moving things around to reach a consensus, be mindful of the loudest people in\n  the room and how this affects results\n* **Randomise** When giving participants a stack of content cards, make sure to\n  randomise the order they’re in\n* **Take lots of pictures** Clearly mark these with the participant, date and\n  number\n* **Take notes in a way that is easy to analyse** For tips on how to take notes\n  for agile analysis see\n  [How we capture research data for agile analysis](https://www.dxw.com/2016/12/how-we-capture-research-data-for-agile-analysis)"},{"id":"claiming-expenses","name":"Claiming expenses","content":"This guide gives details on the information you need to provide to claim an\nexpense. For more general information about expenses, visit the\n[Expenses section of the Playbook](/#claiming-expenses).\n\nWe create expenses using Xero. There is an Expenses section on the page after\nyou log in where you can see details of your expenses. If you're expensing\nsomething new, you can go\n[straight to the form](https://expenses.xero.com/!wrUP-/detail/create-new).\n\nTo create an expense, you add all the receipts related to it to Xero, and submit\nthem together as a claim. If you don't have receipts, you'll need to talk to\nVanessa.\n\nEach receipt requires the following details:\n\n* **Receipt from**: The full company name of the seller\n* **Date**: The date on the receipt (ie, the date the expense was incurred, not\n  the date you're adding it)\n* **Reference**: The invoice or receipt number, or some other unique identifier\n* **Total**: Leave this as 0.00: Xero will calculate it for you.\n* **Copy of receipt**:: Just above the Total field, you should see a small file\n  icon. Use this to upload a photograph or scan of your receipt. If you upload a\n  photograph, make sure it's legible.\n* **Description, quantity and unit price**:: Add the the description of the line\n  item on the receipt. If that text is not very descriptive, though, consider\n  elaborating. Add the quantity and the price of an individual item.\n* **Account**:: See below.\n* **Tax rate**:: The tax rate will be set automatically from the account you\n  select, however you must check that it is correct. Check your receipt to see\n  what VAT, if any, was charged. If you cannot see a reference to VAT, select No\n  VAT in this field. It is very important to get this right as this data feeds\n  directly into our VAT returns.\n* **Products**:: If the expense relates to a particular area of work (at the\n  time of writing: Agency, Hosting or Citrulu), select the applicable product.\n  If not, leave it blank.\n\n## Choosing an expense account\n\nEach item on a receipt needs to be allocated against a specific expense account.\nThis is so that we can tell how much we spend on categories of things. If you\nhave a receipt or invoice with a large number of items that all fit in a single\naccount, it's fine to total them up and add that as one line.\n\nIf you're not sure what account type to use, please ask. Do not use General\nExpenses unless there is definitely no other account that is suitable.\n\n### Account types\n\n* **325 - Direct Expenses**: A cost that is part of producing work that we are\n  contracted to provide; for example, stock photography or fonts. This does not\n  include incidental expenses (like travel) or contractors (which have their own\n  account, and cannot be expensed)\n* **326 - Direct Expenses (Hosting)**: As above, but for hosting contracts. For\n  example, an SSL certificate.\n* **400 - Advertising & Marketing**: Costs that are part of marketing or\n  advertising our services; for example, sponsorships\n* **420 - Departmental Meeting**: This should be used for refreshments bought\n  for staff, including meals etc as long as they are consumed in the course of\n  working. This includes evening meals when working late.\n* **424 - Entertainments**: This should be used for any entertainments you\n  provide to clients or other stakeholders. Claims in this category are\n  scrutinised particularly carefully. Given the obvious potential for abuse it\n  is particularly important that these claims are necessary and proportionate.\n* **429 - General expenses**: This is the account to use if there is nothing\n  else that fits. Please check before using it.\n* **461 - Printing and stationery**: Stationery is hopefully self-explanatory.\n  Printing here would include business cards or headed paper, but would not\n  include flyers or brochures, which should go under 400 - Advertising &\n  Marketing.\n* **463 - Software and consumables**: Software does not include hosted\n  applications - only software that we are licensing for use on a local machine.\n  Consumables is a catch-all for items which have little or no resale value; for\n  example, mugs or low-cost computer peripherals.\n* **489 - Telephone & Internet**: You may expense a portion of your telephone\n  bill if you have made calls or used data on a personal device.\n* **493 - Travel**: Business-related travel"},{"id":"contributing","name":"Contributing to the Playbook","content":"The Playbook is public and anyone, inside or outside of dxw, can suggest changes to it. This means you!\n\nWe manage changes via GitHub 'Pull Requests'. This is a technical term for requesting a specific change is made to a repository of text. Often this text is code, but in this case it's the contents of this playbook. It allows everyone to see exactly what changes are being proposed, and for discussion and changes to be made before it is 'merged', and those changes to be recorded for the future.\n\nIf you're experienced in doing this, then all you need to know is that this repository is available at <https://github.com/dxw/playbook>\n\nIf creating a pull request is new to you, then don't worry, here is a guide to use Netlify CMS to create one for you.\n\n## What you will need\n\nYou will need a GitHub account. If you don't already have one, then [sign up here](https://github.com/signup). You do not need to be added to the dxw GitHub organisation to be able to suggest changes.\n\n## Suggesting a change\n\n1. Click on the yellow 'Contribute' link\n2. If you are not logged in, you need to log in with your GitHub account\n3. If you are asked if you want to 'fork the repo', you do.\n4. Choose the page you want to change.\n\n   * If it is the homepage, then click 'Index page'\n   * If it is one of the guides, click 'Guides' under 'Collections', and then click the guide you want to edit\n   * If you want to create a new guide, click 'Guides' under 'Collections', then click the 'New Guides' button.\n5. Make your edits in the 'Rich Text' editor.\n6. Click 'Save' at the top of the page\n7. Click 'Status: Draft' and choose 'In review'\n\nYour suggested changes will not be live yet. Your suggestions should be available to view on the [GitHub Pull Requests page](https://github.com/dxw/playbook/pulls). After a few minutes, you should be able to view a preview of the Playbook with your changes by clicking on the URL next to '😎 Browse the preview'\n\n## Reviewing changes\n\nEveryone's suggested changes that are being reviewed are publicly available. Anyone can publicly comment on a suggested change. Only GitHub accounts that have been added to the dxw GitHub organisation and staff team can 'merge' a pull request and make it live. If you are not on this list and want to be, please email [support@dxw.com](mailto:support@dxw.com) with your GitHub username.\n\nTo see the suggested changes, you can click the 'Files changed' tab to see lines of text that have been removed (in red) and lines of text that have been added (in green). Alternatively you can click on the URL next to '😎 Browse the preview' to see what the Playbook will look like if this change is accepted.\n\nAnyone can comment on a pull request, and the more voices the better. It's suggested that you contact one or two people specifically who you think would be good to review your changes, or alternatively ask in the #dxw-playbook slack channel"},{"id":"daily-standups","name":"Daily standups","content":"## What are they?\n\nA short and focused meeting for the team to check in on progress. They shouldn’t\nlast any longer than 15 minutes. Standups help team members keep up-to-date with\nwhat others are doing. They are also an opportunity to flag when blockers are in\nthe way, so that Delivery Leads (and others) try and remove them. Aside from\nwhat is actually being discussed, standups are also a good opportunity to gauge\nthe mood in the team.\n\n## Who should join?\n\nEveryone on the delivery team should join standups. This includes service owner,\nproduct manager, developers, delivery leads, user researchers and other\nspecialists who may be with you for a short time.\n\n## What does a good standup cover?\n\nA typical standup involves each team member answering the same three questions:\n\n* What did you do yesterday?\n* What are you doing today?\n* What blockers do you have?\n\nSometimes teams like to take a different approach. This could include walking\nthe wall, where you run through the tickets on your task board (e.g. Trello).\nFor dxw support standups you may run through Open support tickets, check the\nstatus of Pending tickets and monitor SLAs.\n\n## Getting the most out of standups\n\n* **Start and finish on time.** Don’t be late and don’t let the meeting drag on.\n* **Follow up with each other if needed.** Make time to have more in depth\n  conversations if you need them.\n* **Keep things tidy.** Make sure the task board is updated afterwards.\n* **Listen to each other.** Can you help resolve a blocker? Does someone’s work\n  impact yours? Can you help make it better?\n* **Follow up on blockers.** How serious is it? Who’s going to help resolve it?\n* **Change it up!** If it gets stagnant, do something different, ask different\n  questions.\n\n## Other tips\n\n* Have a standard set-up that people know how to use, and set time aside for it\n* Use the same space and dial in details. Make sure the links are in the\n  calendar invite.\n* Know how you’re going to facilitate it. This could be the delivery person, or\n  it could be a shared responsibility.\n* Be ready to stop people talking for too long. You can try timeboxing people’s\n  updates if this is a recurring issue.\n* Don’t forget to follow up on actions and blockers.\n* For tickets that are taking a long time to get done, try breaking them down\n  into smaller items."},{"id":"dealing-with-an-incident","name":"Dealing with an incident","content":"## Introduction\n\nThis guide defines what an incident is, how we react to them, and how we follow\nthem up. It's primarily for technical people, but will be useful to anyone\ninvolved in incidents. Anyone can declare an incident, but it is the\nresponsibility of the on-call support person to deal with an incident.\n\n## Summary\n\n* Identify the problem\n* Decide if it’s an incident\n* Create an incident channel with /incident\n* Appoint an incident lead\n* Decide severity - critical, major, or minor (when it doubt, go higher)\n* Communicate the problem\n\n  * If major or critical, post in #general\n  * Appoint a client comms manager if clients are affected\n  * Inform the CTO, Head of Tech Ops, and DPO if there is a security or data\n    breach\n* Understand, contain, resolve, and monitor the incident\n* Schedule a review meeting\n* Write up a first draft report and circulate it\n* Hold the review meeting\n* Write up the final report\n\n## What is an incident?\n\nAn incident can be any unplanned interruption in or an unexpected reduction in a\nservice’s quality, security, redundancy or performance.\n\nThere is no hard and fast rule about what is and isn’t an incident, but\ngenerally something is an incident if it:\n\n* Affects security or discloses sensitive data\n* Causes data loss\n* Causes a site to be unavailable\n* Impacts front end users for more than a couple of minutes\n* Causes a significant departure from expected behaviour\n\nIncidents are usually acute (short and sharp) problems rather than chronic\n(long-running) ones. For example known long-term bugs are generally not\nincidents.\n\nIncidents for which reporting would be appropriate will include\n\n* A site not responding to requests (from a small number of failures to a\n  significant number. I.e. an outage)\n* A site is responding to a significant number of requests with an error, eg 503\n  (although not for expected errors, e.g. 404 for files not expected to exist)\n* Supported browsers being presented with errors (e.g. certificate warnings)\n* Unauthorised content being made publicly available (e.g. a site defacement)\n* Unauthorised exposure of sensitive data. (e.g. user credentials being exposed)\n* Any event which triggers a significant warning level on an alerting system\n\nSome things that would be an incident on one site would not be on another. For\nexample a denial of service (DOS) attack would be an incident if it knocked out\na smaller site, but would not be one if it just increased load times slightly on\na larger site that is attacked regularly.\n\nIf you are unsure, then assume it *is* an incident.\n\n### Out of hours alerts\n\nOut of hours is between 18:00 and 10:00, during this time only respond to\ncritical alerts and emergency tickets. You should treat all such alerts as\nincidents, and you should not be afraid to wake up 2nd line support if you need\nhelp.\n\nIf the incident is critical or major then you should immediately escalate to 2nd\nline support. If it’s something less severe, then you should generally escalate\nit if you can’t fix it within 30 minutes, but you can also escalate it sooner if\nyou think it’s needed.\n\n2nd line support are there to help you, and it is always better to wake them up\nwhen they’re not needed than to not contact them when they are needed. When in\ndoubt, wake them up.\n\n## Declaring an incident\n\nIf you are not a technical person, then your first step should be to inform the\non-call support person whose job it will be to go through this process.\n\n### Identifying the problem\n\nYour first step should be to understand the problem. How best to do that will\ndepend on the incident, but we mostly run simple websites so the following are\nalways good steps:\n\n* Is the site or server available? Use\n  [Airtable](https://airtable.com/tblne7bw5jfACz2XB/viwF0lQjetG2ICuO2?blocks=hide)\n  to discover the URL\n* Check if this alert is a currently known event in ops/docs and read any\n  previous guidance\n* Find the available tooling for this site/server, see Airtable and the repo\n  documentation\n* Investigate the issue using available tooling to improve our understanding of\n  the impact of this event (looking at logs, metrics etc.)\n\nOnce you have identified the problem see if there is an\n[Ops Docs](https://git.govpress.com/ops/docs) guide for this error.\n\n### Declaring an incident\n\nIf your preliminary investigation suggests that the problem is an incident, then\nyou should declare an incident. If in doubt, declare an incident. An incident is\nnot a sign of failure.\n\nWe have [incident.io](https://docs.incident.io/creating-your-first-incident)\ninstalled on the dxw Slack for this purpose.\n\n1. Type /incident &lt;name&gt; in any Slack channel, the name should be\n   something short but understandable like \"example.com errors\"\n2. Give the incident a description, e.g. \"We are seeing a large number of 503\n   errors being returned on example.com\"\n3. Select a severity level (see below)\n4. Set an incident lead with `/incident lead me` or `/incident lead @person` –\n   The incident lead does not have to be you and may change over the course of a\n   response (see below).\n\nIf it is a major or critical incident, you should post a notice in #general so\nthat everyone is aware. Something along the lines of:\n\n```\nWe have been having a security incident with some wordpress sites since 09:00.\nSee [#inc-2021-07-01-mavis-sites](https://dxw.slack.com/archives/C026BN221D5)\n```\n\n### Deciding severity\n\nWe have three levels of severity (based on\n[those used by GOV.UK](https://insidegovuk.blog.gov.uk/2016/05/11/categorising-incidents-on-gov-uk/)).\nTo decide which one is most appropriate, we ask three questions:\n\n* What’s the urgency and why?\n* What’s the impact on our users and systems?\n* What’s the extent of the issue and how many systems and users are affected?\n\nIf you’re torn between two categories, opt for the higher one. It’s always\nbetter to escalate an issue than to miss something important. We can easily\ndeescalate if things turn out to not be as bad as we thought.\n\nYou may find that an incident that initially seems minor turns out to be more\nsevere as you investigate it further.\n\n#### Critical\n\nThe most serious kind of incident. This is generally when there’s an outage of\none or more sites during a period when they would be expected to be available,\nor a significant security or data breach such as significant privilege\nescalation from an unapproved user. Dealing with a critical incident takes\npriority over all other work and will continue out of hours until the incident\ncan be downgraded.\n\n#### Major\n\nWhen major functionality, such as site search, is broken, or there is a small\nsecurity or data breach. For example flaws allowing for significant privilege\nescalation from an approved user. This will be dealt with during working hours\nabove other non-emergency work.\n\n#### Minor\n\nThis is the lowest level of incident, but will usually still take priority over\nregular work. Generally, we’ll declare a minor incident if minor functionality\nor internal tools aren’t working as intended. In terms of software security\nrisks, this covers security risks that may exist on the server for which we are\nnot currently vulnerable to.\n\n#### Trivial\n\nFor retrospective issues that still need to be treated as incidents, such as a\nshort (minutes) outage for a site outside what might be considered a time of day\nthat the site would be relied on being available. This covers events that may\nhave been retrospectively responsible for availability issues, as well as scans\nthat seem sufficiently novel or deliberately targeted.\n\n### Assembling a team\n\nAn incident should always have an incident lead. The role of the incident lead\nis to have an overview of the whole incident, decide what should be done and by\nwhom, and to manage internal comms. They are responsible for ensuring that the\nresponse process outlined in this document is followed.\n\nThe incident lead is not necessarily the person responsible for the\npost-incident work. At the end of the incident response, a decision should be\nmade about who does the investigation and write-up, and organises the review.\n\nThe incident lead will generally initially be the person who discovered the\nproblem, but may change to whoever is best placed to deal with the problem at\nany given time. If you are not confident being the lead, you should hand it over\nto someone more senior.\n\nMany of our incidents are very small, and don’t need multiple people to address\nthem. In those cases the incident lead is often just managing themselves.\nHowever, large incidents do need multiple people, and the lead should be\ndelegating work rather than doing it themselves so that they can focus on\nmanaging the incident as a whole.\n\nIf an incident impacts clients, then a client comms manager should also be\nappointed. Smaller incidents may not need that.\n\nBoth of these positions can be exhausting and if you are at it for a long time\nyou are likely to make mistakes, so if the incident runs for more than a couple\nof hours then new people should step into these roles.\n\nIf the incident is critical, then you should let the CTO (Dom) and Head of Tech\nOps (bob) know, as well as our Data Protection Officer (Gurps). If you can’t get\nhold of these people, post in #general and tell the most senior people you can\nfind.\n\n## Responding to an incident\n\nWhen responding to an incident your goals are to:\n\n* **Understand** what is happening\n* **Contain** any breach. Revoke any unauthorised access, remove any\n  modifications and identify if any data has been compromised. Preserve data\n  that may be required for later investigation or forensics.\n* **Restore** normal service by taking action to resolve the problem\n* **Monitor** systems to ensure that they continue to operate normally\n\n### Communication\n\nCommunication is key during an incident. Use the incident channel to discuss\nwhat you are doing, even if you’re the only one doing it.\n\nAny commands you run and changes you make should be recorded in the channel.\nThis reduces miscommunication, helps keep track of where we’re at, and ensures\nthat no one person is an information bottleneck. It also helps us determine\nlater whether any follow-up work is needed.\n\nAfter the incident it should be possible to reconstruct what was done based on\nthe channel logs. It’s much easier to record what you’re doing as you’re doing\nit than to try to remember the next day. We also want to learn how we can\nimprove and prevent incidents in future, and looking at how we respond to\nincidents is a key part of that. This is not about being able to blame anyone,\nit is about learning.\n\nThe incident.io Slack bot will prompt you to provide a summary every 30 mins,\nand you can also use it to update the status and log actions\n([see bot command reference](https://docs.incident.io/command-reference)).\n\n#### Client communications\n\n*This section is for the client comms manager*\n\nOften we will become aware of an incident because a client has raised a Zendesk\nticket with us, but the incident may also affect other clients.\n\nIf you expect to receive a large number of tickets, you should create a parent\nticket to assign all related tickets to. This helps streamline the process of\ncommunicating with clients.\n\nYou should put together a list of email addresses for affected clients. This\nlist may include senior stakeholders as well as our regular contacts, depending\non the severity of the incident. The primary source for this is the customer\nlists in [Zendesk](https://dxw.zendesk.com/agent/user_filters/1900001763473).\n\nClient communications should be frequent enough to reassure clients we are\nworking on the problem. We suggest hourly updates to affected clients whilst the\nincident is ongoing.\n\n### Fixing the problem\n\nOnce you have an idea of what the issue is, try to determine how to fix it. You\nshould try to test any fix before applying it to confirm that it works and to\navoid inadvertently making things worse.\n\nIf the fix is a change to the codebase, then the normal deploy process (ie.\npassing tests and a PR review) should be followed unless there is a very strong\nreason not to do so.\n\n### When to stop\n\nSometimes it is best to leave the resolution until normal working hours, when\nmore people will be available to help you.\n\nIf an out of hours incident has taken more than two hours, you should stop\nunless you feel you are close or it needs urgent resolution. By this point you\nshould have escalated it to 2nd line support who will be able to help you make\nthat call.\n\nSome clients are more important than others, depending on their public profile\nand the nature of their contract with us. If you are not sure, assume they are\nimportant or ask someone senior.\n\n### Wrapping up\n\nAn incident should be considered resolved when you are confident that you have\nmet all the goals: you understand the problem, have contained it, have restored\nnormal services, and have monitored to ensure the problem is really fixed.\n\nMost incidents require a follow up in the form of a report and a review meeting.\nTrivial incidents and some recurring incidents (such as DDOSing) don’t require\nthis. If you’re unsure, ask someone more senior.\n\nYou should schedule an incident review meeting for about a week later and assign\nsomeone the task of drafting the incident report over the next few days. You\nshould ensure that this person has enough time to complete a draft in time to\ncirculate a few days in advance of the incident review.\n\n## Writing up an incident\n\n*This section is for the person responsible for investigating and writing up the\nincident. This will not necessarily be the incident lead who responded to the\nincident.*\n\nMost incidents get a report,\n[based on this template](https://docs.google.com/document/d/1J9bz-B8AxM7fWl7GFxSj7y287f_mmiLRWBHsubQ2wsA/edit),\nwith:\n\n* An overview of the incident, including impact figures\n\n  * requests/visits/users impacted and over what time\n* A timeline of events and response actions\n* An explanation of the incident, including contributing factors\n* Any proposed actions\n\nThis is primarily an internal document, but a condensed version will be made\navailable to the client. You should store it in a new folder in the\n[incidents folder on Drive](https://drive.google.com/drive/folders/1BkebF1TtHSrP863K8Y2uScDa0VSETdYj?usp=sharing)\nalong with all files relating to the incident.\n\n### First draft\n\nYou should prepare a draft report immediately after the incident, and should\nfocus on the objective data like Slack transcripts, screenshots, and logs.\nSubjective data like opinions, judgments, assumptions, and beliefs will come up\nin the review meeting. You should avoid using names to avoid appearing to blame\npeople.\n\nYou should circulate the draft to those involved in the incident in advance of\nthe incident review meeting, and any minor amendments should be done as\ncomments/suggestions in the doc. Anything that requires discussion should wait\nuntil the incident review. Getting comments in advance helps us make the best\nuse of the meeting time.\n\n‘Draft’ in this case means that all sections should be completed in at least\noutline form, but there may be some outstanding questions that need answering\nand some additional detail that is needed. Part of the purpose of the incident\nreview is to fill in these gaps.\n\n### Final version\n\nYou should produce a final version of the report with more detail following the\nreview meeting (see below).\n\nAn abridged version with a link to the full report should be published\ninternally on Bikeshed, and copy should be shared with the affected clients\n(usually through a Zendesk ticket). You should check the client version by Dom\nfor anything that might make us commercially liable, but as a rule we should be\nas open as possible.\n\n## Reviewing an incident\n\n*This section is for the incident review facilitator, who should not normally\nhave been involved in the incident response*\n\nA few days after an incident, we hold an incident review meeting. These are\nusually 1.5-2 hours long depending on the complexity of the incident.\n\n### Purpose\n\nThe primary goal of the review is learning. We want everyone involved to get a\nfull understanding of what happened and the thinking behind how we responded.\n\nCrucially, the review is not about blame. When reviewing incidents we follow the\n‘[prime directive](https://retrospectivewiki.org/index.php?title=The_Prime_Directive)’:\n*“Regardless of what we discover, we understand and truly believe that everyone\ndid the best job they could, given what they knew at the time, their skills and\nabilities, the resources available, and the situation at hand.”*\n\nWe don’t know enough about our system, which is why something went wrong. For\nthe review to be effective it should be a blameless learning experience. We want\nto learn about the process of the incident and its handling as well as the\ntechnical issues.\n\n### Attendance\n\nThe discussion should include the people who responded to the incident, a\ndelivery manager (if there was a client impact, preferably for the relevant\nclient) and any other staff who have an interest:\n\n* People involved in the incident must attend\n* People involved with the client should attend\n* Available members of the tech team should attend\n* Other members of the company can attend\n\nIf there is ongoing work with the client (ie. an active sprint) then the sprint\nteam (including the client’s staff) should attend.\n\nIf the incident was a major incident, the review should include a senior member\nof staff not involved in the initial response (a head of something).\n\nBear in mind that when the audience is large or includes outside parties, people\nmay feel less comfortable speaking up, so you should provide a means for people\nto raise comments outside of the meeting too.\n\n### Facilitation\n\nThe meeting should, wherever possible, be facilitated by someone who was not\ninvolved in the incident. There should also be a separate dedicated note-taker\nso that the facilitator can focus on facilitation.\n\nAs the facilitator your job is to lead the meeting, picking the key topics of\ndiscussion, moderating the conversation to ensure that everyone involved feels\nsafe sharing their story, and checking that everything gets covered. It is\nrecommended that you read through the\n[Structure and Preparation section of Etsy’s guide](https://github.com/etsy/DebriefingFacilitationGuide/blob/master/guide/04-structure-and-preparation.md).\n\nDon’t go through the timeline line by line because this is not a good use of\ntime. Everyone should have seen the timeline in advance and made any necessary\ncomments on it. Instead you should focus on the interesting communication\npatterns, decision points, observations, and actions that require a deeper dive,\nusing the timeline as a prompt.\n\nThe key idea is that when somebody says “X happened” you take the opportunity to\nask questions that provide context for X. Not everyone in the discussion will\ncome to the meeting knowing that context, so it’s important not to skip over\ndetails as you walk through the timeline.\n\nThe review should focus on the *how* rather than the *why*. ‘How did the\nattacker gain access to the database?’ is more useful to us than ‘why was the\nattacker able to access the database?’, and shifts the conversation away from\nblame and towards learning. See\n[The Art of Asking Questions in Etsy’s guide](https://github.com/etsy/DebriefingFacilitationGuide/blob/master/guide/05-the-art-of-asking-questions.md).\n\nPeople may not be expecting this approach, or may be new to incident reviews, so\nclearly set out the focus of the meeting at the start.\n\nSome key questions:\n\n* What happened?\n\n  * What made us declare an incident? What triggered this?\n  * How did we respond?\n  * What were the key decision points?\n  * How did we make those decisions?\n* Have we taken all the restorative actions that we need to take?\n* Do we have a plan for communicating with the client/s?\n* How can we do better at responding to incidents?\n\n  * How could our processes be improved?\n  * How could our documentation be improved?\n* How could we prevent this kind of incident from happening again?\n\nIt is easy to focus on the ‘how could we prevent this kind of incident from\nhappening again?’ part of the discussion and get thinking about preventative\nactions. This is not the focus of an incident review. If there are major flaws\nin our setup then we should address these, but many incidents are a result of\ncircumstances that are unlikely to reoccur, and our time would be better spent\nensuring that we can respond effectively to all kinds of incidents. Wider\ndiscussion points like ‘should we develop a process for auditing package\nupdates?’ should be held for a tech team forum.\n\n### Notes\n\nNotes should be taken, and it should also be recorded. These files should go in\nthe incident folder.\n\n### Actions\n\nComing up with actions is not the goal of the review, but it’s likely that some\nwill be suggested. Try to hold off on discussing them until after you’ve been\nthrough everything else so that they don’t end up taking you down a rabbit hole.\n\nSometimes all the necessary actions will have been taken during the incident, so\ndon’t feel obliged to come up with some actions. Equally you may find that there\nare many follow-up actions. In that case, try to narrow this down to about three\nso that they actually get done.\n\nAny actions should be added to the relevant Trello board (the\n[incident actions board](https://trello.com/b/XIuS4lt5/incident-actions) for\nincident specific stuff, the\n[internal tech tools board](https://trello.com/b/rYxrpsVu/dxw-internal-tech-tools-tasks)\nor [tech team leadership board](dxw-tech-team-leadership) for more general\nthings), given an owner, and dealt with in a timely manner."},{"id":"design-career-progression-framework","name":"Design career progression framework","content":"## Why do we have a career progression framework?\n\nNot knowing if progression can ever happen for you, or if it always feels out of\nreach, or if you feel as though your growth isn’t translating into something\nthat’s recognised, it can be demoralising. You should see a clear pathway,\nvisible opportunities to progress, and the benefits of each level of progression\nlaid out plainly.\n\nAfter your progression review, you should be able to clearly identify areas for\nimprovement. Your line manager can work with you in a subsequent 1:1 to help\ncreate a plan of action to achieve your goals.\n\nHaving a framework helps us to ensure a more level playing field for all. We can\neliminate bias by mapping progression to objective criteria instead of time\nserved, negotiation skills, age, gender etc.\n\nA framework helps get open consensus between you and your manager on your level\nof progression; any ambiguity, or an unexpressed gap between your opinions on\nyour level, could lead to disappointment.\n\nIf your manager was to suddenly disappear into thin air, your progress should\nnot disappear with them. A framework keeps a record of this information.\n\n## How will it work?\n\nThe framework measures progression through a set of proficiencies, against\nlevels of progress.\n\nThere are six areas of proficiency:\n\n* Design\n* Technical\n* Communication\n* Delivery\n* Empathy\n* Leadership\n\nAnd there are currently four levels of progression:\n\n* Designer level 1\n* Designer level 2\n* Designer level 3\n* Designer level 4\n\nNote: these are not roles, or titles — those remain “Designer”, and “Senior\nDesigner”. It is important to note that you do not need to be at level 4 to\nprogress to a Senior Designer. Each criterion indicates at what level is\nrequired to become a Senior Designer.\n\nProgress from one level to the next relies on a designer demonstrating\nproficiency in all its areas. These levels are mapped to salaries.\n\nWe’ll extend the framework to cover junior designers when we make our first hire\nin that role. We’ll also look at adding level above 4 when we appoint seniors.\n\n## Progression doesn’t have to mean becoming a manager\n\nDoing line management is not a requirement for progression at dxw. To deliver\ngreat work for our clients we need great practitioners; to build an effective\nteam and business we need great managers.\n\nThere is some overlap between practitioner and manager at the senior level,\nwhere we have expectations of mentoring and teaching. Requiring a designer to\ntake on line management responsibilities in order to progress to a senior role\ncould result in them growing to resent the responsibility, and worse, in the\nperson that designer is line managing being completely under-served.\n\nGetting up and running won’t be straightforward, but we’ll be designing people’s\ncareers — not just for those here now, but for those to join in the future.\n\n## The Framework\n\nThe framework content – levels and proficiencies – is kept as a\nsingle-source-of-truth in a Google Sheet (shared internally at dxw only, for\nnow).\n\nIt’s entirely down to team members how they gather examples to use as discussion\npieces for review meetings. You might use Google Docs or Sheets, or Trello, or\nMiro. Whatever works best for you is fine, but you will need to be able to paste\nlinks to whatever you’ve collected into your tracking GSheet at review time.\n\n## Tracking progression: review meetings\n\nAt regular intervals throughout the year, your usual 1:1 with your manager will\nbe substituted for a meeting where together you’ll review your progression as\nmeasured against the framework.\n\nReview meeting dates should be flexible and set by the design team members in\nconsultation with their manager — but with the condition that they must be no\nless than three months apart, and no more than six months apart. These meetings\nwill be scheduled for 90 minutes; they can be quite intensive, so we’ll have the\nopportunity for a half-time break.\n\nIn these meetings you’ll review progress on your chosen proficiencies over the\ntime since your last review. You’ll also choose the proficiencies you’d like to\nconcentrate on in the time before your next review. Narrowing it down to a\nhandful will enable you to focus more deeply on each proficiency. You’ll also\noccasionally look retrospectively at levels of proficiency you’ve already\nachieved, to make sure they’re still an active element in your day-to-day work.\n\nEvery member of the team has their own Google Sheet, with a tab dated for each\nformal review, where levels of proficiency are tracked and displayed as charts.\nThese sheets are the single source of truth for an individual's progression, and\nthey're filled out with your manager in the review meeting.\n\nIf you and your manager can't reach agreement about something in a progression\nreview, or your progression in general, either of you have the option of\ninvolving a third party — colleagues from dxw, or someone external to the\nbusiness.\n\n## Where did the framework come from?\n\nWe’ve borrowed from others who’ve got established frameworks, and added our own\ndxw specifics. Our framework borrows elements and approaches from those in use\nat places such as Clearleft, Monzo, Buzzfeed, the Financial Times, and GDS. It’s\nthen been refined and customised to suit how we actually work and practice\ndesign at dxw."},{"id":"getting-a-project-ready-for-support","name":"Getting a project ready for support","content":"For some projects, once the primary development phase has wrapped up dxw will\ncontinue to offer support (subject to a support contract). Since we rotate\nsupport staff, things need to be in place to let them effectively respond to\nissues.\n\n## Make sure the documentation is up to date\n\nSupport developers may not have context on the project, and rely on the\ndocumentation to effectively solve problems. For most projects:\n\n* The `README` file should cover how to download a project, install any\n  dependencies, and start a working development instance (if necessary including\n  seed data). We recommend using the\n  [Scripts To Rule Them All](https://github.com/dxw/scripts-to-rule-them-all)\n  pattern to automate this as much as possible.\n* As much documentation as possible should be kept in one place, ideally in the\n  repository alongside the code. Remember to check that documentation doesn't\n  contain any secrets.\n* There should be a single 'front line support' runbook which covers common\n  support tasks (if necessary linking to other documentation) in as much of a\n  step by step process as possible. This may be stand-alone in the repository\n  alongside the code (preferred), or in the operations documentation repository.\n\n  * Add the link to this document to the Project Knowledgebase **support\n    runbook** field (see below).\n* If there is a specific process for on-boarding developers before they can\n  support the service (eg creating user accounts, elevating permissions) then\n  this should also be kept in a single step by step document.\n\n  * Add a link to this process to the\n    [set up person for support](https://trello.com/c/EblCSAdY/57-set-up-person-for-support)\n    checklist template, so that new support developers will follow the process.\n  * Make sure that existing support developers know there is a new on-boarding\n    checklist to follow.\n\n## Add the project to Project Knowledgebase\n\nOur [Project Knowledgebase](https://airtable.com/tblne7bw5jfACz2XB/) is the\nstarting point for support agents who are new to a project - it displays key\ninformation about the project alongside requests in Zendesk. Each project should\nhave a row in the Projects table which has been completed.\n\nThe basic information needed for each project is its **name**, the **client**\nthe work is with, the **maintenance status** (if the project is currently\nsupported or not), and optionally if the project is under a specific **support\npackage**.\n\nYou should also add the **account manager** and any **delivery managers** who\nhave particular knowledge about the project. Add any **developers** who would be\nsuitable for second line escalation of issues. You can either reuse an existing\nperson record (the majority of developers and managers in dxw already have\nthese), or create a new one.\n\nComplete as many other fields as possible. If you need help or aren't sure what\nto add, please ask in Slack.\n\n## Add the project to the operations documentation\n\nMake sure the client has a document in the\n[operations documentation](https://git.govpress.com/ops/docs) repository. It\nshould include either documentation or (preferably) links to documentation for\nany on-boarding steps needed, and the front line support runbook.\n\n## Set up monitoring systems\n\nMake sure that enough monitoring systems are in place to raise warnings in case\nof outages, errors or service degradation (the exact level of monitoring will\ndepend on the project and support contract).\n\n### Make sure error reports are raised in Zendesk\n\nIf errors are being raised by monitoring they must be delivered to our Zendesk\ninstance so that the support developer can triage and address them.\n\nYou should consider if alerts being raised are actionable by whoever is on\nsupport; if there is nothing that can be done about it then the alert will only\nbe creating extra noise."},{"id":"guide-to-wellbeing-at-dxw","name":"Wellbeing at dxw","content":"The wellbeing of our team is hugely important - if you have any physical or mental wellbeing concerns, this guide will give you a path to support.\n\n## Mental and physical health support\n\ndxw offers the following to support your health and wellbeing - we want to ensure that you are well set up and looked after during your employment:\n\n* Safe homeworking set-up: if you require any [ergonomic items](https://playbook.dxw.com/#getting-things-you-need), additional travel support or an assessment of your home or office working set up ([DSE](https://www.hse.gov.uk/msd/dse/)), you can find support through your line manager and the HR team to arrange this.\n* Accessibility information for our shared office spaces can be found [here ](https://playbook.dxw.com/guides/office-accessibility.html)and please speak to HR if you’re interested in support with digital accessibility.\n* Wellbeing based courses can be purchased through the [learning and development budget](https://playbook.dxw.com/#learning-and-development), these are a taxable benefit.\n* Other benefits that address health: [Eyecare vouchers](https://playbook.dxw.com/#eyecare-vouchers), Flu vaccine vouchers offered annually and [cycle to work scheme](https://playbook.dxw.com/#cycle-to-work-scheme).\n* Bespoke dxw support paths to seek help and advice: [Slack groups](https://docs.google.com/document/d/1rIHYqFdEWSmjkUyScx-tIpoFrICO1hG7-SDnSLOR3JM/edit), [Buddy System, Helpers, Line Managers](https://playbook.dxw.com/#other-support-paths) and [HR support](https://playbook.dxw.com/#people-and-hr-team).\n* [Reasonable adjustments](https://playbook.dxw.com/#sickness) to support a disability, long-term health conditions and times of change and challenge. (Some changes and challenges may be, pregnancy, caring responsibilities, menopause & hormone therapies, bereavement, mental and physical health diagnosis and ongoing long term conditions).  \n* Taking the time you need ([compassionate leave, one off carers leave, sickness, annual and unpaid leave](https://playbook.dxw.com/#your-pay-pension-and-other-benefits)) - speak to your line manager for more details.\n* Support through the [Access to work](https://www.gov.uk/access-to-work) grant scheme for those with a disability or eligible health condition.\n* [Flexible working options](https://playbook.dxw.com/#flexible-working) such as change of working pattern, hours or role/project, access to local hot desking and maintaining remote working, to support changing needs.\n\n## Mental and physical health support at a time of challenge or crisis\n\nSometimes our lives both inside and outside of work can be challenging, and many of us will experience poor mental or physical health for any number of reasons.\n\nThis can impact our lives, and sometimes our ability to work as normal. \n\n## Who to speak to \n\n### Line manager \n\nLine managers are your first point of contact for any issues you may be having at work. They are responsible for carrying out dxw’s duty of care, and you should request a 1:1 with your line manager if you need additional support. \n\nThey can listen, support and offer reasonable adjustments as detailed above. They can help review workloads, working patterns, projects, roles and responsibilities and help with resolving anything within the workplace that might be causing concern. They can liaise with delivery leads, heads of and directors where necessary, and take some of the burden from you.\n\n### Mental health first aiders \n\nIf you are experiencing a mental health crisis or think that someone else is, we have a team of trained mental health first aiders who are able to provide initial support. A mental health first aider may identify an existing or imminent crisis and is able to listen and communicate non-judgementally, give initial support and then signpost information or appropriate professional help. \n\nFirst aiders are also a safe place to turn to if you are experiencing any issues with your mental health, and need to talk to someone. Conversations will be kept in strictest confidence, provided that you are not at serious risk of harm.\n\nMental Health First Aiders are identified in the company Directory in Breathe where you can find a direct phone number for them.\n\n### HR \n\nThe HR team is a safe place to turn if you need help with your mental health or general wellbeing at work. We can work with you to identify what additional support you might need.\n\n## Resources\n\nIf you, or someone you know is in mental health crisis and needs medical help fast:\n\n* Ring 999 to contact emergency services\n* Go to your nearest Accident & Emergency (A&E) department \n\nIf it is not a medical emergency but you still need urgent help:\n\n* Ring 111 for professional health advice 24/7 and 365 days a year and guidance on where to access appropriate health services \n* Make an appointment with your GP \n\n### Crisis & emotional support helplines\n\n**Samaritans (UK)**\n\nPhone: 116 123 (freephone, 24 hours a day, 7 days a week)\n\nEmail: [jo@samaritans.org](mailto:jo@samaritans.org)\n\nWebsite: [www.samaritans.org](http://www.samaritans.org) \n\n**SaneLine (UK)**\n\nPhone: 0300 304 7000 (local call rates, 6pm-11pm, 7 days a week)\n\nWebsite: <https://www.sane.org.uk/how-we-help/emotional-support/saneline-services>\n\n### Mental health information helplines\n\n**Mind Infoline (England & Wales)**\n\nPhone: 0300 123 3393 (local call rates, 9am-6pm, Mon-Fri)\n\nText: 86463\n\nWebsite: <https://www.mind.org.uk/>\n\n**SAMH (Scotland)** \n\nPhone: 0344 800 0550 (not a listening service or suitable for people in crisis, Mon-Fri 09:00– 18:00 call charges apply)  \n\nWebsite [www.samh.org.uk](http://www.samh.org.uk/)\n\n**Rethink Advice and Information Service** \n\nPhone: 0300 5000 927 (local call rates, 9.30am-4pm)\n\n### Finding a therapist \n\n**British Association for Counselling and Psychotherapy Register (UK)**\n\nPhone: 01455 883300 \n\nEmail: [bacp@bacp.co.uk](mailto:bacp@bacp.co.uk) \n\nWebsite: <https://www.bacp.co.uk/about-therapy/information-about-counselling/>\n\n**Counselling Directory (UK)** \n\nPhone: 0844 8030 240 \n\nWebsite: [www.counselling-directory.org.uk](http://www.counselling-directory.org.uk)\n"},{"id":"how-we-do-development","name":"How we do development","content":"## Follow our principles\n\nAs developers at dxw, we are guided by[ our team's principles](/#development-team-principles). To help us follow these\nprinciples, we have a standard way of working, documented here. This is the\ndefault workflow we follow, but it's ok to depart from it when a project needs\nsomething different (and documenting that departure helps our future selves and\nothers understand what changed and why).\n\n## Work securely\n\ndxw exists to help public sector teams to make good technology decisions and\nbuild better services. Our reputation is built on our ability to consistently\ndeliver work of excellent quality that exceeds our clients' expectations.\nAmongst those expectations are that we will protect our clients' information.\nThe security of the information which we host, store and process is therefore of\nparamount importance - particularly if it is client-owned or otherwise\nprivileged (eg personal data).\n\n## Follow our standards\n\nWe have a consensus based model for making decisions about some of the ways we\nwork through the [technology team RFCs](https://github.com/dxw/tech-team-rfcs).\nIt's important that you are aware of them and follow them when relevant. They\nare part of how we make sure we're building high quality, secure software for\nour clients.\n\n## Lifecycle of a story\n\n### 1. Find the highest priority thing to work on\n\nUsually, we sort our backlogs by priority during planning, but those priorities\nmight change during the sprint. It's a good idea to look at the sprint in full\nto have a clear idea of what's left to do.\n\n### 2. Understand the task\n\nBefore writing any code, it's important that you understand what you're aiming\nto achieve with the work and how you'll approach it. That might mean writing\nacceptance criteria or talking to someone else about the part of the system\nyou'll be working on. Adding details to the task definition helps you remember\nwhat you're doing and helps others review your work when you're done.\n\n### 3. Create a new branch\n\nAssuming the task involves making changes to a codebase, always start with a new\nbranch. You should usually branch off the latest commit in the main development\nbranch, but there are some times when you’ll want to branch off something else,\nfor example, when building off a recent branch that hasn’t yet been merged into\nthe main development branch.\n\nBranch names are important. When naming a branch, make sure it's clear what it's\nfor.\n\n* avoid using your name as an identifier - it discourages others from picking it\n  up\n* include an identifier for the ticket or story you're working on, like an ID\n* include a short description of the purpose of the change\n\nFor example, while working on a card with ID `123` about generating a report:\n\n* Good: `123/generate-report`, `123-generate-report,` `feature/123-generate-report`\n* OK: `feature/generate-report`, `generate-report`\n* Bad: `123`, `branch-for-123`, `jo-bloggs-123`, `jo-bloggs/generate-report`\n\n### 4. Develop the code and the tests side-by-side\n\nWe aim for full test coverage of our codebases. Part of the value of writing\ntests is in documenting the expected behaviour of the software. That's most\nuseful when you can go back to any point in time and see the intended\nimplementation.\n\nEvery commit should have a fully passing test suite with any new tests added and\nold tests removed as needed to document and validate the changes in that commit.\n\n**Important** Make sure you're following security best practices as you work. If\nyou're not sure what they are, ask before pushing any code onto the internet.\n\n### 5. Commit changes in small steps\n\nGood commits are small, focused, and self-contained.\n\nWe write code once, change it occasionally, but read it frequently. By taking\nthe time to document what we've built and why we enable others to build their\nunderstanding of the codebase too. Once we have a stronger shared understanding\nwe can make more informed decisions, avoid repeated effort, receive more\nvaluable feedback, and spot new opportunities.\n\nWhen creating a commit, make sure to write descriptive commit messages. A good\ncommit message has **a title describing a complete summary of the change in one\nline**, followed by paragraphs explaining:\n\n* what's changed about the behaviour of the code\n* why you made the change\n* how the code changed if there are things that might not be clear to a reader\n* why you took the approach did\n* whether there are any consequences or tradeoffs that you made\n* whether any follow-up work is needed\n* any useful references for a future reader\n\nIf you find you can't fully summarise the change in the title, it's often a sign\nthat your commit could be broken down into smaller parts.\n\n**Important** Never unthinkingly use `git commit .` or similar. Doing that makes\nit very easy to accidentally commit sensitive data that, once pushed, is exposed\nto the world and constitutes a data breach. Use\n[Git's interactive staging feature](https://git-scm.com/book/en/v2/Git-Tools-Interactive-Staging)\nto inspect and select the content you want to add.\n\n### 6. Include any upstream changes\n\nWhen working in a team, other pull requests will often get merged in before\nyours is finished. It's important to make sure you're developing against the\nlatest version of the code base as much as possible.\n\nIt's a good idea to constantly rebase your code on top of any changes that\nhappened after you created your branch and confirm that your new behaviour is\nunchanged and the tests all still pass. It's a lot easier to do that if you're\ndoing that continuously than after working for a while, as you'll have less to\nfix or update.\n\nWe prefer to rebase instead of merging upstream changes to keep the commit\nhistory as clean as possible. You probably want to do an interactive rebase so\nyou can see what's going to happen before it does (and this also gives you an\nopportunity to review, tidy up, and rearrange your commit history as needed).\nRebasing can take some practice to get used to if you haven't done it often. Ask\nfor help if you need it.\n\n### 7. Tidy up your commits\n\nBefore requesting a review, consider tidying up your commit history on the\nbranch to tell a clear, coherent story. We tend to review PRs commit by commit,\nas it allows you to see how the feature builds up on the branch, and having\natomic, easily-digestible commits that logically flow from one to the next makes\nthis a lot easier to review. Try to avoid touching unrelated code in the same PR - if you spot something that might need refactoring, do it in its own PR.\n\nHere’s an example of the sort of history you might want to tidy up:\n\n```\nbc870303 Add dashboard for viewing user profiles\n\nfd3ab401 Allow users to change passwords\n\n50a6a7a6 Fix typo on dashboard (can be squashed into bc870303)\n\n8b1cf775 Refactor password changing function (can be squashed into fd3ab401)\n\nf3344703 Fix flaky test introduced in previous PR (should probably be its own\nPR)\n```\n\nUse an interactive rebase (`git rebase –i [origin/main]`) to open an interactive\nshell where commits can be edited, removed,  or squashed into one another.\nYou'll need to force push your changes if you've already pushed your branch to\nGitHub, as you'll have rewritten history, with `git push --force-with-lease\norigin [BRANCHNAME]`.\n\n### 8. Submit the changeset for code review\n\nAt dxw, we never make changes to code running in production without at least two\npeople, including the author(s), having reviewed and approved them. This to make\nsure we're delivering high quality software and it's an opportunity to learn\nfrom each other.\n\nUsually, we use pull requests on GitHub to facilitate code review. When you're\nready, you should open a pull request and share it with your team for review.\n\nWhen creating a pull request, it's important to give your reviewers the context\nthey'll need to understand the overarching goals of what they're looking at, and\nhow it fits in to everything else. Do this by writing a detailed description and\nusing a meaningful title. Think of this as the same process as writing a good\ncommit message, but zoomed out to a higher level.\n\nA good pull request should:\n\n* link to the ticket, card, or task definition for extra context - but don't\n  rely on external resources still being there in that form in the future\n* describe the problem without assuming the reader has existing context\n* highlight the changes you've made\n* describe and bring attention to particular difficulties or areas that you\n  particularly want the opinion of the reviewer\n* include screenshots where useful to demonstrating the change\n* be clear which acceptance criteria you're meeting and which you aren't if\n  there is follow up work to do\n* describe any follow-up work that needs doing to complete the task\n* be focused on a single problem, preferring to split additional problems into\n  other pull requests - the smaller the pull request, the easier it is to be\n  reviewed and the sooner it can be merged\n* explain if you are breaking a task down into multiple pull requests and what\n  the review order should be\n* describe any consequences of the work\n* update the [changelog](#tracking-changes)\n\nSee the later section on [reviewing code](#reviewing-code) for details on how to\nconduct code review effectively. It can be useful to review your own code in the\nsame way before submitting it for others to look at.\n\nReal examples of pull requests created by developers at dxw:\n\n* [Cristina](https://github.com/UKGovernmentBEIS/beis-report-official-development-assistance/pull/1094)\n* [Dom](https://github.com/dxw/judiciary-middleware/pull/497)\n* [Ed](https://github.com/dxw/judiciary-middleware/pull/631)\n* [George](https://github.com/dxw/mind-side-by-side/pull/307)\n* [James C](https://github.com/UKGovernmentBEIS/beis-report-official-development-assistance/pull/1155)\n* [Laura](https://github.com/UKGovernmentBEIS/beis-report-official-development-assistance/pull/665)\n* [Lawrence](https://github.com/dxw/mind-side-by-side/pull/229)\n* [Leeky](https://github.com/UKGovernmentBEIS/beis-report-official-development-assistance/pull/1130)\n* [Lorna](https://github.com/DFE-Digital/buy-for-your-school/pull/318)\n* [Meyric](https://github.com/UKGovernmentBEIS/beis-report-official-development-assistance/pull/1149)\n* [Nick](https://github.com/DFE-Digital/buy-for-your-school/pull/188)\n* [Robbie](https://github.com/UKGovernmentBEIS/beis-report-official-development-assistance/pull/1087)\n* [Stuart](https://github.com/UKGovernmentBEIS/beis-report-official-development-assistance/pull/1121)\n\n### 9. Respond to reviews\n\nWhen you have an open pull request, it's your responsibility to do what's needed\nto get it merged as quickly as possible. That means being responsive to\nquestions in reviews and making changes as needed.\n\n### 10. Merge the code\n\nYou should only ever merge pull requests that have been approved. If there are\noutstanding comments, make sure to respond to them letting the reviewer(s) know\nwhen they'll be addressed or why they won't if that's the case.\n\nYou should merge your own code when possible. You have the best context about\nwhen you are finished and it's safe to merge in. But don't be precious about it.\nIf someone else needs to merge your code in, they should ask you about it if\nthey can, but shouldn't feel prevented from doing so.\n\nWhen merging code into a long-lived branch, we prefer to use a merge commit,\nrather than merging with a rebase, as having a merge commit as part of the\nproject history makes it clear when a change has actually been merged into the\ncodebase.\n\n### 11. Smoke test the change\n\nOnce the code is merged, make sure it deploys correctly. If possible, verify\nthat it is now present on the target environment and working as expected and\nhasn't broken anything else in the process.\n\n## Reviewing code\n\nWhen reviewing code, you should be thinking about:\n\n* whether the code will do what it's intended to do\n* whether the code is clear and readable\n* whether the code is a stable foundation for future changes\n* whether the change meets the user needs and acceptance criteria of the work\n  being carried out\n* whether the approach taken fits with the current and future plans for the\n  application\n* whether there are any edge cases that have been forgotten or unexpected\n  behaviour possible\n* whether the tests cover enough of the behaviour\n* whether there are security implications (particularly the\n  [OWASP top ten](https://owasp.org/www-project-top-ten/))\n* whether there's important follow up work to do\n* whether the commits are well described, the right size, containing the right\n  things, and in the right order\n* whether the pull request description would make sense to a future reader\n  without the context the author(s) have\n* whether the [changelog](#tracking-changes) has been updated\n\nTry not to worry about whether the approach they took is the one you would have\ntaken. If it works and fits the goals of the project, then it doesn't matter if\ntheir approach matches yours.\n\nYou might want to follow these steps when reviewing a pull request to help you:\n\n1. Review the continuous integration status\n\n   If there are unresolved issues with the test suite or other CI processes,\n   it's usually not a good use of your time to review. In order to fix the\n   issue, the code may change, making your review out of date.\n2. Read the description of the changes in the pull request and any supporting\n   material\n\n   You should make sure you understand the goals of the change and are aware of\n   any details the author(s) thought might be important to pay attention to.\n3. Check the version out locally and run it\n\n   This can be useful to understand complex changes and spot any obvious issues.\n   It's not a substitute for reviewing the test suite to make sure it has good\n   coverage.\n4. Review the full set of changes\n\n   By looking at the full set of changes, you can gain a broad understanding of\n   how the changes interact with each other at the end. This will make it easier\n   to understand each commit, especially when the commit descriptions could be\n   improved, or when things are missing from commits.\n\n   You might want to hold off making comments at this point as you may learn\n   more from walking through the code in more detail.\n5. Review the code, commit by commit\n\n   When reviewing a commit, look for completeness and clarity. Does the commit\n   contain everything it needs to, and does the commit description explain\n   what's changed and why?\n\n   Make comments as you go as part of a review. Even if you think you'll only\n   have one or two it helps signal when you've finished looking if you batch the\n   comments together.\n6. Review the full set of changes (again)\n\n   Now you've walked through each commit you'll be more able to review the full\n   changeset and spot any gaps or issues when looking at it on the whole.\n7. Review your comments\n\n   Going through your pending comments, you might find themes worth drawing\n   attention to or comments that were made defunct by later changes. Go ahead\n   and edit and update your comments as needed.\n8. Submit the review\n\n   Once you're satisfied with your review, submit it with a summary of your\n   comments. Be clear which points require further action and which are there as\n   suggestions or advice.\n\n   Remember to be kind to the author(s) and recognise the effort that went into\n   the work and anything you particularly liked about the change - especially if\n   your review is mostly critical.\n   [Thoughtbot's code review guide](https://github.com/thoughtbot/guides/tree/main/code-review)\n   contains helpful guidelines for keeping the tone positive.\n\n### Review status options\n\nGitHub offers us a number of options when finalising a review. These may be\ninterpreted and used differently depending on style and context, but a good set\nof defaults are:\n\n* Approve\n\n  You are confident that this pull request can safely be merged in. You could\n  also leave optional suggestions which the author(s) might want to consider,\n  but you don't feel block merging.\n* Comment\n\n  You aren't confident in the change, but you don't feel so strongly that\n  someone else's approval couldn't override you. In this case you should explain\n  why the change shouldn't be merged and what your concerns are.\n\n  Alternatively you might not feel confident enough to approve this change but\n  have suggestions on the parts you are confident about that would be worth\n  considering.\n* Request changes\n\n  You believe this pull request shouldn't be merged. It might contain severe\n  issues such as security concerns or bugs which could have a serious impact and\n  you believe must be addressed before the changes are safe to include.\n\n  This option explicitly nullifies any other reviews that chose approval.\n\n## Deploying code\n\nWe try to follow principles of\n[continuous delivery](https://en.wikipedia.org/wiki/Continuous_delivery). That\nmeans we build, test, and deploy as frequently and as automatically as possible.\n\nWe use services such as GitHub Actions to automate as much as possible about\ndeployments. We usually configure them to watch for new commits to important\nbranches, and automatically carry out any build and deployment actions required.\nThis can sometimes take a few minutes, so be patient.\n\n### Production deployments\n\nThe production deployment process varies by project, but we usually require a\nmanual review of changes before they go live. This might be in the form of\nmerging one branch into another, or by using feature flags to disable new\nbehaviour until we're ready to turn it on.\n\nWhen deploying any code to production, make sure everything you're deploying is\nready to go. This means reviewing what's changed since the last deployment and\nverifying that it's all safe, expected, and where there are changes visible to\nusers, signed off.\n\n## Versioning releases\n\nWe don't use explicit versioning for application code, instead following\n[continuous deployment practices](#deploying-code). However, when building\nlibraries, APIs, or other software components designed for reuse, versioning is\nimportant. All reusable components should have properly versioned releases. This\nincludes WordPress plugins and themes, Ruby gems, and so on, whether open source\nor otherwise.\n\nVersioning should follow the [Semantic Versioning](https://semver.org) standard\nand projects that use them should specify their requirements so that the\nappropriate versions are used.\n\n## Tracking changes\n\nIf a project is not continuously released and has staged releases, we want to\ntrack what goes into those releases, so we can be confident about what we're\nshipping, know when we shipped it, and share what we've done with our clients\n(and maybe beyond).\n\nIncluding a `CHANGELOG.md` file in the root of a repository is a standard for\ntracking these changes against versions, but they only work if they're updated.\nYou should record any significant changes as you make them while the issue is\nfresh in your mind. We follow the\n[Keep a Changelog 1.0.0](https://keepachangelog.com/en/1.0.0/) format by\ndefault.\n\nIf your team decides that a changelog is not appropriate for a project, you\nshould document that decision as an\n[Architectural Decision Record (ADR)](https://adr.github.io/), so future\nmaintainers and contributors understand the reasoning for not doing so.\n\nSee\n[Tech Team RFC-019](https://github.com/dxw/tech-team-rfcs/blob/master/rfc-019-use-changelogs-to-track-changes.md)\nfor more context around this decision."},{"id":"how-we-do-pitches","name":"How we do pitches","content":"Pitching is an opportunity to demonstrate our expertise, showcase our work and\ndemonstrate our values. Sometimes, we have plenty of notice and time to prepare,\nother times we have to turn pitches around quickly. To give ourselves the best\npossible chance, we should follow the steps outlined below.\n\n## Preparing in advance\n\nWhen we find out we are pitching, the first thing to do is assemble the pitch\nteam, and make them aware as early as possible of their involvement. The people\npitching should be whoever is lined up to do the work if we’re successful. We\nshould also nominate someone to lead and coordinate producing the pitch.\n\nWhen we receive an invitation to a pitch, send a prompt reply back to thank the\nbuyer for the invitation and give them any information they need (such as names\nof attendees).\n\nThink about the logistics. Look at all the emails or any notes from\nconversations with the buyer and pull out any deadlines and important dates. Put\nthe dates into the pitch members’ calendars and set reminders in Slack so we are\nall clear when the deadline is.\n\nFactor in time to rehearse the pitch, ideally a day before to give us time to\nmake any last minute changes or more time to practice. Whoever is co-ordinating\nthe pitch should make sure this happens. As well as the bid team members, invite\nothers to attend the run-through to act as an audience.\n\nPrepare some good questions for the assessment panel. There is usually an\nopportunity at the end of the pitch to ask some questions to the buyer.\n\n## Writing the deck\n\nLook at the original brief and pull out the evaluation criteria and weightings.\nThese should form the initial headings for the pitch deck and the weightings\nshould give you an idea of how much time to devote to each part of the deck. If\nyou feel you need to, read up on\n[the Digital Outcomes and Specialists scoring process and how weighting works](https://www.gov.uk/guidance/how-to-score-digital-outcomes-and-specialists-suppliers).\n\nLook at previous pitches for inspiration. It’s fine to reuse slides from\nprevious pitches if they are relevant. That said, it’s important that the pitch\nreflects back the buyer’s language so if there are key phrases they use in the\nbrief, it’s good to speak to those.\n\nTry to write positively. If you want to say “there are no contractors on the\nteam”, consider rephrasing as “all our team-members are full-time” to avoid\nsomeone mishearing and getting the opposite message than you intend. So, unless\nyou’re trying to achieve a particular effect, say what we do and just avoid\nsaying what we don’t.\n\nThe slides should always convey the message or most important theme of each\nslide. Avoid making them too wordy—use the speaker notes to explain context and\ndetail. When you’re writing the speaker notes, remember that you’re going to be\npresenting so write in the most appropriate format that helps you deliver the\npitch. For example, avoid long paragraphs, fiddly phrases or difficult\nalliteration.\n\nMake sure you feel ownership of your slides and speaker notes—if they’re not\nwritten in the way you’d say them, either tweak them so they’re in your “voice”,\nor try reducing them to simple prompts.\n\nPut in plenty of line breaks to make the notes easy to read, especially if you\nplan to ad-lib. Add the name(s) of the people who’ll be talking at the top of\nthe speaker notes for each slide. Know when the next slide is yours!\n\nYou can refine the words after you’ve run through the pitch to make sure the\ndeck tells the story you want to tell. The slides need to flow so try and\nestablish a narrative arc, i.e. the slides should make sense in sequence as you\ntell the story.\n\nAllow up to two minutes per slide.\n\n## Designing the deck\n\nThe deck must look the best it possibly can. Use one of the slide deck templates\nas the basis of your slides. Look at the brand book and get help from a designer\nif you need it (use the #helpmedesign Slack channel). Pay attention to details.\nThey matter as the audience’s eyes are always drawn to mistakes and\ninconsistencies. Proof-read the words and proof them again. Spelling mistakes\nand typos do matter, they undermine the credibility of the deck. Share the\nslides with people that aren’t working on them to get a fresh set of eyes on\nthem.\n\nMake sure you use relevant imagery, ideally images or visuals that tell a story\nor are relatable to the point you’re trying to make.\n\nTest the slides in a variety of screen resolutions. You could be giving the\npitch with a state of the art monitor or a decades old projector. Think about\npeople who may be a distance from the screen. There’s often no way of knowing in\nadvance, so prepare for all eventualities (including back up paper copies!)\n\n## Rehearsals and run-throughs\n\nWe always allow time for practice. You’ll find that until you read through the\nslides, you have no idea how the pitch is going to sound. It’s also important to\ntest out the words you’re saying so you can avoid any difficult phrasing and\nmake sure the pitch flows.\n\nArrange to have a group to practice in front of, who can comment and give\nfeedback. If you’re not used to presenting, it’s good to practice in front of\nlarge groups so you can try out the techniques you plan to use for giving the\ntalk. Practice making eye contact with people, and reading the notes with a\nhuman voice so you don’t sound like you’re reading verbatim. Make sure you are\naware of your pace - you need to speak clearly and slowly. Try not to rush, and\ntake regular pauses between sentences or points.\n\nPractice the hand-overs between different presenters so these are natural and\ndon’t disrupt the flow. Decide in advance who is doing the introductions for\neach section so we look like a unified team.\n\nFeedback from the wider team is a really important part of finalising the pitch,\nso embrace suggestions. For those providing feedback, remember to be\nconstructive.\n\nThink about answers to any questions you may be asked that relate to your\nslides. If you foresee questions that you may have trouble answering, check with\nthe others on the pitch team.\n\n## On the day\n\nBefore you leave home, remember to check if you need photo ID—some government\ndepartments will require it.\n\nWhen it comes to appearance, smart casual is a good idea. No need for suits, but\ndefinitely don’t turn up in shorts and flip-flops. Overly casual dress has been\nknown to be noticed!\n\nAlthough many of our clients have guest wifi, don’t assume it will be reliable.\nTake along the dxw mifi/dongle or a smartphone that you can tether from as\nbackup. Make offline copies of pitch slides, either as PDFs, Keynote or whatever\nyou’re comfortable presenting from. It’s a good idea to print out the speaker\nnotes too, so we’re as well prepared as we can be. Leave plenty of time to\norganise print-outs so you’re not rushing them at the last minute.\n\nMake sure you have an HDMI cable plus all standard monitor adapters so we can\npresent from our own machines. Decide whose laptop you’ll be presenting from,\nand make sure it has plenty of battery.\n\nAim to arrive at least 30 minutes early. You can always take a stroll or have a\ncoffee before the pitch rather than turning up flustered and on the back foot.\nWe need to appear credible and confident so this will remove one source of\nstress on the day.\n\n## Doing the pitch\n\nHelp each other out during the set-up, make sure the slides display correctly,\nadjust the resolution and do whatever you need to do in advance.\n\nSpeak slowly and deliberately, don’t rush. Try and make eye contact with the\npanel. When you answer questions, politely check that the questioner is happy\nwith the answer you’ve given.\n\nIt’s preferable to say that we’d prefer to not answer a tricky on-the-spot\nquestion– and explain why – rather than try and bluff an answer.\n\nMost of all, relax, smile and be calm—remember that with all the preparation\nthat’s gone in, you’re master of the brief and as long as you speak slowly, in\nmeasured terms, this will come across.\n\n## If we don’t win\n\nObviously, we want to win every pitch, but there will be many times when the\nbest pitch doesn’t win the work. It’s important to realise that no-one has, or\ncan have, a 100% win rate. And it’s okay to be disappointed when things don’t go\nour way, especially after putting in so much work.\n\nIt’s important to review our performance afterwards, and be honest: was there\nanything in our control that we could have done differently that would have\ngiven us a better chance of winning? Get feedback from the client, in writing if\npossible and schedule a quick meeting with everyone involved with the client and\nthe pitch to review it."},{"id":"how-we-do-user-research","name":"How we do user research","content":"## Introduction\n\nThis guide explains how we do user research at dxw.\n\nThe guidance applies to all user researchers employed by dxw, both staff and\ncontractors.\n\nThe guidance builds on our user research\n[principles](/#user-research-principles). It also builds on the\n[guidance for user research in the GDS Service Manual](https://www.gov.uk/service-manual/user-research)\nso we can help teams meet the Government\n[Service Standard](https://www.gov.uk/service-manual/service-standard).\n\nSome of the guidance explains how to do user research in an effective, ethical\nand legal way. If your situation isn't covered, and you're not sure what to do,\nask Coca Rivas, Director of Design, or John Waterworth, Principal Researcher.\n\n## User research workflow\n\nThese are the things that user researchers usually do on projects.\n\n1. **Support sales and scheduling**\n\n   Researchers contribute to client proposals and scheduling projects. We advise\n   on research activities to include in proposals, join in pitch presentations\n   and help with scheduling decisions.\n\n   This helps dxw to win good work that delivers valuable results for our\n   clients, for users and for ourselves.\n2. **Help setup the project and team**\n\n   Researchers get involved with project inception and planning. We review\n   existing evidence. And we create research plans that show what we’ll do, why\n   and how we’ll do it. We make sure the plan is achievable and allows us to do\n   research at a sustainable pace.\n\n   This helps teams to focus on understanding and meeting the needs of users,\n   and to produce the best results with the people, time and resources we have.\n\n   [How we create and use research plans](#how-we-create-and-use-research-plans)\n3. **Recruit people for research**\n\n   Researchers recruit appropriate participants for research activities. Finding\n   the right participants at the right time is always challenging, so we start\n   recruiting as soon as we can and use a variety of approaches to reach\n   everyone we need. We keep track of who participates in our research, so we\n   can be confident that we’re including the right people.\n\n   This helps teams to learn about all their users and produce services that\n   work well for everyone.\n\n   [How we get informed consent for user research](#how-we-get-informed-consent-for-user-research)\n\n   [When and how we give incentives to research participants](#when-and-how-we-give-incentives-to-research-participants)\n\n   [How we protect participant privacy](#how-we-protect-participant-privacy)\n4. **Plan and do research activities**\n\n   This is the most obvious and visible part of our work. We choose research\n   activities that provide strong evidence and reliable answers, for the least\n   time, effort and cost. And we choose activities that help our teams and\n   different kinds of users to participate.\n\n   We record what we do and how we do it, for each other, and for those who come\n   after us.\n\n   This helps teams to embed regular research into their agile practices and get\n   the best results from the effort they put in.\n\n   [How we create and use research plans](#how-we-create-and-use-research-plans)\n\n   [How we write and use discussion guides](#how-we-write-and-use-discussion-guides)\n\n   [How we take notes and record research sessions](#how-we-take-notes-and-record-research-sessions)\n5. **Analyse research and produce findings**\n\n   Researchers carefully analyse the different kinds of data we collect. We\n   analyse data in batches and record our findings from sprint to sprint. And we\n   involve our colleagues and clients in analysis to make sure our findings are\n   clear and relevant.\n\n   This helps teams understand, believe in and act quickly on what they learn.\n6. **Help teams make good decisions**\n\n   Researchers produce findings and other recommendations that help teams make\n   good decisions about what to do next and how to approach it. We get actively\n   involved in identifying opportunities, creating design ideas and setting\n   priorities.\n\n   This helps teams to create great services that work well for users, and to\n   strike a balance between short-term wins and more complex, long term changes.\n7. **Create and share outputs**\n\n   Researchers create and share formal outputs like plans, presentations,\n   reports and diagrams. These record and communicate the important things we\n   learn. We create finished outputs from sprint to sprint, not just at the end\n   of a project. And we think carefully about how we present and share these\n   outputs to produce the most impact.\n\n   This helps our clients and other stakeholders use and benefit from what we\n   learned both during the project and long after we’ve gone.\n\n   [How we share research activities and findings](#how-we-share-research-activities-and-findings)\n8. **Take care of research data**\n\n   Researchers know it’s important to manage research data carefully. We follow\n   our [privacy policy](https://www.dxw.com/privacy-statement/) and\n   [ISO27001 certification](https://www.itgovernance.co.uk/iso27001) when\n   collecting, processing and storing research data to make sure we comply with\n   that\n   [General Data Protection Regulation](https://www.gov.uk/government/publications/guide-to-the-general-data-protection-regulation).\n\n   This helps teams to get the most from the research data they collect, while\n   protecting the privacy of the people taking part.\n\n   [How we take notes and record research sessions](#how-we-take-notes-and-record-research-sessions)\n\n   [How we take care of research data](#how-we-take-care-of-research-data)\n\n## How we name and identify documents\n\nIt’s important that team members and stakeholders know they have the right\nresearch plan, discussion guide or other research document.\n\nSo we give our documents consistent file names like:\n\n* YYYY MM DD - TYPE - CLIENT - PROJECT - RESEARCH ACTIVITY (if needed for\n  clarity)\n\nFor example:\n\n* 2019 10 01 - Research plan - Southwark - Affordable homes monitoring alpha\n\nAnd a consistent front cover with:\n\n* Client and dxw logos\n* Client and project names\n* Document type\n* Date\n* Main contact (who wrote it)\n\nFor example:\n\n* Southwark Council\n* Affordable homes monitoring alpha\n* User research plan\n* (Draft)\n* 1 October 2019\n* John Waterworth\n\n## How we create and use research plans\n\n### Planning research activities\n\nIt’s important that we carefully plan the research we do.\n\nTeams create the best services when research activities provide reliable answers\nto their most important questions. And we do our best research when we do it in\nethical, inclusive and sustainable ways.\n\nWe want to involve our colleagues and other stakeholders in creating research\nplans, so they understand and can contribute to research activities.\n\nAnd we want to create plans that allow us to\n[learn, share and adapt](https://playbook.dxw.com/#user-research-principles) as\nwe go.\n\nThe guide to\n[planning user research for your service](https://www.gov.uk/service-manual/user-research/plan-user-research-for-your-service)\nin the Service Manual sets out a good approach to creating a plan.\n\n### Research plan template\n\nCreating and sharing a short research plan document is a great way to get\neveryone aligned. And to address any concerns that clients and stakeholders may\nhave.\n\nWe have a\n[research plan template](https://docs.google.com/document/d/11olKOHluGXL8OA-XKIvSXXsCxQ3dvOUgSUgJSw0qLm4/)\nthat you can use as a starting point. But feel free to adapt it and add sections\nthat may be important for your project.\n\n## How we do research safely during coronavirus\n\nWe have a responsibility to keep ourselves and our participants safe and comply\nwith government guidance during the coronavirus (COVID-19) outbreak. In\nparticular, we should carefully consider whether and how to do any face to face\nresearch.\n\nFor now, you will need the approval of a Director, Head or Principal Researcher\nto do face to face research. And you must document your decision and your\nassessment of the risks in your\n[research plan](#how-we-create-and-use-research-plans).\n\nThe Service Manual has a guide to\n[choosing face to face or remote research](https://www.gov.uk/service-manual/user-research/doing-user-research-during-coronavirus-covid-19-choosing-face-to-face-or-remote-research),\nand what to include when you document your decision and your assessment of the\nrisks.\n\n## How we write and use discussion guides\n\nWe create discussion guides to help us plan and do research activities, like\ninterviews, visits, workshops and usability tests.\n\nThey help us to:\n\n* identify the purpose of the research activity and what we want to get from it\n* review planned activities with team members and stakeholders so we stay\n  aligned with project goals\n* stay on track during research sessions\n* make sure different researchers cover the same topics so participants have a\n  consistent experience\n* keep a record of what we did in each research activity\n\n### The parts of a discussion guide\n\n#### Introduction\n\nRecap the goals of the project and the research activity, describe the methods\nyou’ll be using, and set out the overall structure of the research session.\n\n#### Preparation\n\nDescribe anything the researcher needs to have or do, to prepare for the\nsession. Reference things like the information sheet to send to participants,\ndescribe how to set up the prototype you’ll be testing, and reference the\n[notes template](https://drive.google.com/drive/folders/1MAUax08jwwqNd1BWfH-gixSbltY2qE-m)\nyou want to use.\n\n#### Welcome\n\nSet out the things you'll say to the participant to let them them know what’s\ngoing on and make sure they feel comfortable. It can be helpful to write this\nout word for word, so you have something to fall back on when you’re tired, or\nget interrupted or distracted.\n\nIn your welcome you should:\n\n* **Say thank you** - Start off by letting the participant know you appreciate\n  them offering their time (incentivised or not)\n* **Introduce yourself** - Let them know your name, role, company and who you\n  are working for\n* **State your relationship to the client** - We are **independent\n  researchers**, working on behalf of a client\n* **Summarise the research purpose** - Explain what you’re trying to find out,\n  eg We’re interested in how you recruit teachers for your school\n* **Remind them it is voluntary** - They can choose to stop at any time\n* **Reassure tham that there are no right or wrong answers** - We’re interested\n  in how the participant thinks and what influences that\n* **Ask them to be honest** - As researchers we won’t be offended by any\n  comments, we just want to find out what people really think about a service\n  and how it might be improved\n* **Describe how the session will go** - Let the participant know who is taking\n  notes or observing, how you are recording the session, how long the session\n  will take, and what you’ll be doing in that time, so the participant knows\n  what to expect\n* **Check consent and non-disclosure** - Has this been done? Do they have any\n  questions?\n\n#### Topics, tasks and activities\n\nHave a section in your guide for each of the main interview topics, test tasks\nor workshop activities.\n\nFor each one write out:\n\n* What you are trying to learn\n* For an interview topic, the starter questions you’ll ask along with likely\n  follow ups\n* For a test task or workshop activity\n\n  * the steps to do\n  * explanations and instructions for participants, such asking them to think\n    out loud during a test so you can understand what’s happening\n* How long the topic, task or activity is likely to take\n* The priority - is this essential, or could you leave it out if you’re short of\n  time\n\n#### Wrap up\n\nDescribe how the researcher should conclude the session with the participant.\nThis can include asking the participant for their final thoughts, asking them\nhow the session went for them, letting them know what will happen next, and\nthanking them for their time.\n\nAlso include any steps for the researcher, like collecting and storing\nrecordings, or deleting data from prototypes.\n\n### Three discussion guide templates\n\nWe have template discussion guides for three different kinds of research\nactivities:\n\n* [Interviews and contextual research](https://drive.google.com/open?id=1XeBhmQL0jqFFsl2Cw-DOKVpabTRILGl-TjeyUDW90vM)\n* [Usability tests](https://drive.google.com/open?id=1hcVkLGJVDB9ZOoMIz93erUpk1RUgXN_ZcZflJxsFpHw)\n* [Workshops](https://drive.google.com/open?id=1ZHZwLBnUlDsxrvv1qj_ZpFU9QGsP_dIDLMVcGbEYswY)\n\n## How we share research activities and findings\n\nWe regularly share descriptions of research activities and findings in show and\ntells, reports and other places.\n\n### Slide layouts for research\n\nWhen presenting about research, we use one of the dxw Proposal Deck Templates.\nThese have all the kinds of slide layouts you will need.\n\nYou can find these in the Google Slides\n[Template Gallery](https://docs.google.com/presentation/u/0/?folder=0AGsaGhY-i-mIUk9PVA&ftv=1).\n\n### Presenting research activities\n\nWhen sharing what we plan to do or what we’ve been doing, we talk about research\nactivities rather than research methods.\n\nDescriptions of research activities look like:\n\nWe did *some kind of research* with *some kinds of participants* to learn\n*something the team needs to know*.\n\nWe avoid using research jargon that our colleagues might not understand. For\nexample, rather than talking about ‘ethnography’ or ‘contextual enquiry’ we\nmight say that “we visited the support desk and observed the team helping people\nwith their applications”.\n\n### Presenting research findings\n\nWhen sharing findings, we always make the finding the headline. Then follow up\nwith supporting evidence, explanation and illustration.\n\nYou can read more about this in the\n[Sharing user research findings guide](https://www.gov.uk/service-manual/user-research/sharing-user-research-findings#presenting-your-findings)\nin the Service Manual.\n\n## How we get informed consent for user research\n\nYou must have informed consent from participants before you start any research\nactivity with them. And you must then act only within the consent the\nparticipant has given.\n\nThis guidance explains how we collect and keep evidence of informed consent at\ndxw. It builds on the general guidance on\n[getting informed consent](https://www.gov.uk/service-manual/user-research/getting-users-consent-for-research)\nin the Service Manual.\n\n### Creating consent materials\n\n#### Using dxw or client consent materials\n\nThere are two basic options:\n\n1. The simplest and best option is to use our client’s existing consent\n   materials. If they don’t have any, we can work with the client to create\n   consent materials for the project, that the client can then reuse in future.\n\n   In this case the client will manage all the research data we collect and keep\n   the associated records of consent.\n2. If using the client’s consent materials is not possible, or if the client\n   asks us to do confidential research, we can use the dxw\n   [information sheet](https://drive.google.com/open?id=19lm5_gzzqzVP0NnNZZiqPhEwW2_i2bkI5apAaie4-4M)\n   and\n   [consent form](https://drive.google.com/open?id=1ilYXwrrkl9s4jMRkJm3uCWAON6bnEeYinKvPd-VOz8k)\n   templates.\n\n   In this case dxw will manage the research data and keep the associated\n   records of consent.\n\nWhich ever approach you take, make sure your consent materials and process\nfollow the\n[good practice for informed consent](https://www.gov.uk/service-manual/user-research/getting-users-consent-for-research#what-informed-consent-is)\ndescribed in the Service Manual.\n\n#### Creating an information sheet\n\nFor each round or batch of research you do, you should create a specific\ninformation sheet that describes the research you are doing, and gives the\nparticipant the information they need.\n\nYou can use the same information sheet for several rounds or batches of\nresearch, as long as you are:\n\n* doing the research for the same purpose\n* doing the same things during the sessions\n* collecting the same research data\n* working with the same third-party organisations and suppliers\n\nWe have\n[template information sheets](https://drive.google.com/open?id=19lm5_gzzqzVP0NnNZZiqPhEwW2_i2bkI5apAaie4-4M)\nto use for the most common research situations.\n\n#### Creating a consent form\n\nIf you are using a client’s consent form, make sure it clearly describes dxw’s\ninvolvement in the research, and how we will share research data and findings.\n\nWe have\n[template consent forms](https://drive.google.com/open?id=1ilYXwrrkl9s4jMRkJm3uCWAON6bnEeYinKvPd-VOz8k)\nfor the most common research situations.\n\nIf none of the standard consent forms will work for the research activities you\nare doing, speak to the Head of User Research.\n\n### Sharing your consent materials and process\n\nSome clients and stakeholders will not understand the ethical and legal reasons\nfor getting informed consent, and will not be familiar with good consent\npractice.\n\nTo avoid problems later, share your consent materials and process as soon as you\ncan with the client and with any organisations whose staff or members you are\nresearching with.\n\n### Collecting consent\n\n#### Providing the information sheet\n\nGive each participant a copy of the information sheet when they are being\nrecruited for a research session. Check which format and channel works best for\nthem - email attachment, paper letter, easy read, etc.\n\nFor a face to face research session, make sure you can provide a paper copy of\nboth the information sheet and the associated privacy statement/privacy policy,\nif a participant asks for one.\n\n#### Face to face research sessions\n\nFor user research sessions where you meet the participant in person, you can:\n\n* give the participant a printed copy of the consent form\n* send the consent form in an accessible digital format the participant can read\n  using their assistive technology\n* read the consent form aloud\n\nCheck with the participant which format works best for them.\n\nGive the participant the consent form as soon as you can. Make sure they have\ntime to read it carefully, and an opportunity to ask questions, before you ask\nthe participant to sign .\n\n#### Remote or telephone research sessions\n\nFor user research sessions where you will not meet the participant face to face,\nyou can:\n\n* attach the consent form to an email in an accessible digital format\n* send a paper consent form in the post\n\nAsk the participant to send a reply, confirming their consent. They can reply to\nthe email, or post back a signed paper consent form.\n\n#### During the session\n\nAt the start of the session, remind the participant that their participation is\nvoluntary and they can stop or take a break at any time. Remind the participant\nabout the different ways you are recording the session, and about anyone\nobserving or listening in. Ask the participant to confirm their consent for the\nrecording.\n\nAs the session continues, actively make sure you have the participant’s consent.\nFor example, check in with the participant if they look concerned about an\nactivity, or if you’re on a visit and want to take a photo in a new area.\n\n### Keeping a record of consent\n\nFor paper consent forms, scan or photograph the signed consent form and keep the\nimage file in the folder with the research data you collect in the session.\n\nFor email responses, keep a copy of the consent form and of the participant’s\nreply in the folder with the research data you collect in the session.\n\nMake sure the consent form, email reply and any research data have the same\nparticipant identifier. Do not include participant names or other personal\nidentifiers in the document names.\n\n## When and how we give incentives to research participants\n\nIt‘s normal to pay members of the public an incentive when they take part in\nresearch activities with us.\n\nThis guidance explains how we agree incentives with clients and pay incentives\nto participants.\n\nIt builds on the\n[basic guidance on giving incentives](https://www.gov.uk/service-manual/user-research/find-user-research-participants#giving-incentives)\nin the Service Manual.\n\n### Who gets incentives\n\nWe will normally pay incentives to members of the public, including people who\nuse a government service for their work. Professionals and members of groups may\nnot be comfortable with getting an incentive themselves, and may want the\nincentive given to their organisation or donated to charity.\n\nWe do not expect to pay incentives to our clients‘ staff or to other public\nservants who take part in research related to their work.\n\nWhen we are paying an incentive, make sure the participant knows the amount of\nthe incentive and how they will receive it. Include this in the \\[information\nsheet](link to consent guidance).\n\n### Agreeing incentives\n\nIt’s best to include estimates of incentives and other research expenses in the\nstatement of work.\n\nYou can then confirm the exact incentive with the client when you are planning a\nbatch of research.\n\nOn previous project we have paid:\n\n* £30 of Love2Shop vouchers for 1.5 hours of in-person usability testing\n* £50 cash for geographically-specific users to take part in 1 hour of remote\n  mobile usability testing\n* £100 cash for an hour-long discovery research session with people likely to\n  need assisted digital support\n* £100 cash for 45 minute research session with small businesses\n\n### Confirming incentives at the start of the research session\n\nHandle the incentive at the start of the research session - either giving the\nincentive, or confirming that the incentive will be sent. This avoids any\nsuggestion that participants have to ‘earn’ their incentive. It also means you\ndon’t have to deal with the incentive if you want to stop a problematic session.\n\n### Paying incentives through a recruitment agency\n\nIf you are using a recruitment agency, ask them to pay the incentive to the\nparticipant. They will know how they do this. They may charge a small fee for\nhandling the incentive.\n\nIf a participant contacts dxw to say they haven’t received their incentive,\napologise and contact the agency to let them know.\n\n### Paying incentives using shopping vouchers\n\nWhere we are paying the incentive, we use shopping vouchers. Normally from\n[Love2shop](https://www.highstreetvouchers.com/gifts/love2shop-gift-vouchers).\n\nRequest the amount of vouchers you need through the\n[\\#help-purchasing](https://dxw.slack.com/archives/C8ZGR2Y8Z) Slack channel and\n[purchasing form](https://docs.google.com/forms/d/e/1FAIpQLSdz8-Z-fcootRS6UyceXbxdSdbO4-2jIyRrHHiI-3VH4LyRrw/viewform).\nThey should be in £5 and £10 denominations so they are easier to spend.\n\nIn a face-to-face research session, give the vouchers to the participant and\nhave them\n[sign a receipt](https://drive.google.com/open?id=1-O9Qvp4kgs4t0JfQTIQF9dkiexv5mZtPNJfcxtmODZ0).\n\nFor a remote research session, ask for the vouchers to be posted or emailed to\nthe participant. When posting vouchers, enclose the vouchers with a signed\n[thank you sheet](https://drive.google.com/open?id=142Sf1QYH9wcySPf6GIOskv5qyJlc9phGZSeoCsxCoeU).\n\n### Other ways to pay incentives\n\nOther options for paying incentives might be a donation to a preferred charity,\nor a hamper that can be shared with a team.\n\n### Withholding incentives\n\nWe do not pay the incentive (or any recruitment fee) if the participant doesn’t\nshow up for their session. Although we might still pay the incentive if the\nparticipant tries to attend, but is stopped by an emergency or severe travel\nproblem beyond their control.\n\nIf a recruitment agency provides a participant who does not match the brief, we\nwill pay the participant their incentive, but we will not pay the agency their\nrecruitment fee.\n\n## How we take notes and record research sessions\n\nTo capture what happens in our research sessions we take notes and photos, make\naudio, video and screen recordings, and take copies of paperwork and other\nmaterial that participants use or refer to.\n\nWe use these notes, photos and recordings during analysis to make sure we\nproduce valid findings. And we use extracted quotes, images and clips to\nillustrate the findings we share.\n\nThere is good guidance on\n[Taking notes and recording user research sessions](https://www.gov.uk/service-manual/user-research/taking-notes-and-recording-user-research-sessions)\nin the Service Manual, and on\n[Capturing User Research](https://www.uxmatters.com/mt/archives/2012/04/capturing-user-research.php)\nin UX Matters.\n\nHere we provide additional, specific guidance for researchers at dxw.\n\n### Good practices to follow\n\n1. **Capture only what you need and have consent for**\n\n   Good user research practice, and good privacy practice, is to capture only\n   the data you believe you need. For example, don’t make a screen or video\n   recording, ‘just in case’, if you’ll only ever need a transcript of what the\n   participant says.\n\n   Make sure that anything you capture during a session is covered by the\n   consent you’ve collected. If a participant changes their mind about what they\n   consent to, be prepared to not make, or to delete recordings you no longer\n   have consent for.\n2. **Do not use your personal devices**\n\n   Always use a dxw provided device, rather than your personal device, when\n   taking notes and photos, or making recordings.\n\n   Using our own devices in research means that personal data about research\n   participants can be mixed into our personal data stores, like cloud photo\n   libraries. And also runs the risk of participants, client staff and\n   colleagues seeing our personal messages and images.\n3. **Keep your notes and recordings secure**\n\n   As soon as possible after the session, transfer any notes and recordings from\n   paper and other devices to your dxw provided laptop. And from your laptop to\n   the dxw Google Drive or to the client’s research store.\n\n   Keep only anonymised notes, quotes and images in tools like Miro and Trello.\n4. **Have a fall back**\n\n   The one certainty in user research is that things go wrong. So make sure you\n   have other options to capture what you need.\n\n   For example:\n\n   * The participant may decide they don’t want to be recorded in a particular\n     way, so be prepared to switch from video to an audio-only recording, or to\n     just take notes\n   * Your preferred device, app or service may not be working properly, so have\n     an alternative like a paper notebook\n   * Your note taker, assistant or observer may not be able to join the session,\n     so be prepared to take notes and recordings yourself\n\n   Note that if the participant refuses all recording, including note taking,\n   you may want to abandon the session.\n\n### Using your dxw provided laptop\n\nWhenever possible, use your dxw provided laptop for taking notes and making\nrecordings. Our laptops have encrypted drives and we follow good security\npolicies.\n\nWith your laptop you can:\n\n* capture notes to a local file or a Google Sheet\n* record audio using a microphone and the Voice Memos or Quicktime apps\n* record video using an external camera and Quicktime\n* record your laptop screen using Quicktime or Screenshot\n\nIf research participants might use your laptop or see your screen during a\nresearch session, it’s a good idea to create a separate ‘research’ user account\non your laptop with things like notifications and browser autofill turned off.\n\n### Using a dxw provided handheld device\n\nUse a dxw provided handheld device, rather than own phone or tablet, to take\nphotos and short videos during interviews, visits and workshops.\n\nRemember to delete the photos and recordings from the device once you have\ntransfered them to your laptop or to Google Drive.\n\n### Using the notes template\n\nWe have a\n[template for a Google Sheet](https://drive.google.com/open?id=1r6xtVgHBFTDxbFGSqk3wXFDy_5JDwkBpGBHibnLKuwM)\nyou can use to take notes during a research session.\n\nYou can make a copy of the sheet for each research session, or make a copy for\neach batch of research and create tabs within the sheet for each research\nsession.\n\n### Using sticky notes and paper worksheets\n\nWe often use sticky notes and paper worksheets to capture information during\nresearch sessions, for example when\n[researching users’ experiences](https://www.gov.uk/service-manual/user-research/researching-user-experiences).\n\nDesign paper worksheets, and give people advice on\n[writing sticky notes](https://www.gov.uk/service-manual/user-research/taking-notes-and-recording-user-research-sessions#using-sticky-notes),\nso you can easily use the information recorded.\n\nAvoid capturing personally identifiable information about participants on sticky\nnotes or paper. If you capture any sensitive informaton on sticky notes or\npaper, make sure to use a shredder to dispose of it.\n\nUse a dxw provided phone or tablet, rather than your personal device, to capture\nthe contents of sticky notes and paper worksheets.\n\n### Using a video conferencing service\n\nOur preferred service for recording remote screen sharing sessions is\n[GoToMeeting](https://docs.google.com/document/d/1KiaXHr-VCX8T6K9YWPnmHHiAChJda_gH4av03N4pDrg/).\nSetup GoToMeeting so that the recorded video is saved onto your dxw provided\nlaptop. And then transfer the video to Google Drive as soon as possible.\n\nDepending on the client, we may need to use their preferred video conferencing\nservice. If the service stores recordings ‘in the cloud’, make sure to download\nthe video as soon as possible and delete it from the service.\n\n### Using third-party facilities\n\nIf you are using a third party facility like a usability lab, transfer any\nrecordings made by the lab to your dxw provided laptop as soon as possible after\nthe sessions are complete.\n\n## How we protect participant privacy\n\nWhen we do research, we must carefully manage participants’ contact details and\nother personal data to protect their privacy and comply with the law.\n\nThis guidance explains how we collect and use information about research\nparticipants at dxw. It builds on the general guidance on\n[managing participant privacy](https://www.gov.uk/service-manual/user-research/managing-user-research-data-participant-privacy)\nin the Service Manual.\n\n### Collecting only the participant details we need\n\nWe collect as little information about participants as possible. And only the\ninformation we really need to manage their participation. For example,\ncollecting just the participant’s name and email address to arrange a video\ncall.\n\nWhen we use a screening questionnaire, we ask only the questions we need to\nselect participants. For example, we don’t ask for a date of birth if we only\nneed an age range.\n\nWe avoid keeping participants’ personal details as a record of who we spoke to,\nor to manage subject access or deletion requests. We may keep counts of numbers\nand types of participants, but these should not include any personal details.\n\n### Storing participant details securely\n\nWe usually store participants’ details in the Google Drive folders for the\nrelevant project, for example in a spreadsheet in a Research subfolder. We limit\naccess to just the colleagues who need to use them to help people participate.\n\nThe Google Drive Help Center has a useful guide on ways to\n[stop, limit, or change sharing of files and folders](https://support.google.com/drive/answer/2494893).\n\nWhen using an online questionnaire tool to recruit and screen participants,\ntransfer the responses from the tool to Google Drive as soon as possible, and\nsecurely delete the original responses from the tool.\n\nWhen sending calendar invites to participants, we restrict access to the guest\nlist so that only colleagues involved in the research will see participants'\ncontact details.\n\nWe avoid sharing email conversations that include participants’ contact and\nother personal details.\n\nAnd we avoid sharing participants’ details in any other tool, such as Slack or\nTrello.\n\n### Deleting participant details when no longer needed\n\nWe delete participants’ details from Google Drive, Gmail and Calendar as soon as\nwe no longer need the details to manage their participation in research.\n\nLabelling emails exchanged with participants is a good way to find and delete\nthem. For example, in Google Gmail you might create ‘Participant’ and ‘RODA’\nlabels and search for them using ‘label:(participant RODA)’.\n\nIdentifying calendar events that might contain participants’ details is not so\neasy. In Google Calendar you can create a personal Research calendar and add all\nresearch activities involving participants to that calendar. Or you might adopt\na naming convention such as ‘Research:’.\n\n### Doing fully confidential research\n\nWe sometimes do research where the participants are known only to the\nresearchers. Other members of the team will not know who participated in the\nresearch.\n\nWhen doing fully confidential research:\n\n* we strictly limit access to participant details\n* use private meeting invites\n* share only fully anonymised findings\n\n## How we take care of research data\n\nWhen we do research, we must manage the data we collect so that we protect\nparticipants’ privacy and comply with the law.\n\nThis guidance explains how we manage research data at dxw. It builds on the\ngeneral guidance on\n[managing research data](https://www.gov.uk/service-manual/user-research/managing-user-research-data-participant-privacy)\nin the Service Manual. These is also useful advice in\n[The User Researcher’s Guide to GDPR](https://www.userinterviews.com/blog/the-user-researchers-guide-to-gdpr).\n\n### Agreeing who controls the research data\n\nThere are two basic options:\n\n1. The client is the data controller for the research data, and we are a\n   processor.\n\n   This is the best approach when we are working in a blended team for a client\n   with an established user research practice. It allows the client and team to\n   continue accessing and using the research data independent of dxw.\n\n   In this case we use the client's consent materials and store the research\n   data in their systems.\n2. We are the data controller for the research data, and we limit the client’s\n   access to the research data.\n\n   This is the best approach when we are working in a dxw staffed team for a\n   client with a limited or no user research practice. It reduces the burden on\n   the client and reduces our dependence on their practices.\n\n   In this case we use dxw consent materials and store the research data in our\n   systems along with the records of consent.\n\nWe will agree on the approach for the project as early as possible. Ideally as\npart of the statement of work, but at the latest during inception.\n\n### Storing research data securely\n\nWe store research data that we control in the Client work area of the dxw Google\nDrive.\n\nWe limit access to folders and files containing research data to colleagues who\nneed to access and use the data to complete their work.\n\nThe Google Drive Help Center has a useful guide on ways to\n[stop, limit, or change sharing of files and folders](https://support.google.com/drive/answer/2494893).\n\nWhen we capture research data on a device or in another online service, we move\nthe data to Google Drive as soon as possible, and securely delete the research\ndata from the device or service.\n\nIf moving research data to Google Drive is not immediately possible, we move the\ndata to our dxw provided laptop. For example, if we collect videos during pop-up\nresearch at a location with no reliable Internet connection.\n\n### Keeping records of consent\n\nWe store records of consent along with the research data they relate to.\n\nThe consent record might be a scan of a paper consent form, a saved copy of an\nemail, or some other suitable record.\n\nWe delete the consent record when we have deleted that participant’s research\ndata and contact details.\n\n### Identifying research data clearly\n\nTo identify research data in Google Drive, we follow our\n[general file naming convention](#how-we-name-and-identify-documents).\n\n* We keep research data in subfolders identified by the date of the research,\n  the project and the research activity. For example:\n\n  2021 04 - Research - BEIS ODA - Observing the ODA QA process\n* We name individual files with the date collected, the project and the research\n  activity. For example:\n\n  2021 04 - Notes - BEIS ODA - Observing the ODA QA process\n* If needed, we add participant numbers to identify the different data files\n  within a research activity. For example:\n\n  2021 04 08 - P2 - Recording - BEIS ODA - Observing the ODA QA process\n* We use matching file names to keep records of consent. For example:\n\n  2021 04 08 - P2 - Consent - BEIS ODA - Observing the ODA QA process\n\nBe careful not to use a participant’s personal details, such as their name or\norganisation, to identify the data we collect during research activities.\n\n### Sharing anonymised extracts\n\nWe often use extracts from research data to illustrate findings and other\nproject outputs. These extracts might be quotes, photos, video clips,\nscreenshots, or copies of artefacts like documents.\n\nIn any material that may go outside of the immediate team, we use only fully\nanonymised extracts, where the participant cannot be identified.\n\nThe UK Data Service has useful guidance on\n[anonymising both quantitative and qualitative research data](https://www.ukdataservice.ac.uk/manage-data/legal-ethical/anonymisation).\n\nWe sometimes do show identifiable extracts within a team, and where we have\nconsent. For example, showing clips from a usability testing session during a\nclosed playback with the team.\n\n### Deleting research data when no longer needed\n\nWe delete research data from Google Drive as soon as we no longer need it for\nour work. Or at the latest by the end of the declared retention period, usually\n1 year.\n\nResearch data files may be owned by different members of staff. To delete files\nowned by colleagues, including those who have left dxw, contact the technical\noperations team at #help-internal-tech-support.\n\n### Processing access requests and withdrawal of consent\n\nParticipants can withdraw their consent or ask us to share any personal data we\nhave about them.\n\nIf a participant withdraws their consent, or if it is not clear that we have a\nparticipant’s consent, then we must find and delete any personal data we have,\nincluding notes, recordings, emails, calendar events, records in spreadsheets,\netc.\n\nIf a participant asks to see the personal data we have about them, then we must\nfind and share any personal data we have, including notes, recordings, emails,\ncalendar events, records in spreadsheets, etc.\n\nTo identify the participant’s data, we may need to ask them for details of the\nresearch activities they were involved in.\n\nAnd we may need to separate data about one participant from data about other\nparticipants. For example, if we have notes or voice recordings from a group\nworkshop."},{"id":"inclusion-diversity-equality","name":"Inclusion, diversity and equal opportunities policy","content":"## Equal opportunities statement\n\nAt dxw, we value people and believe that having a team of individuals with\ndifferent backgrounds, views and experience makes us a better company. dxw is\ncommitted to retaining and recruiting people who are passionate about ‘doing\npublic good’. We build, design and create for a diverse range of people and aim\nfor our staff to reflect that diversity.\n\nStaff and candidates will receive equal treatment regardless of age, disability,\ngender, sex, physical appearance, sexual orientation, marital or civil partner\nstatus, pregnancy, guardianship, carer or parental status, race, skin colour,\nnationality, ethnic or national origin, and religion or belief. We recognise\nthat this list can never be exhaustive, and there will be other avenues of\ndiscrimination that we will have missed that are included in this policy.\n\nWhen we talk about inclusion at dxw we are referring to our staff being treated\nfairly and respectfully, having equal opportunities, and removing perceived or\ntangible barriers to being part of our organization and progressing within it to\nensure greater equity. We aim to provide a work environment that is accessible,\nwelcoming, and empowering for all.\n\n## About this policy\n\nThis policy sets out our approach to equal opportunities and the avoidance of\ndiscrimination at work. It applies to all aspects of employment with us,\nincluding recruitment, pay and conditions, holiday, sickness, training,\nappraisals, promotion, conduct at work, disciplinary and grievance procedures,\nand termination of employment.\n\nThis policy has been agreed and implemented following consultation with an\noutsourced Human Resources consultant.\n\nThis policy covers all levels and types of staff, including leadership,\nemployees, officers, consultants, contractors, volunteers, interns, casual\nworkers, and agency workers.\n\nThis policy does not form part of any employee's contract of employment and we\nmay amend it at any time upon any learnings.\n\n## Who is responsible for this policy?\n\nDirectors and the HR Manager have overall responsibility for the effective\noperation of this policy and for ensuring compliance with discrimination law.\nDay-to-day operational responsibility for this policy, including regular review\nof it, has been delegated to the HR Manager.\n\nAll directors, heads of departments, and managers at dxw must set an appropriate\nstandard of behaviour, lead by example, and ensure that they adhere to the\npolicy and promote our aims and objectives with regard to equal opportunities.\nDirectors, heads of departments, and managers will be given appropriate training\non equal opportunities awareness and equal opportunities recruitment and\nselection best practices.\n\nAnyone involved in recruitment must contact their line manager or the HR Manager\nto request training or further information.\n\nAnyone with questions about the content or application of this policy should\ncontact their line manager or HR Manager to request further information or\ntraining.\n\nThis policy is reviewed annually by the HR Manager and directors in consultation\nwith an outsourced HR team.\n\nStaff and contractors are invited to comment on this policy and suggest ways in\nwhich it might be improved by contacting a director or the HR Manager.\n\n## Discrimination\n\nDiscrimination against, or harassment of anyone in or outside of the workplace\nis prohibited.\n\nThe following forms of discrimination are prohibited under this policy and are\nunlawful:\n\n* Direct discrimination: treating someone less favourably because of a Protected\n  Characteristic. For example, rejecting a job applicant because of their\n  religious views, their sexuality, or a disability.\n* Indirect discrimination: a provision, criterion, or practice that applies to\n  everyone but adversely affects people with a particular Protected\n  Characteristic more than others.\n* Harassment: this includes sexual harassment and other unwanted conduct related\n  to a Protected Characteristic, which has the purpose or effect of violating\n  someone's dignity or creating an intimidating, hostile, degrading,\n  humiliating, or offensive environment for them.\n* Victimisation: retaliation against someone who has complained or has supported\n  someone else's complaint about discrimination or harassment.\n\n## Recruitment and selection\n\nRecruitment, promotion, and other selection exercises such as redundancy\nselection will be conducted on the basis of merit and against objective criteria\nthat aim to avoid discrimination. Shortlisting should be done by more than one\nperson and with the involvement of the commercial operations team. Our\nrecruitment procedures must be reviewed at least annually including the\nDiversity and Inclusion Group to ensure that individuals are treated on the\nbasis of their relevant merits and abilities.\n\nVacancies should always be advertised to a diverse section of the labour market\nand, where relevant, to particular groups that have been identified as\ndisadvantaged or underrepresented in our organisation. Advertisements should\navoid stereotyping or using wording that may discourage particular groups from\napplying, and should be reviewed by the Diversity and Inclusion Group before\nbeing published. Vacancies should include a link to the dxw playbook with a\nshort policy statement on equal opportunities and a link to this full Diversity,\nInclusion and Equal opportunities policy.\n\nJob applicants must not be asked questions which might suggest an intention to\ndiscriminate on grounds of a Protected Characteristic. For example, applicants\nshould not be asked whether they are pregnant or planning to have children.\n\nJob applicants must not be asked about health or disability before a job offer\nis made. The following are limited exceptions which should only be used with the\napproval of the HR Manager.\n\n* Questions necessary to establish if an applicant can perform an intrinsic part\n  of the job after any reasonable adjustments.\n* Questions to establish if an applicant is fit to attend an assessment or any\n  reasonable adjustments that may be needed at interview or assessment.\n* Equal opportunities monitoring (which will not form part of the selection or\n  decision-making process).\n\nWe are required by law to ensure that all employees are entitled to work in the\nUK. Assumptions about immigration status should not be made based on appearance\nor nationality. All prospective employees, regardless of nationality, must be\nable to produce original documents (such as a passport or birth certificate)\nbefore employment starts, to satisfy current immigration legislation. The list\nof acceptable documents is available from the HR Manager or UK Visas and\nImmigration.\n\nTo ensure that this policy is operating effectively, and to identify groups that\nmay be underrepresented or disadvantaged in our organisation, we will ask job\napplicants they apply about their ethnic group, gender, disability, sexual\norientation, religion and age. Provision of this information is voluntary and it\nwill not adversely affect an individual's chances of recruitment or any other\ndecision related to their employment. The information is kept in an anonymised\nformat, disconnected from the person it refers to, solely for the purposes\nstated in this policy. Analysing this data helps us take appropriate steps to\navoid discrimination and improve equality and diversity.\n\n## Training, promotion, and conditions of service\n\nTraining needs will be identified through regular conversations between line\nmanagers and their reports. All employees will be given appropriate access to\ntraining to enable them to progress within the organisation. If training needs\nare identified then your Line Manager will work out the best to pay for this.\nThis may be part of your Learning and Development, or something you, dxw or a\nthird party pay for.\n\nWorkforce composition and promotions will be monitored to ensure equality of\nopportunity at all levels of the organisation. All reasonable steps will be\ntaken to identify and remove barriers and to meet the needs of disadvantaged or\nunderrepresented groups.\n\nOur conditions of service, benefits, and facilities are reviewed to ensure that\nthey are available to all and that there are no unlawful or discriminatory\nobstacles to accessing them.\n\n## Termination of employment\n\nWe will ensure that redundancy criteria and procedures are fair and objective\nand are not directly or indirectly discriminatory. Demonstrated through\nindependent consultation, sharing criteria openly and demonstrating our\nworkings.\n\nWe will ensure that disciplinary procedures and penalties are applied without\ndiscrimination, whether they result in disciplinary warnings, dismissal, or\nother disciplinary action. There is a right of appeal to a dxw director or line\nmanager not directly involved in the case.\n\n## Disabilities\n\nIf you are disabled or become disabled, we encourage, but do not require, you to\ntell us about your condition so that we can support you as appropriate.\n\nIf you experience difficulties at work because of your disability, you may wish\nto contact your line manager or the HR Manager to discuss any reasonable\nadjustments that would help overcome or minimise the difficulty. Your line\nmanager or the HR Manager may wish to consult with you and with your medical\nadvisor, if you choose to include one in the consultation, about possible\nadjustments. We will consider the matter carefully and try to accommodate this\nbased on the needs for your role, the cost for the accommodation and dxw’s\nability to make the adjustment. If we consider a particular adjustment would not\nbe reasonable we will explain our reasons and try to find an alternative\nsolution where possible.\n\nWe will monitor the physical features of our premises to consider whether they\nmight place anyone with a disability and take all reasonable steps to improve\naccess.\n\n## Part-time and fixed-term work\n\nPart-time and fixed-term staff should be treated the same as comparable\nfull-time or permanent staff and enjoy no less favourable terms and conditions\n(on a pro-rata basis where appropriate).\n\n## Breaches of this policy\n\nWe take a strict approach to breaches of this policy, which will be dealt with\nin accordance with our Disciplinary Procedure. Serious cases may amount to gross\nmisconduct resulting in dismissal.\n\nIf you believe that you have suffered discrimination you can raise the matter\nthrough our Grievance Procedure. Complaints will be treated in confidence.\n\nThere must be no victimisation or retaliation against staff who raise issues\nabout discrimination. However, making a false allegation, deliberately and in\nbad faith, will be treated as misconduct and dealt with under our Disciplinary\nProcedure."},{"id":"junior-developer-development-plan","name":"Junior developer development plan","content":"## High level goals\n\nBefore a junior developer can be promoted, they need to be:\n\n* independently productive\n* billable as a developer\n\n## Support\n\nA junior developer has the following direct support:\n\n* a mentor (for development related help and guidance)\n* a helper (for dxw / ways of working related help and guidance)\n* a line manager (for everything else)\n\nThey are also supported by individual teams and the technology team as a whole.\n\n## Planned stages\n\n1. Shadowing a project\n2. Creating an internal service\n3. Joining a team (short-term)\n4. Shadowing support\n5. Joining a team (long-term)\n\n### Shadowing a project\n\nWithin the first couple of weeks of joining, junior developers starting at dxw,\nthey should start a 4 to 6 week full-time period shadowing an ongoing project\neach (not the same one), alongside general dxw onboarding. An ideal project\nwould:\n\n* be based where they are\n* have 3 or more people in technical roles working on it\n\nOne person on the project should be assigned as the point of contact, but the\njunior developer should shadow a range of team members, focusing on technical\nroles, but also other members of the team. The goal of this is to give them a\nlow pressure situation to see how dxw does things, and hopefully pick up some\ngood practices.\n\n### Creating an internal service\n\nAfter shadowing, junior developers should spend 4 weeks working on an internal\nservice. This might be creating a new service (entirely new or a new version),\nor adding features to an existing one. It should involve the following\nadditional team members / roles as part-time support (possibly drawn from the\nsupport rota):\n\n* delivery lead\n* developer\n* operations engineer\n* product owner\n\nThis project should be treated in the same way as we do client projects, with a\nTrello board, sprints, stand ups, planning sessions, retrospectives, and show\nand tells.\n\nA good candidate project:\n\n* is one built in the stack the Junior Developers are specializing in\n* has clear, well-defined user needs\n* is brand new or in a clean state with tests for existing features\n* has or needs a browser-based interface\n* can produce something useful for users in 4 weeks by junior developers\n\nJunior developers should be encouraged to pair with each other and with other\ndevelopers in the technology team and to use this project to get familiar with\ndxw’s ways of working, and practice some of the skills they’ll use in the\nfuture.\n\n### Joining a team (short-term)\n\nNext, each junior developer should join a client project team for 8 to 10 weeks,\nunbilled. This team should contain at least 2 full-time technology team members,\nand will ideally be in the beta phase. The junior developers should be\nconsidered full members of the team. They should be expected to be able to pick\nup well defined routine or simple tasks in the sprint, mostly on their own, but\nwith some support from other developers. The teams should ensure that they have\nwell-shaped tasks set aside for the junior developer to take on, and should be\nthinking about this in advance of the junior developer joining the project.\n\nJunior developers should do client work for 3 days a week. The remaining 2 days\na week should be spent working on anything that comes up as areas to focus on\nduring client work, or any skills they’re unable to exercise on the project.\n\n### Shadowing support\n\nWithin the first 4 months of joining dxw, a junior developer should shadow a\ndeveloper on the support rota for a full support shift. During this time, they\nshould be included in triaging, responding to tickets, and any support\ndevelopment work. They should also pair with the developer on any “filler” work\nthey do during quiet moments.\n\nThey should shadow a shift again within the next 4 months, ideally shadowing a\ndifferent developer. After their second shadowed shift, they should be added to\nthe support rota.\n\n### Joining a team (long-term)\n\nOnce a junior developer has spent a decent amount of time working on a client\nproject, as well as working on their own development, they should ideally join a\ndifferent project team with at least 2 full-time technology team members for 3\ndays a week for a longer period of time: at least 3 months. This might not\nalways be possible, but priority should be given to creating continuity to allow\nthem to get settled and fully understand the needs of the service they’re\nworking on.\n\nAfter a month on the project, the team should review how the junior developer is\ndoing on the team, to establish whether they could start to be billed for that\nwork. This review should consider that the value proposition of billing a junior\ndeveloper is long-term. It may cost the client a little more in the short-term,\nbut that value will be made up as the junior developer progresses and gains\nfamiliarity with the service and the team.\n\nIt isn’t a requirement that a junior developer be billed at this point, and\nshouldn’t be considered pressure on the team or junior developer, but more an\nevaluation of how much value they’re delivering for the client. This should be\nrepeated every 4-6 weeks, so we can ensure that their continued progression is\nproperly recognized."},{"id":"laptop-purchasing-policy","name":"Laptop Purchasing Policy","content":"This policy has been created to assist employees who are buying dxw-owned\nlaptops. Please note there is no obligation to buy your laptop upon leaving dxw\nor getting a laptop refresh.\n\n## Who is eligible?\n\ndxw is able to make employee-assigned laptops available to buy if you are\nleaving us or if you are eligible for a refresh. For a machine to be eligible to\nbuy it must meet the following criteria:\n\n* The machine must be more than two years old, or being refreshed\n* You must have successfully completed your probationary period\n* You must sign a waiver to confirm you accept the machine in its current\n  condition\n\n## What is the process for buying laptops?\n\nIf you are interested in buying your machine, a member of the commercial\noperations team will be able to confirm the purchase dates for you and whether\nyou are eligible to buy. Please give at least two weeks' notice of your intent\nto buy. Please note: your machine will still need to be wiped (by you, while on\na call with a member of the technical operations team) ahead of the purchase\nwhich will erase all data from the machine. It is your responsibility to back up\nany personal data that you need to keep to another location prior to the machine\nbeing wiped.\n\n## How is the purchase price calculated?\n\nWe calculate the price of your laptop in the following way:\n\n* A member of the tech-ops team will factor in the age, specification, and\n  condition of your machine and compare it with the equivalent selling price on\n  an online site\n* The price of the previous 5 machines sold on an online site will be considered\n  and the mean price will be calculated\n* A 20% employee discount is then applied\n\n## Warranty and terms of purchase\n\nIf you decide to buy your laptop, please sign the\n[Laptop Purchasing Waiver](https://docs.google.com/document/d/1Ey5Hex20n9DuQrQeebG6CdgPqrKW1LpFTeG9U9cl0Eo/edit#)\nto say that you agree to accept your laptop in its current condition. Once you\nassume ownership, any warranties or insurance dxw may hold for the laptop will\nexpire. dxw will not be responsible for any faults or damage that either exist\nor go on to develop after you buy the laptop.\n\n# Who do I speak to for more information?\n\nIf you have any further questions around this policy or if you need help with a\nspecific query, please speak to a member of the commercial operations team who\nwill be able to assist you. Alternatively, if you need help with a technical\nquery, please contact a member of the technical operations team."},{"id":"learning-and-development","name":"Learning and development","content":"We have an annual learning and development allowance of £1,000 and up to 4 days\nper person.\n\nYou can use this in many different ways for professional and personal\ndevelopment activities. Some ideas include workshops, short courses,\nconferences, coaching, subscriptions and memberships but don’t be afraid to ask\nif you have an idea we haven’t tried yet.\n\nYou can also use the allowance to attend a non role based conference or event\nfocused on improving your health and wellbeing. You will receive two days off\nfor this, and can top up the time from your annual leave allowance.\n\nWe know that lots of training isn’t paid for, and involves things like coaching\nand mentoring, learning from colleagues, being an active part of networks, and\nother self-directed learning. We will encourage and support people who want to\nuse unbilled days for different types of professional development.\n\n## How to use your learning and development allowance\n\n### Find an activity to book\n\nFinding the right thing to use the allowance for can be difficult. Here are some\nways you can find ideas:\n\n* Check the\n  [Learning and development Bikeshed post](https://bikeshed.dxw.com/?p=13876) to\n  see what other people have done this year\n* Ask other people on your team what they've done\n* Talk to your line manager, who can help you identify potential areas for\n  development and find suitable events or training\n* Ask the HR team for ideas\n\n### Book the activity\n\n* Agree the plan with your line manager before you book anything\n* Log it in [Breathe](https://hr.breathehr.com/) as a training request for your\n  line manager to approve:\n\n  * Go to \"My profile\" on the top menu\n  * Click the \"Training\" button\n  * Click the \"+\" button to add a new request\n  * Include weblinks and an estimate of the ticket, accommodation and travel\n    costs (up to the maximum of £1,000, though you are welcome to pay the\n    difference for more expensive events)\n* Once it’s approved, post in the #help-learning-and-development-bookings channel\n  to get support with payment. If it's not work related then you can alternatively purchase it yourself and make an expense claim. If it is work-related then you shouldn't purchase it yourself or else it ends up being subject to tax.\n* Think about sharing event with the rest of your team if it's something other\n  people might find relevant/useful\n* Add to your Google calendar and make sure your project team know when you're\n  going to be away\n\n### After you get back\n\n* Take some time to reflect on what you learnt, and (if appropriate) how it\n  applies to your work at dxw\n* Update the latest yearly\n  [Learning and Development bikeshed post](https://bikeshed.dxw.com/?p=13876)\n  with details of the event\n* Consider writing a standalone bikeshed post giving more details about the\n  event and how you found it\n\n### If you need help\n\n* Contact the HR team, or ask a question in Slack\n  (#help-learning-and-development-bookings)\n\n### The small print\n\ndxw pays for the event ticket, travel, and accommodation, but you will need to\ncover your own costs for food, drink and supplementary equipment.\n\nThe allowance is available to everyone once they have completed their probation\nperiod, within the dxw financial year which runs from the start of July to end\nJune. It is pro-rata for staff who work part-time.\n\nIf you don’t spend your allowance within the financial year, it cannot be\ncarried over. We will start afresh each year, as part of our annual budgeting\ncycle.\n\nYour allowance is counted as being spent at the time of purchase rather than at\ntime of use. For example, if you buy a conference ticket in May for an event in\nJuly the same year, the deduction will be made to the budget for the financial\nyear that May falls within.\n\nAttending conferences and events that are not related to your role is a taxable\nbenefit. As your employer, we will make the declaration, HMRC will then adjust\nyour tax code accordingly to collect the tax via PAYE.\n\nIt’s ok for members of the team to go together, but we need to ensure that\ntraining days have the lowest impact on client work, so there may be times we\nneed to consider whether your request is possible. Our Director of Delivery will\nhelp with prioritisation in those circumstances.\n\nAt the end of each financial year we will review our financial position with the\nintention of increasing the annual allowance.\n\n## Support for professional qualifications\n\nWe may pay for a qualification or training that exceeds the annual £1,000\nindividual learning and development allowance, when that course is relevant and\nhelpful to both dxw and the individual. This is a benefit that comes into effect\nonce you have passed your probationary period.\n\nWe will agree to pay on the understanding that if you leave dxw, you may be\nliable to repay some or all of the fees and expenses incurred.\n\nOther than in exceptional circumstances, which will be decided at the Directors’\ndiscretion, you will be required to repay dxw as follows:\n\n* If you leave dxw before you attend the course, you will repay 100% of the\n  costs that dxw cannot recover from the course provider.\n* If you leave dxw during the course or within 9 months of completing it, you\n  will repay 75% of the costs.\n* If you leave dxw more than 9 months and no more than 12 months after\n  completing the course, you will repay 50% of the costs.\n* If you leave dxw more than 12 months after completing the course, no repayment\n  will be required.\n\nWe appreciate that these percentages won’t always work given the length of the\nqualification, and so the final percentage will be at the discretion of the\nDirectors and will be agreed with the individual prior to approval of the\ncourse.\n\nYou will not be required to repay any costs in the following circumstances:\n\n* Compulsory or voluntary redundancy\n* Retirement due to sickness\n\nPlease complete this\n[form](https://docs.google.com/document/d/1gkK8L345gmmHFjqxduz5hvHyRvejMJd_rVNXQtZLrQE/edit)\nand speak to your line manager or the People Manager if you would like support\nfrom dxw to complete a professional qualification."},{"id":"line-management-guides","name":"Guides for Line Managers","content":"## Learning and development for your team members\n\nPart of your work will be to help your team members grow and develop.\n\nPeriodically you should check in with people to set and review their goals and\nobjectives. When talking about their plans for growth, have a discussion about\ntraining and possible ways to improve or gain new skills. When you agree on\nthose, help them find opportunities or training to reach them.\n\nAs an example these are the areas to cover in learning and development plan:\n\n* Current role\n* Future or changing role\n* Personal development, health and wellbeing\n* Long term career development\n\nFor each of those you could set a short description of the aims, set priority,\nwork out how to achieve it and measure progress.\n\nKeep an eye on and proactively help people think about their L&D allowance. It’s\nalso important to communicate and help team members to make space for using L&D.\n\nRegular conversations with the Head of Practice or a Director focused on teams\nL&D to help keep track of the progress and proactively looking for ways and\nopportunities to provide people space and time to develop."},{"id":"managing","name":"Managing the Playbook","content":"This is the content strategy for dxw Playbook.\n\nIt describes the purpose and users of the Playbook, the kinds of material it\ncontains, how we manage and update the Playbook, and its current intended\nstructure.\n\n## Playbook purpose and users\n\n### Agreed ways of working\n\nThe primary purpose of the Playbook is to document our current, agreed ways of\nworking.\n\nThis purpose also defines the primary audience and users of the Playbook -\npeople currently working at dxw. The Playbook should help them work together\nefficiently and effectively. Secondary audiences and users of the Playbook are\npeople working at actual or potential clients, and people who are thinking about\ncoming to work at dxw. The Playbook should help them understand what it might be\nlike to work with us.\n\nWe also know that people in other organisations look at the Playbook. Although\nwe don’t create any content specifically for them, the Playbook should leave\nlike-minded people with a good impression of us.\n\n### Staff policies\n\nThe Playbook is also where we publish pay, benefits and other staff policy\ninformation.\n\nThis primary audience for this information is people currently working at dxw. A\nsecondary audience is people who are thinking about coming to work at dxw.\n\n## Playbook content\n\nWe divide the Playbook into Topic overviews, Guides and Policies.\n\n### Topic overview\n\nEach section of the Playbook should have some overview material that describes\nimportant values and principles, and lists relevant guides.\n\nWe write overview content so that it can be understood by anyone who is likely\nto look at the Playbook.\n\n### Guide\n\nA guide describes our current agreement on how we do something. Each guide\nshould be aimed at a specific group of people and explain how to do a specific\nactivity.\n\nWe write guides to meet the needs of their specific audience and users. While\nguides should be clear and simple, they can use subject specific language that\nwe are confident is understood by the intended audience and users.\n\n### Policy\n\nA policy describes an official company policy and any associated procedures.\n\nWe write policies so that they can be easily found, understood and acted on by\nall the staff who need to follow them.\n\n## Playbook governance and workflow\n\n### Ownership\n\nEach section of the Playbook has an identified owner, typically either the\ndirector of the relevant part of the business, or the head of the relevant\nprofession.\n\nThe owner is responsible for making sure that their parts of the Playbook:\n\n* continue to reflect our current ways of working and policies\n* are findable, readable, understandable and actionable by its intended audience\n  and users\n\nThe owners of each section are:\n\n* David Mann - [Who we are](/#who-we-are)\n* Alex Jackson - [The work we do > Sales](/#sales)\n* Clare Young - [The work we do > Building services](/#building-services)\n* Alex Jackson -\n  [The work we do > Hosting and supporting services](/#hosting-and-supporting-services)\n* Wendy Coello -\n  [The work we do > Sharing our expertise](/#sharing-our-expertise)\n* Poss Apostolou - [Working here](/#working-here)\n* Coca Rivas - [Our professions](/#our-professions)\n\n### Workflow\n\nFor smaller corrections and updates to the Playbook, staff should consult with\nrelevant colleagues and follow the\n[guide to contributing to the Playbook](/guides/contributing).\n\nFor more significant additions and changes to the Playbook, the steps are:\n\n* the owner of the section and the author agree the need for the update\n* the author drafts and reviews the update with appropriate colleagues\n* the author follows the\n  [guide to contributing to the Playbook](/guides/contributing)\n* the owner and colleagues review and approve the changes\n\n### Review\n\nThe owner of each section of the Playbook should lead a review of the sections\nthey own at least every quarter.\n\nTo help facilitate regular review, we should aim for Playbook content to include\nlast updated and last reviewed dates.\n\n### Coordination\n\nWe use the [\\#dxw-playbook](https://dxw.slack.com/archives/CK5HUK6SE) Slack\nchannel to collaborate on the Playbook.\n\n## Playbook style\n\nThe Playbook should follow the dxw\n[Brand Toolkit](https://v-df7640e636dddb2c9710.brand.madebyfieldwork.com/) and\nuse the dxw [Tone of voice](/guides/tone-of-voice).\n\n## Playbook structure\n\nThis is the current intended structure of the Playbook.\n\n### Who we are\n\nThis section provides in introduction to dxw and the Playbook. It sets out our\nmission, values and principles. It covers aspects of our governance. It\ndescribes our brand and shows where to find brand materials. And it covers the\nPlaybook itself.\n\n### The work we do\n\nThis section covers the different kinds of work we do for our clients. From how\nwe find and sell that work, and how we carry it out, to how we share and promote\nour expertise and experience.\n\n### Working here\n\n#### Managing your day to day work\n\nThis section covers things like managing and recording time, getting and paying\nfor things, using devices, data and tools, and working locations, travel and\naccommodation.\n\n#### Your pay, pension and other benefits\n\nThis section covers formal benefits like pay, pension and leave. It covers part\ntime and flexible working. And also grievances and disciplinary procedures.\n\n#### Supporting your development and wellbeing\n\nThis section covers support structures, learning and development and wellbeing\nbenefits.\n\n#### Hiring new people\n\nThis section covers how we hire people and programmes like returners.\n\n### Our professions\n\nThis section contains principles, practices and specific guidance for each of\nour professions."},{"id":"office-accessibility","name":"Office accessibility","content":"## Leeds\n\ndxw’s headquarter office is at Calls Landing, 36-38 The Calls, Leeds.\nThere is a [Leeds Office Guide](https://docs.google.com/document/d/1jHsQJH__2sZssJYZiLqLPyDjZWl5Ixhscx4R-0hMDXs/edit) available if you would like to visit this space. \n\nIf you need any support with using this space, post your question in the #leeds-office channel and a member of the team will be able to help. \n\nIf you need any further information about any features of the office that could impact your access, please contact us at contact@dxw.com.\n\n## London\n\n#### **Huckletree**\n\ndxw has access to a co-working space in central London called Huckletree, located in the Alphabeta Building, 18 Finsbury Square. There is a [Huckletree Office Guide](https://docs.google.com/document/u/0/d/1uQ-2BlkxfWimA_kFYdaM_lEQFK3zuRO6uSAwxAfJk50/edit) which includes information about how to book. \n\nIf you need any support with using this space, post your question in the #dxw-london-office channel or email shoreditchreception@huckletree.com. \n\nThe nearest tube stations to Huckletree Shoreditch are Old Street, Moorgate and Liverpool Street Underground stations. Finsbury Square is also served by multiple local bus routes. \n\n#### **Hoxton Square**\n\nThe dxw office in London is at 11 Hoxton Square. This space is suitable for small meetings only, and if you require access to this building, please make a request in the #dxw-london-office channel.\n\nThe nearest tube and train station is Old Street (Northern Line, National Rail\nServices). Use the TfL Journey Planner, which will also have up to date\ninformation about any service disruptions. Nearest Overground stations are\nShoreditch High Street and Hoxton.\n\nBuses: 55, 243, 149, 67."},{"id":"plugin-advisories","name":"GovPress plugin Advisories","content":"## Workflow\n\nWe'll normally create an advisory as a result of a plugin inspection where we\nwere able to quickly prove that the plugin is vulnerable. We may also do so as a\nresult of issues found in a pen test.\n\nThe steps for progressing an Advisory are:\n\n1. Check for existing advisories\n2. Write up an advisory\n3. Report the advisory to the plugin author\n4. Notify the WordPress plugin admins (only in special circumstances)\n5. (at a later date) Publish the advisory\n6. Request a CVE\n\nThe progress of advisories inspections is tracked alongside inspections using\nthe\n[inspections Trello board](https://trello.com/b/sN42avTZ/dxwsec-inspections-and-advisories)\n\n## Check for existing advisories\n\nPluginscan includes a report on vulnerabilities, based on the API exposed by the\n[WPScan Vulnerability Database](https://wpvulndb.com/)\n\nIt's important that we avoid publishing advisories that have already been\nreported by someone else.\n\n## Writing up Advisories\n\n### Naming the advisory\n\nTitles should be in the following format:\n\n> \\[Vulnerability Type] in \\[Plugin Name] allows \\[User Type] to \\[Do Bad Things]\n\n* XSS should always say whether it’s stored or reflected\n\nHere are some Harry-approved examples:\n\n* Arbitrary Code Execution in NextGEN Gallery allows privileged users to run php\n* CSRF and stored XSS in WordPress Content Slide allow an attacker to have full\n  admin privileges\n\n### CSRF/XSS:\n\nTitle:\n\nReflected XSS in \\[plugin name] allows an unauthenticated attacker to do almost\nanything an admin can\n\nDescription:\n\n> An attacker able to convince an admin to visit a link of their choosing is\n> able to execute arbitrary JavaScript\n>\n> …the attacker can then use JavaScript to perform almost any action an admin\n> can take (including creating new users, executing arbitrary php through the\n> theme editor or exploiting vulnerabilities in WordPress or other plugins which\n> normally require the user to be authenticated as an admin).”\n\nor maybe:\n\n> If an attacker is able to convince a logged-in admin user to follow a link\n> (phishing emails can be made to look very convincing), then …\n\nProof of concept:\n\n> If a logged-in administrator user clicks the submit button on this form, a\n> JavaScript alert will display on \\[A SPECIFIC PAGE] (In a real attack the\n> form can be made to auto-submit using JavaScript).”\n\n### Unserialize\n\nTitle:\n\nUnserialize vulnerability in \\[plugin name] allows an attacker to run code on the\nserver\n\nDescription:\n\nIf there are classes with methods like `__destruct()` that have certain\nproperties, the attacker can …\n\n### Mitigations\n\n* Disable the plugin until a new version is released that fixes this bug\n\n### CVSS Scores\n\n* Need to be considered in isolation: e.g. if it’s merely an enabler of other\n  bad stuff then only consider the impact on e.g. integrity\n* CSRF/XSS vulns (i.e. get a logged-in admin to click a link) are Access\n  Complexity: medium.\n\n## Reporting an advisory\n\nIn order to publish advisories responsibly there are a number of steps which\nmust be followed:\n\n* Ensure you're happy with the text of the findings and the title (see\n      previous sections)\n* Ensure that the mitigations section says something like 'Disable the\n      plugin until a new version is released that fixes this bug'\n* Ensure that the 'Timeline' section includes the date that the\n      vulnerability was discovered\n* Publish the advisory privately (Publish > Visibility > Edit) - Make sure\n      it doesn't get tweeted!\n* Publish the associated inspection privately in the same way\n\nNote:\n\n* The format of timeline entries should be `YYYY-MM-DD: Message`, e.g.\n  `2013-08-09: Discovered`\n\n### Notify the plugin Author\n\nNote:\n\nIn extreme cases where the advisory will have a significant impact we may need\nto request an encrypted email connection for these communications. In all other\ncases, normal email is fine.\n\n* On the (privately) published page, under \"Text version for reports\" click\n      the \"Click for a blank email with the right subject\" link\n* Copy the email text from \"Text version for reports\"\n* Find contact details for the plugin author\n* Add a humanising intro and send to the plugin author\n* Add a note to the timeline, mentioning the method - e.g. 2014-01-02:\n      Reported to vendor by email\n* At the bottom of the page, set the status to \"Reported\"\n\nAs an example of a humanising intro:\n\n> Hello We’ve found a security vulnerability in Version 2.8.2 of the Advanced\n> Access Manager plugin – please see the details below. After you’ve had a\n> chance to investigate could you please let us know a timeline for a fix – our\n> disclosure policy is linked at the bottom of the report. Best regards Duncan\n\n## Notify the WordPress plugin admins\n\nThere are two scenarios in which the WordPress plugin admins\n(plugins@wordpress.org) should be contacted:\n\n1. If we really couldn’t get in touch with the plugin dev\n2. If the vulnerability is really serious and the plugin is popular (say over\n   100,000 downloads), so needs to be taken down ASAP\n\nTheir policy is this:\n\n> Every attempt to contact the developer directly should be made BEFORE you\n> reported the plugin to us. Since our policy is to close the plugin (preventing\n> new downloads) until it’s fixed, you may not be alerted until the plugin is\n> updated.\n\n* Hit the \"WP Plugins\" button under \"Report emails\"\n* Add a note to the timeline - e.g. 2014-01-02: Reported to WP Plugins\n\n### ⚠️ IMPORTANT ⚠️\n\nIf we couldn’t get in touch with the plugin author then WP Org may be able to\ncontact them on our behalf, BUT we shouldn’t expect them to feed back any\ninformation to us, or even to confirm that they have successfully contacted the\nauthor (they are extremely busy).\n\nTherefore we shouldn’t say things like “No response from WP Org” (because we\nshouldn’t expect one) or “No response from author to WP Org” (because we don’t\nknow that’s the case).\n\n## Publishing an Advisory\n\nThere are two reasons that we will publish an advisory:\n\n* The plugin author lets us know that they’ve fixed the issue and released a fix\n* We couldn’t contact the plugin author, or they didn’t respond within the time\n  period defined in our\n  [disclosure policy](https://security.dxw.com/disclosure/)\n\nIf an author has at any point been in touch and shown willingness to cooperate\nthen we should give them the benefit of the doubt and make several attempts to\nget in touch.\n\n### Preparing advisories for publication\n\nIf the issue is fixed:\n\n* Ensure that there's a note in the timeline of when the vendor first\n      replied.\n* Update the timeline as appropriate, e.g. 2014-01-02: Vendor reported issue\n      fixed in version 1.2.3\n* Update the timeline as appropriate, e.g. 2014-01-05: Advisory published\n* Mark the advisory from 'Reported' to 'Fixed'\n* Update the 'mitigation' section to say 'Upgrade to version X or later'\n\nIf the issue is NOT fixed:\n\n* Update the timeline as appropriate, e.g. 2014-01-02: Vendor could not be\n      contacted\n* Update the timeline as appropriate, e.g. 2014-01-05: Published\n* Leave the status as 'Reported'\n* Update the 'mitigation' section to say 'Disable: the plugin has been\n      removed from the plugins directory and no fixed version is known.'\n\nIf the plugin was removed from the directory:\n\n* Update the timeline as appropriate, e.g. 2014-01-02: Plugin has been\n      removed from the WordPress directory\n* Update the timeline as appropriate, e.g. 2014-01-05: Published\n* Leave the status as 'Reported'\n* Update the 'mitigation' section to say 'Disable: no fixed version is\n      known.'\n\n### Publishing the advisory and associated inspection\n\n* Set the Tweet status to 'Tweet'\n* Amend the published date to today (otherwise it will show with the\n      privately published date)\n* Publish the advisory\n* While logged in, view the published advisory and hit the Full Disclosure,\n      WP Scan and dxw WP Security buttons\n\nOnce the advisory has been published the associated inspection can also be\npublished:\n\n* Add a link to the advisory\n* Set the Tweet status to 'Do not tweet'\n* Amend the published date to today (otherwise it will show with the\n      privately published date)\n* Publish the inspection\n\nOnce it's published we can alert upstream:\n\n* Email the developer:\n\n  * thank them for the fix\n  * include a link to the advisory\n  * suggest that they add the link to the changelog\n\n### Request a CVE\n\nNote that most CVEs cannot be requested before publication due to the rules of\nthe Distributed Weakness Filing project. Vulnerabilities in plugins made by\nWordPress itself follow different rules as they're covered by MITRE.\n\n* Visit <https://iwantacve.org> and fill out the form\n* Add a note to the timeline - e.g. 2014-01-02: Requested CVE"},{"id":"plugin-reviews","name":"GovPress plugin reviews","content":"## Workflow\n\nRequests for plugin inspections will normally be received as a ticket from the\nclient. The high-level process is as follows (each step is covered in a section\nbelow):\n\n1. Check for existing inspections\n2. Add a card to the Trello board\n3. Check the plugin for issues using\n   [pluginscan](https://git.govpress.com/dxw/pluginscan)\n4. Write up an inspection report in security.dxw.com. If the plugin does not\n   appear to be vulnerable, this can be published immediately\n5. If the plugin appears to be vulnerable, spend a short amount of time\n   attempting to prove it.\n\nIf we aren't able to prove the vulnerability then we should publish the\ninspection as 'potentially unsafe' and leave it at that: it's important that we\ndon't spend too much time on these.\n\nIf we were able to prove that the plugin is vulnerable then we shouldn't publish\nthe inspection yet and instead write up an Advisory. This is covered in a\nseparate guide.\n\n## Checking for Inspections\n\nLog in to [dxw advisories](https://advisories.dxw.com/) and search for any\nexisting inspections for this plugin. Bear in mind that some of these may be\ndraft or privately published.\n\n* If we have inspected the latest version of the plugin, no further action is\n  required.\n* If we have inspected a much older version of the plugin, a new review is\n  necessary\n* For anything in the middle, the decision to do a new review should take into\n  account:\n\n  * Previous poor reviews or advisories\n  * The difference in version numbers (bearing in mind that many WordPress\n    plugins don't follow semver)\n  * The date of the last inspection\n\n## The Trello board\n\nThe progress of plugin inspections is tracked using the\n[inspections Trello board](https://trello.com/b/sN42avTZ/dxwsec-inspections-and-advisories).\nAlthough this contains a backlog of pending inspections, the order these are\nworked through should be based on the associated tickets, or on Fridays, in\ndiscussion with DMs.\n\n## Inspecting the plugin\n\nMost plugins can be downloaded from the\n[directory](https://en-gb.wordpress.org/plugins/). Premium plugins may have to\nbe purchased (discuss with DMs).\n\nWe use a tool called [Pluginscan](https://git.govpress.com/dxw/pluginscan) for\ninspections. It does not have a full understanding of the code - instead it\nlooks for specific patterns and function names which may indicate that the code\nis unsafe.\n\nA plugin inspection mostly involves checking these pattern matches to see if\nthey represent real issues.\n\n## Writing up Inspections\n\nIf the plugin is large (around 15,000 or more lines of code), start with a line\nlike this:\n\n> At over 26,000 lines of PHP this is a very large plugin, which makes it\n> difficult to thoroughly assess\n\n### Recommendations\n\nIf a plugin has a vulnerability, but I need to be authenticated in order to\nexploit the vulnerability it’s probably ‘Use With Caution’."},{"id":"running-a-discovery-kick-off-workshop","name":"Running a discovery kick-off workshop","content":"This guide explains how we run a kick-off workshop for a discovery project at\ndxw digital.\n\nFor an alpha or beta, or for a significant update to a live service, we run a\n[roadmapping workshop](/guides/running-a-roadmapping-workshop).\n\nFor discovery focussed projects it can be less clear what the end result will\nbe, and whether we’re looking at a single service or cutting across several. So\nwe use a broader set of questions.\n\nThese are based on the\n[questions to frame a problem](https://www.hollidazed.co.uk/2015/07/28/frame-the-problem)\nthat [Ben Holiday](https://twitter.com/BenHolliday) wrote about, the\n[discovery inception categories](https://www.myddelton.co.uk/blog/setting-up-a-discovery)\nthat [Will Myddelton](https://twitter.com/myddelton) described, along with some\nof the roadmapping questions.\n\n## Questions for discovery\n\n1. **Why are we doing this work?**\n\n   What is the motivation? What are we trying to do or decide?\n\n   And why now? What is the trigger?\n2. **Who are the users?**\n\n   Are they members of the public, professionals or staff? Are they current or\n   potential users?\n\n   What different groups, job roles, circumstances, environments, access needs\n   and support needs might be important? Who might currently be worst served and\n   most likely to experience barriers?\n\n   How will we engage and involve the different people we need to work with?\n3. **What organisations and stakeholders are involved?**\n\n   Are they colleagues from our organisation or other public sector bodies? What\n   community, civil society, professional and advocacy groups might be\n   important?\n\n   What is their relationship to the work? What expectations and concerns might\n   they have? How closely might they be involved? How might they help?\n4. **What outcomes will users get?**\n\n   What do we know about their intentions? What problems might we solve for\n   them?\n\n   What’s working that we might build on? What unintended consequences might we\n   create?\n5. **What outcomes are we looking for?**\n\n   What are we trying to achieve? What problems are we trying to solve? What\n   decisions are we trying to make?\n\n   What are the other organisations and stakeholders looking to get? What\n   external costs and impacts should we consider?\n\n   What standards and codes are relevant, for service, accessibility, equality,\n   technology?\n6. **What do we need to learn or prove?**\n\n   What questions are we trying to answer? What do we need to know to make good\n   decisions? What might we already know?\n\n   What assumptions should we be exploring and testing? What biases and gaps in\n   understanding might we have?\n\n   What might we need to show for our conclusions to be accepted?\n7. **What do we need to communicate?**\n\n   What meetings, governance and other processes do we need to feed into?\n\n   What outputs might we expect to create? Why and for who?\n\n   How will we share information? How will we make our communications accessible\n   and inclusive?\n8. **What other work relates to this?**\n\n   What has been done before, or is being done now?\n\n   What can we learn from each other? What should we share? How do we stay\n   aligned with that work?\n9. **What difficulties might we face?**\n\n   How might we be blocked? What rabbit holes could we fall down?\n\n## Asking the questions\n\nTo prepare for the workshop:\n\n1. Write each question on a separate sheet of paper on a wall, or frame on a\n   Miro board, or column on a Trello board.\n2. Get the people you need together in a room or on a video call.\n\nFor each question:\n\n1. Ask the question to get a discussion started.\n2. Write bullet points on the appropriate sheet, or on sticky notes or cards to\n   summarise what people say.\n3. Ask follow up questions to clarify what you hear and to make sure you include\n   everyone’s thoughts.\n4. Ask about priority and scope. What’s essential? And what’s out of scope?\n5. You can facilitate this on your own, but the first few times you might want\n   to have a separate moderator and scribe. And it always helps to have another\n   colleague in the crowd who is focussed on listening and picking up on\n   anything you miss.\n\nIt’s best to put all the questions up together. The things people say in the\ndiscussion will often relate to more than one question – for example, people\noften mention outcomes for the organisation when they talk about why we’re doing\nthe work. With all the questions up you can place items under the appropriate\nquestion.\n\nThis method works well for groups up to 10 and typically takes 2 to 3 hours\ndepending on the breadth and complexity of the work.\n\n## Getting the right people together\n\nWhen you invite stakeholders to the workshop, aim to get a good mix of senior\ndecision makers with a broad understanding of context and outcomes, together\nwith colleagues who have more practical and detailed knowledge. Aim to cover the\nkey interest groups so nobody is left feeling unrepresented.\n\nSome people you invite may not see the point of the workshop. They may feel that\nyou have all the necessary information in the documents you’ve received. Or that\nyou’ve discussed the important points already.\n\nSharing the questions in advance can help people to understand the purpose of\nthe session and to prepare for it. Make sure you acknowledge what you’ve\nreceived and discussed already, so people don’t feel like you’ve ignored all\nthat.\n\nI always say that we haven’t got long for the discovery. We want to hear from\neveryone, to make sure we’re focussing on the right things, so they get the most\nout of the work.\n\n## Managing the session\n\nDuring the session, most people will be happy to talk – this is something\nthey’re interested in and know loads about. You’ll need to manage the amount of\ndiscussion to make sure you get through all the questions in a reasonable amount\nof time.\n\nThe questions and workshop format are good for uncovering different opinions,\nconflicting objectives, unrealistic expectations, etc. It’s good to note those\nthings during the session so everyone knows there are different viewpoints. But\ndon’t make a big deal of it and derail your own meeting. It’s a discovery and\npart of the point is to identify those differences and help resolve them into\nsomething more coherent.\n\n## Using the workshop outputs\n\nThe question sheets, sticky notes or cards create ready-made outputs from the\nworkshop. You can transcribe points from paper sheets or sticky notes into\nanother document or tool like Trello or Miro. And you can sort related items\ninto groups under each question.\n\nFrom there you can use the answers to:\n\n1. Set overall discovery and first sprint goals.\n2. Plan the discovery activities – including stakeholder engagement, desk\n   research, user research, business process analysis and journey mapping.\n3. Build an initial map of the problem space to define a scope for the\n   discovery.\n4. Start thinking about the possible shape of the discovery outputs."},{"id":"running-a-roadmapping-workshop","name":"Running a roadmapping workshop","content":"For an alpha or beta, or for a significant update to a live service, we run an\ninitial roadmapping workshop during inception.\n\nThe aim of the workshop is to get everyone on the same page about the goals,\nactivities, risks and dependencies of the project.\n\nOur roadmapping workshops are developed from the\n[Seven questions to build a roadmap](https://www.jamiearnold.com/blog/2014/07/22/seven-questions-to-build-a-roadmap)\ndescribed by Jamie Arnold.\n\nFor a discovery, we run a\n[discovery kick-off workshop](/guides/running-a-discovery-kick-off-workshop).\n\n## Why we have a roadmap\n\nA roadmap is a strategy tool. It sets out the direction for a product or service\nand outlines how we’ll achieve our objectives.\n\nRoadmaps should:\n\n* Set clear, agreed goals\n* Be related to outcomes, rather than specific outputs and dates or releases\n* Be adaptable and respond to change\n* Cover the complete service we are providing, not just the digital parts we are\n  building\n\nWe create roadmaps in workshops where we aim to:\n\n* Understand and make sure we have agreement on the goals of the project\n* Figure out what we need to have to be successful (capabilities), and how that\n  relates to the goals and desired outcomes\n* Identify risks and dependencies\n* Understand the stakeholder landscape\n* Set priorities, particularly for the things we need to do first\n\nBefore the workshop you need to have clear high level goals for the work, and\nthe commitment of key stakeholders to attend. If you don’t have those, focus on\nunderstanding and resolving those issues first\n\nAfter the workshop, the roadmap becomes a living part of the project\ndocumentation. But we recognise that the conversations that come from building\nthe roadmap are just as, if not more, important than the document itself.\n\n## Questions for roadmapping\n\n**About the project**\n\n1. What are our goals and outcomes?\n\n   What are the overall goals for the project and service?\n\n   What intermediate outcomes do we want to achieve? How might we measure them?\n\n   What standards and codes must we meet, for service, accessibility, equality,\n   technology?\n2. What are we assuming?\n\n   What ideas and beliefs are our goals and outcomes based on? How confident are\n   we that they are true? That they won’t change?\n\n   What biases and gaps in understanding might we have? What unintended\n   consequences might there be?\n3. What are we trying to learn or prove?\n\n   What do we need to know to make good decisions? What might the organisation\n   already know?\n\n   What risky assumptions should we be testing? What will we need to prove to\n   validate our work?\n\n**About the service**\n\n1. Who are the users?\n\n   Are they members of the public, professionals or staff? Are they current or\n   potential users?\n\n   What different groups, job roles, circumstances, environments, access needs\n   and support needs might be important? Who might currently be worst served and\n   most likely to experience barriers?\n\n   How will we engage and involve the different people we need to work with?\n2. What are we operating?\n\n   What digital and physical components will the service be made up of? What\n   people will be involved in operating the service?\n\n   What digital and offline channels and support routes might there be? Which\n   channels might different groups need and use?\n\n   How will we roll out the service to all the people who might need to use it?\n3. What capabilities do we need?\n\n   What capabilities will we need to build and operate the service?\n\n   What do we already have? What is new? What is well understood and what is\n   novel?\n\n**About the context**\n\n1. Who are our stakeholders?\n\n   Are they colleagues from our organisation or other public sector bodies? What\n   community, civil society, professional and advocacy groups might be\n   important?\n\n   What is their relationship to the work? What expectations and concerns might\n   they have? How closely might they be involved? How might they help?\n2. What are our dependencies?\n\n   What other work or organisations will the project and service depend on? What\n   other work might be an enabler or blocker for us?\n\n   Who is depending on us?\n\n   How will we manage those dependencies?\n3. What do we need to communicate?\n\n   What meetings, governance and other processes do we need to feed into?\n\n   What communications might we expect to create? Why and for who?\n\n   How will we share information? How will we make our communications accessible\n   and inclusive?\n\n## Using Now, Next and Later to prioritise\n\nBy default, we prioritise the roadmap into:\n\n* **Now**, the first outcomes we’ll work towards and all the things we’ll need\n  to do for those\n* **Next**, the outcomes we’ll work on once we’ve completed the first things\n* **Later**, everything else\n\nTo help ground the discussion, you can give a timeframe to the Now and Next.\nThis might be quarters for a bigger piece of work, or single sprints for a\nsmaller project.\n\nWe recommend prioritising as you ask each question, rather than waiting until\nthe end. This will involve some iteration as the answers to later questions\ninfluence previous thoughts about priorities.\n\nBe careful not to always prioritise the largest groups and most common needs.\nConsider prioritising people who are currently worst served and who experience\nthe most barriers.\n\nAnd be careful not to leave work on accessibility and inclusion until Later. You\ncan and should be working on these from your first sprint.\n\nYou might not have time to prioritise everything. But the conversations about\npriority should help set the direction and scope of your first sprint.\n\n## Planning the workshop\n\nFrom our experience, roadmapping workshops take from 2 hours to a full day.\nFollow [good workshop practice](http://www.liberatingstructures.com/principles)\nto help everyone contribute, make the best use of their valuable time and\nproduce a good result.\n\nIf a service is particularly large and complicated, it’s better to build a high\nlevel roadmap that you can refine later, rather than trying to run a longer and\nlarger workshop.\n\nThe product owner and delivery or transformation lead normally lead the\nworkshop. And you should aim to have a broad set of participants to represent\nthe views of both the delivery team and the wider client organisation.\n\nFrom the client organisation, aim to include people from service and product\nmanagement, policy, operations, and technology, along with specific subject\nmatter experts.\n\nFrom the team you might also include a designer, researcher, developer and\ntechnical architect.\n\n## Building the roadmap\n\nBefore the workshop:\n\n* Create a grid with a row for each question, and columns for Now, Next and\n  Later. This can be on a wall, or in an online tool like\n  [Miro](https://miro.com/).\n\nDuring the workshop:\n\n* Start with the goals. Work to make them clear, then break them down into more\n  specific outcomes with potential measures Work through the rest of the\n  questions, one by one\n* For each question, ask participants to write items on paper or digital sticky\n  notes\n* Ask participants to talk about their items, to clarify and improve any unclear\n  items, and to make sure you include everyone’s thoughts\n* Group or stack similar items\n* Discuss priorities as you go. Place the items in the Now, Next and Later\n  columns\n\n## Using the roadmap\n\nTurn the outputs from the workshop into a roadmap document. It can live on a\nwall, in a tool like Miro, or both. We usually arrange the content of the\nroadmap into swimlanes. These can be:\n\n* The roadmapping questions\n* Common themes or workstreams within the project\n* Specific goals or outcomes\n\nUse the roadmap to start conversations with stakeholders about activities and\npriorities, and to gain consensus across teams and organisations.\n\nSomeone must own and maintain the roadmap. Most often this will be a Product\nManager or Product Owner in the client organisation, although we will own the\nroadmap if we have to. The owner works with the team and stakeholders to\nregularly review and update the roadmap. Without clear ownership the roadmap\nwill quickly drop out of use and lose its value."},{"id":"service-design-at-dxw","name":"Service Design approach","content":"This is an outline of how we approach Service Design at dxw. Service Design can\ncross over a number of disciplines, so we've written this based on our\nexperience of applying service design to projects at dxw.\n\n## 1. Clarify the problem and set the direction\n\n* As part of the project kickoff, service designers interrogate the brief set by\n  the client. Following an inception workshop, we might facilitate a **problem\n  framing** session to identify the intended outcomes of the work (though not\n  their expected solutions), alongside the recognised needs and problems that\n  have initiated the project. This session happens early in the inception phase\n  so that the outcomes can inform the project roadmap. We may use this\n  [problem framing template](https://docs.google.com/spreadsheets/d/1ygq9oF97XI5VebbchAP422oLo6SigkK_Ts__0TaS0-Y/edit?usp=sharing)\n  to help structure the discussion with stakeholders.\n* Problem framing results in a clear and careful articulation of the problem and\n  the **measurable impact** that will result from the project. Arriving at this\n  statement together with the client helps the project team **align on a clear\n  scope**, and serves as a guide throughout the decision-making stages of the\n  design process.\n* We work with user researchers to **develop a project plan** outlining the\n  activities and methods that are appropriate to the project. At this stage, we\n  can **select and adjust the activities** which will best meet the project’s\n  budget, time and people constraints, as well as any other nuances. We may play\n  with non-standard approaches and tools such as provocations and mental models,\n  particularly when creating a new service that doesn’t yet exist.\n\n## 2. Explore the service landscape and visualise insights\n\n* Service designers work closely with user researchers to **conduct research**\n  with users, stakeholders and internal teams and **synthesise insights**.\n  Throughout research we aim to understand the people, processes, data and\n  technologies that make up the service landscape and help the team to see the\n  “bigger picture”.\n* We also **look outwards**, considering social, environmental and economic\n  factors, policy, technology and behavioural trends and other existing data.\n  This helps **build a richer picture** of the ecosystem that the service will\n  inhabit.\n* We take a **systems thinking** approach in all that we do. This means viewing\n  the service landscape as a system of interconnected components (both ‘hard’\n  and ‘soft’) and considering **relationships and feedback loops** between them.\n  It also means we seek to understand system **dynamics** and how things may\n  change over time. In this way we think about problems in both the **short and\n  long term**, considering opportunities for change in both timeframes.\n* When we **visualise the insights** gathered throughout the exploration, it\n  helps us to think through the problem at different **levels of zoom**, moving\n  between the abstract and concrete. We keep a holistic view by **mapping the\n  service**, particularly the ecosystem, stakeholders and current state. But we\n  also dig deep into the details and visually capture the more technical aspects\n  such as the behaviours, data, systems and processes involved.\n* This process **highlights opportunities** to improve service experiences and\n  helps us to communicate them to others.\n\n## 3. Create a service strategy\n\n* Service designers aim to **preserve clarity in the scope** throughout the\n  process and evolve the problem statement that was created at the beginning of\n  the project. For example, early in a discovery it may not be clear what the\n  service can achieve, so the problem statement may be adjusted as decisions are\n  made and limitations become clearer.\n* Service designers think about the strategy of the service, and how it will\n  meet both the user and the organisation or business goals. We can help service\n  teams to develop business models and value proposition statements that are\n  clear, measurable and demonstrate benefits to both the end-user and\n  organisation.\n\n## 4. Imagine new service experiences\n\n* Service designers help the team transition **from research insights to service\n  concepts**. We plan and facilitate workshops and other design activities.\n  There are a number of methods that we may use at this stage, but all of them\n  link concepts directly to value creation for both the user and the\n  organisation.\n* **Co-design** is the gold-standard method to use during this exploratory\n  phase. We bring together stakeholders, subject matter experts, designers and\n  where possible end users to generate and discuss design ideas.\n* As part of ideation sessions, service designers can facilitate the\n  **prioritisation of concepts** to prototype the best concepts (or blends of\n  concepts). We use tools such as heuristic reviews or the theory of change to\n  reflect on whether the proposed solution meets the needs and initial\n  intentions of the service.\n* We help multi-disciplinary teams to reach the best outcomes by ensuring\n  insights and ideas are shared effectively and that different **workstreams are\n  aligned**. We facilitate **collaborative decision-making** and help teams and\n  wider stakeholders reach **consensus** on the way forward.\n\n## 5. Prototype the service\n\n* Before any prototyping begins, service designers test the proposition with\n  customers to understand if it will offer value to the end-users/customers as\n  well as the business.\n* Service designers **prototype and test service elements** that fall outside of\n  a screen context, for example experiential prototypes of a physical space.\n* Service designers consider wider factors relevant to service success such as\n  marketing, communications, business process change and behavioural change. We\n  work with relevant teams and specialists to design and prototype these\n  elements of the service where possible.\n* A service designer may support the creation of screens and user flows, or\n  would ideally support an interaction designer in doing this. We work to ensure\n  that interaction designers, content designers and developers have clear user\n  stories to work from, and that these are grounded in research insight. We also\n  help define a prototyping strategy.\n\n## 6. Tell the story and plan for implementation\n\n* As we move from abstract to concrete, we craft artefacts that help others to\n  **envision the proposed service**. We blend visual storytelling (e.g.\n  storyboarding), which develops empathy for the people using and delivering the\n  service, with technical diagrams (e.g. service blueprints), which serve as a\n  detailed guide towards the implementation of the experience.\n* Service design helps to **build a narrative** of the service. Reflecting on\n  the initial problem statement, a service designer can create a compelling\n  presentation that explains how the problems identified at the start of the\n  project have the potential to be resolved through the proposed service,\n  explaining the rationale for the design decisions along the way.\n* Service designers consider factors that contribute to the service’s **future\n  success**. We can create guides to support its implementation, prepare\n  training that staff may need in order to deliver the service, and recommend\n  organisational structures to ensure it will be properly managed in the future.\n* We also consider factors that could limit the success of the service and help\n  teams mitigate them through **risk management**.\n* Services never exist in a vacuum, and their success depends on good alignment\n  with the technology and processes that surround them. Service designers help\n  manage these **technical and non-technical interfaces**.\n\n## 7. Beta, live and beyond…\n\n* Service designers like to be involved throughout the beta and live phases of a\n  new service to help ensure that **performance is tracked and outcomes\n  measured**. We help service teams set up Key Performance Indicators and the\n  data streams required to track them.\n* In a similar way we can also **support teams running existing services** to\n  identify and implement improvements.\n* When those services require transformation of an existing service the service\n  designer plays an important role helping to **define channel shift\n  strategies** for transitioning to a digital service."},{"id":"setting-up-a-new-project","name":"Setting up a new project","content":"At dxw we frequently start new projects and work with clients we haven’t worked\nwith before. Delivery leads at dxw are responsible for setting up projects and\nensuring all the right things are in place for when the team starts work.\n\nWe often find that time is limited and transitioning between projects can be a\nchallenge, for delivery leads and the wider team.\n\nThis guide provides advice and tips, as well as a checklist for delivery leads\nabout to start a new project. It can work for large projects (a phase of work\nlike a discovery or a beta) as well as smaller projects which might only be a\nfew weeks long.\n\n## Before a project starts\n\nIn most cases, there’s not a very long lead time between winning a piece of work\nand starting it. We sometimes have a number of days, rather than weeks, for the\nteam to get everything in place. This includes things like contracts, scheduling\na team to do the work and making a plan for the first few days.\n\nWe’re lucky if the same delivery lead has been involved in the sales work that\nled to the project being won, because there’s always other work in flight. It’s\nimportant that knowledge is shared and the necessary introductions made so we\ncan get the work off to a good start.\n\nIt is however worth remembering that most of our sales proposals are produced\nwith limited information about the project, and it’s only once we start that we\nget a better idea of what the work is and what skills we’ll need to do it.\n\nThere are several things that delivery leads should do first, regardless of the\nshape of the project:\n\n### Do some reading\n\nGet hold of any background materials, such as proposal documents, meeting notes,\nproject documents or email chains. Familiarise yourself with the brief and\nconversations that have taken place so far.\n\n### Speak to the person who has had the most involvement in the work to date\n\nFind out who led the sales bid, or who has the most knowledge about the project\nat dxw. This should give you a fairly good understanding of what the project is,\nwhat work has been done so far and what dxw is expected to deliver. Find out\nwho’s who in the client organisation, and ask for an introduction to the main\npoint of contact.\n\n### Meet the client team\n\nAt the earliest opportunity, arrange a meeting with the client. It might be one\nperson at this stage or everyone that will be involved in the project. Use the\ntime to build rapport and get to know each other, as well as agree a start date\nand schedule any important meetings that need to be held in the first few weeks.\nIf you can, bring along other team members as it might be useful to have their\ninput.\n\n### Ask lots of questions\n\nWhether you’re talking to the person who led the sales bid, or the client team,\nask questions.\n\n* What is the brief? What outputs or outcomes are we expected to deliver?\n* Who is the service manager or product owner in the client team?\n* Who are the important stakeholders we need to be aware of?\n* Who from the client team will be working full-time on the project?\n* Are there any deadlines, dependencies or risks that the team need to be aware\n  of?\n* What skills and capabilities do the client team have? Are they used to working\n  in agile teams? Have they delivered a digital service before? Are they\n  familiar with user research?\n\n## Setting up the project\n\nBefore the project starts there’s also a number of tasks, mostly administrative\nones, that need to be done. Below is a checklist of things that need to be in\nplace for a typical project.\n\n* Send out calendar invitations for regular ceremonies:\n\n  * Standups - daily, 10-15 minutes between 10:00-11:00.\n  * Sprint planning meetings - fortnightly, for anything between 1-3 hours,\n    usually on the first day of a sprint (a Wednesday).\n  * Retrospectives - fortnightly, usually held at the end of a sprint or before\n    planning.\n  * Show and tells - fortnightly, at the end of a sprint for most projects. The\n    client can help you identify a suitable time and place (we recommend keeping\n    it to a regular time to maximise attendance).\n* Create a Slack channel and add dxw and client team members. Clients and\n  contractors should be set up as single-channel guests.\n* Create a Trello board for the project. Use the standard dxw columns or make up\n  your own, depending on the needs of the project and how the team want to work.\n* Create a Google Drive folder, under ‘Client work’ for the project. Use this to\n  store any documents, files, week notes and anything else that the team might\n  need access to. Make sure everyone in the team knows where to find it, and\n  give clients and contractors access to individual documents or sub-folders as\n  required.\n* Set up a video-call for standups so that anyone working remotely or from\n  another location can join. We like to use appear.in and talky.io.\n* Create a week notes document, using the template.\n* Organise a kick-off meeting with the client, either a few days before the\n  first sprint or on the first day. The whole team should attend this.\n* Check that commercial tasks have been done. It’s worth checking there’s a\n  signed order summary (this should be shared with you ahead of time) and this\n  matches the schedule in 10,000ft. Check invoices have been created in Xero and\n  you know where to find them. Also check 10,000ft early so you’re aware of any\n  upcoming holiday being taken by the team.\n* Create a spreadsheet to track days worked against the order summary. This will\n  show you how money is being spent against the forecasted budget, and help you\n  in any conversations with the client about team changes, extending the project\n  or issues with budget.\n\n## Kick off meeting\n\nWhile the project is being set up, and before it starts, a kick off should\nhappen. This ensures:\n\n* The team get introduced to each other & discuss and agree how they want to\n  work\n* The team and client know and understand what the work is all about\n* We realise our priorities so we have an initial plan\n* We discuss ways of working\n\nYou should have everyone working on the project in this meeting (even if they’re\npart-time).\n\n### Introductions\n\nUse the kick-off to introduce everyone to each other. It might be a good idea to\ngive team members a bit of advance notice about this, so that they can already\nthink and prepare their own intros tailored to this project.\n\nIt shouldn’t just be about people’s names, but roles and what each person will\nbe doing on the project. Some further ideas:\n\n* Highlight people’s experience and expertise, particularly if it’s going to\n  benefit the project or subject matter you’re working on\n* It is also important to say if any of the team members have worked on a\n  previous phase of the same project/product/service\n* Make sure to point out who is full time/part time or if there is any different\n  working pattern (such as compressed hours, any days they are not working,\n  etc…)\n* Prep the client about what the day will look like and set expectations. For\n  example who they should bring and what the agenda should be.\n\n### Get to a shared understanding of what the work and priorities are\n\nThere are a number of outcomes you should aim to get out of a kick-off. This is\nimportant especially if we are working with that client for the first time and\nthere are areas that are not very clear to us, or to them. You can structure a\nkick-off in the way that works best for you, but some frameworks that will help\nyou get the outcomes you need are below:\n\n* [Running a discovery kick-off workshop](/guides/running-a-discovery-kick-off-workshop)\n* [Running a roadmapping workshop](/guides/running-a-roadmapping-workshop)\n\nAim to reach a shared understanding of what’s desired and what’s possible. This\ncan be a Sprint goal, a high level vision, or going through the requirements and\ngetting clarity on each of these points. The scope is flexible, and it varies\nfrom project to project, but the main outcome is to make sure the team and the\nclient understand what will be done. You should:\n\n* Set the client’s expectations from the beginning, and help them understand\n  that there are trade-offs in every decision we take\n* Make sure the commercial paperwork is aligned to this discussion, and if there\n  are gaps or things that have been missed, bring that up, and go back to the\n  commercial team to inform of any changes. It timing works out, this type of\n  discussion is suitable for the delivery checkpoint forum that happens weekly\n  on Thursdays at 3.30. Gurps, our Commercial Manager, joins these.\n\n### Talk about dxw ways of working\n\nGive an overview of how dxw works. Don’t assume that everyone in the client team\nhas read the original proposal or visited the dxw website. Explain how we work:\n\n* agile mindset\n* culture\n* our approach to delivery\n* GDS Service Manual\n* sprint ceremonies\n* writing stories\n* story workflow (this is different from team to team)\n* the code review process (again might be different in each team, and it’s ok\n  for the team to define that in the first Sprint)\n* dxw days, that is 9 days in a 10 day sprint\n* invoicing and finances, we invoice the first day after the end of each sprint,\n  based on the number of days each specialist in the team worked. We might also\n  add travel costs, or research incentives, and other admin costs as per the\n  commercial agreement we have with the client\n\nIt is also important to mention that we work with roadmaps, which might change\nover time as we know more about the project. This is fundamental in an agile\nproject, so that we can react to change as quickly as possible. Therefore, we do\nhave plans, but they are not set in stone.\n\nTell the client that if, at any point, they have an issue with the way we are\nworking, or with any team member, the first point of contact for them is the dxw\nDelivery Lead. If the DL is the problem area or if they are a contractor, the\nDirector of Delivery is then the next point of contact.\n\n### Discuss how the team want to work\n\nClients will have their own way of working on projects and if they’ve used agile\napproaches before, it may be a different flavour of agile to what the dxw team\nare used to. Ask the client team to talk about how they’re used to working on\nprojects and agree some principles for how the single team will work together.\nFor example, do they typically follow the GDS Service Manual?\n\nExplain how most dxw teams work, and communicate to the client that we’ve done\nthis successfully with different clients over the years. However, be\naccommodating and suggest we “test and iterate” approaches. The retros are a\nperfect avenue to explore these.\n\nThere’s always something to discuss here. For example, how will week notes be\nwritten and who should they be sent to? Who needs to be invited to show and\ntells? How will user stories be written? Is there a story template the team want\nto use, and will developers estimate them?\n\n### Talk about co-location\n\nIf you’re going to be co-located with the client, ask to visit the office space\nand have a look around. Make sure that the team have access to the site (do they\nneed passes) and that you have space to work. This includes space to run sprint\nmeetings and show and tells. Work with the Commercial Operations team to order\nany equipment or things the team will need. It’s also worth agreeing which days\nwill be spent co-lo and which at dxw in this meeting. Take the teams working\npatterns into account.\n\nWhen the team are going to be in different locations, think about technology and\nhow to make sure each team member is able to join meetings and work with others.\nIt might be useful to buy some extra microphones, good headphones or additional\nscreens for the team. Chat to Olivia if you have any questions.\n\nCover the following tech for collaboration: Slack, Google drive, Trello, Miro\nboards, Google Hangouts or Go2Meeting, Calendars (team and personal).\n\n### Ensuring security from the start \n\n* We use the service standard from the outset of all projects we do, which includes security considerations. Project leads use this as prompts at the start and throughout projects, so security is considered as part of the process\n* Because our projects deliver into client systems (and public sector systems at that) rather than our own, we engage early with their information assurance/governance functions, so we can understand expectations about security and assurance\n* Majority of our delivered projects have undergone at least one pen test and round of remediations, with ongoing support arrangements usually requiring an annual check"},{"id":"show-and-tells","name":"Show and tells","content":"## What are they?\n\nShow and tells are regular meetings that we run at the end of each sprint to\ndemonstrate what we’ve been working on. They are an opportunity to get feedback,\nask questions and celebrate successes.\n\nShow and tells play an important role in raising awareness about what we’re\ndelivering and why; they help us make the work we do more transparent and open.\n\nA good presentation should tell a story about what you’re delivering - including\nwhy it’s important and how well it is going. It is often useful to recap some or\nall of the following:\n\n* What are the project goals?\n* Who is in the team?\n* How we work (agile, in sprints, multidisciplinary)\n* What did we achieve in the last sprint?\n* What has been the goal for this sprint? Why was this important?\n\nA common approach is to organise the presentation into themes/sections based on\nthe epics you’ve dealt with during the sprint. The main thing is to tell a story\nwith a logical flow that explains how decisions were made or identified\nrecommendations.\n\nYou can talk about challenges and things that haven’t gone so well, but be\nmindful of the client and the environment in which the project is. Sometimes a\nproject retrospective can be a better place to unpick these things.\n\n## Who should be invited\n\nThey are normally open to anyone who is interested in hearing about the project.\nInvite anyone who you think has an interest in your project, or who may make\ndecisions which impact it.\n\nOther dxw colleagues are welcome to join show and tells too; add the invite to\nthe dxw Show and Tell calendar so others can attend. If you want to join another\nproject’s show and tell, please let the delivery lead know so that they can make\narrangements if needed.\n\n## Who should present\n\nShow and tells are a great way to build presenting skills and to showcase\nexpertise and subject knowledge. We encourage the whole team to take part and if\nteam members are comfortable, get them to present their work. If people don’t\nfeel comfortable presenting then involve them in creating the slide deck.\n\nWe often work with clients as a single project team, so it can be a good idea to\nget the client Product Owner to co-present with you. This can help build trust\nwith people outside the project team, and can help you raise the profile of the\nwork.\n\n## Preparing and running your show and tell\n\nPut in some preparation to make sure that the show and tell goes smoothly -\nespecially if you want to share presenting duties with the wider team.\n\nDepending on the nature of the work you’re doing, you might want to spend up to\nhalf a day preparing the presentation. This can be a good opportunity for the\nteam to unpick some of the challenges or complexities that you’re dealing with.\n\nHowever, this amount of preparation may not be required, for example, if the\nwork is quite straightforward or if the team has been together long enough to\nfind its rhythm.\n\nOther preparation to do:\n\n* Send out invites and book a space. Include a link for those dialling in.\n* Get there early and make sure that the space is set up properly. Does the\n  screen work and can people dial in? If you need them, dxw have microphones and\n  cameras that you can use.\n* Make sure you can record the session - we normally record and share them via\n  YouTube.\n\nDuring your presentation make sure that you:\n\n* Introduce the team (get each person who’s speaking to introduce themselves,\n  including their role)\n* Show the work (demos, videos) where possible. Seeing an actual thing is more\n  powerful than a screenshot.\n* Leave time for questions and feedback. Capture things that people raise that\n  you want to revisit later on.\n* Avoid jargon and explain technical terms. Your audience might not know much\n  about the project or about how we work. It’s important to provide your\n  audience with context.\n* Avoid just giving a detailed itemised list of everything that’s happened in\n  the last 2 weeks.\n* Check in with remote participants to ensure that they can hear and are able to\n  follow the discussion.\n\n## Examples of show and tells\n\n* [Southwark Council discovery final show & tell](https://docs.google.com/presentation/d/1zOX1Kfe_SVzf5fnIANroXPhgUlOd6gEtatg2kJkMVc0/edit#slide=id.g5fe190064c_6_403)"},{"id":"sprint-planning","name":"Sprint Planning","content":"## What is it?\n\nSprint planning meetings take place at the start of every sprint. They are used\nby the team to agree what work to deliver for that given sprint.\n\nThey are an opportunity to reflect on the project’s goals and roadmap, and to\nprioritise the most valuable work that pushes the project forward. They should\ngive the team clarity about what they need to focus on and why. They can help\nbuild consensus about the direction the team and project are going in. They\ntypically last about an hour.\n\n## Who should be invited?\n\nSprint planning should involve everyone in the delivery team - this should\nusually include dxw and the client teams together. This is important as it helps\nestablish a close working team with a shared understanding of what’s important.\n\n## Preparation\n\nA well run sprint planning session takes some preparation. Investing the time up\nfront will help your team be clear on what they need to focus on.\n\n* **Think about the priorities for the sprint.** Review your project’s goals and\n  roadmap - what is the most important thing you need to do?\n* **Speak to members of the team.** Get input from the product manager, the tech\n  lead and others to get their thoughts on what’s important.\n* **Clean up the backlog.** Update tickets from the previous sprint as best as\n  you can, and make sure things are in the right columns. Make it clear what the\n  priority tickets are for this sprint, for example by putting them to the top\n  of your backlog.\n\n## During the meeting\n\nHave a facilitator for the meeting - usually the product manager or delivery\nlead. As a team:\n\n* Review the project board from right to left, to see what’s been shipped in the\n  last sprint and to see what’s still in progress\n* Review the backlog in priority order (i.e. top to bottom). For each ticket go\n  through the title and description.\n\n  * If the ticket isn’t clear then reword it so that everyone understands what’s\n    required.\n  * Assign it to a person or discipline in the team\n* Break down bigger tickets into smaller ones if needed\n* Identify dependencies (dependency label where something is going to be\n  blocked)\n* Gauge as team whether the work is realistic and achievable; revisit what\n  you’re committing to until it does.\n* Identify opportunities for pairing/ knowledge transfer\n\nOnce you have a prioritised set of work for the sprint that the team are happy\nwith, people should refer back to this on a daily basis to pick up work. You can\nuse it in daily standups to track progess. If you get a sense that the scope is\ncreeping or the team doesn’t have the skills or the size you need, then do\nsomething to address this.\n\n## Project boards and tickets\n\nWe typically use [Trello](https://trello.com) to create project/product\nroadmaps, as well as sprint boards. Clients occasionally have other similar\nservices in place, such as [Jira](https://www.atlassian.com/software/jira).\n\nCreating tickets in the right way helps the team be clear on what they need to\ndo. Below are some tips for writing good tickets.\n\n* Have one ‘thing’ per card, and make it the smallest possible thing. This helps\n  create a sense of momentum.\n* Identify dependencies - including things that the ticket impacts, as well as\n  things that it will rely on\n* Write the ticket in a way that helps someone in the team pick it up and work\n  on it\n* Connect the ticket back to a need - e.g. a user need or a project goal. Is it\n  clear why this work is important? How will you know it’s done the job it needs\n  to?\n\nGenerally, try to avoid:\n\n* Getting into the weeds on how the ticket will be implemented\n* Planning too far ahead - keep the length of the project in mind, but in sprint\n  planning focus primarily on the next fortnight\n* Getting into retrospective territory"},{"id":"support-and-on-call","name":"Support and on call","content":"We have agreed service levels for each client we provide support for. Our\nstandard terms, including prioritisation definitions and response times, are\ndetailed in our\n[Service Level Agreement](https://contracts.dxw.com/service_level_agreement.md).\n\nWith our default support plan we manage all code, maintenance, updates, and\nuptime monitoring and provide security event monitoring intended to detect and\nprevent attacks. Users can also use our helpdesk service to ask for help with\ntheir service as [documented in the main playbook](/#supporting-services).\n\nWe provide support for clients and users of these services in three ways:\n\n* Clients can raise a **ticket** with us to fix a problem or make a change to a\n  site we support.\n* We do proactive **maintenance** for our clients' services, for example by\n  applying security updates.\n* We have monitoring systems for our services that continually check whether\n  they are operating correctly, and whether there are any warning signs of\n  problems. When problems are detected they raise an **alert** for the team to\n  investigate and resolve.\n\nThat support is handled by the team in two ways:\n\n* We provide in-hours (10:00 – 18:00) support for all our clients, resolving\n  tickets and alerts and doing maintenance. We call this\n  [first line support](#being-on-first-line-support), and it's staffed by a\n  developer and an operations engineer\n  [on a rota](#support-scheduling-and-the-rota).\n* We provide out-of-hours (24/7) support for some of our clients, responding\n  only to critical alerts and emergency tickets. We call this\n  [on call](#being-on-call), and it's staffed by a developer or an operations\n  engineer through a separate opt-in rota, with additional compensation.\n\nBeing able to do support effectively requires access to our production systems,\nso you won't be added to the support rotas until you've completed your vetting.\nYou might shadow someone else on support before your vetting is completed.\n\n## Being on first line support\n\nSupport tickets come in from clients and users every day. These tickets could\nrelate to any of the products we currently support. Tickets could be about any\naspect of the service, from a production outage to a typo, or something that\nturns out to be a request for more development work from a client.\n\n### Which things are my responsibility when I am on first line support?\n\nWhile on support, your focus is on monitoring incoming alerts and tickets,\nresponding to them or delegating to colleagues as appropriate.\n\n#### Alerts\n\nWe use monitoring and alerts to notify you when an issue occurs, and provide\n[runbooks](https://git.govpress.com/ops/docs) to help you respond to events and\nrestore service for our clients.\n\n#### Tickets\n\nYou're responsible for managing new tickets that come in. That means doing some\ninitial triage to identify what kind of work is needed, tagging the ticket with\nthe right project information, and ensuring that SLAs are not being breached.\n\nYou'll also be expected to check any existing tickets which have breached (or\nwill soon breach) their SLA, trying to resolve those effectively.\n\n##### Decide what to work on\n\nPeople on support are free to work on whichever tickets they are assigned to and\nthink is most important. But there are some important things to bear in mind:\n\n* Triage\n\n  We all have limited time. We try to spend it wisely. All other things being\n  equal, it is better to spend half an hour solving each of four tickets than to\n  spend two hours on one issue.\n* Priority\n\n  The priority of tickets is important, and we must be biased towards dealing\n  with more urgent tickets before less urgent ones. Each ticket's priority\n  should be reviewed regularly: whenever we update a ticket, we check the\n  priority to make sure it's still right.\n* Time since last response\n\n  Our clients expect to be kept in the loop. If a ticket hasn't had any activity\n  for a while, it might be a sign that it needs following up on. This might mean\n  taking over where another person on support left off.\n\n###### What to do when there are no tickets\n\nWhilst you're on support, you are a member of the dxw Technical Operations team.\nWhen there aren't tickets that need your attention, you should look for ways to\nmake managing and providing support more effective and efficient. That could\ninclude improving documentation in the runbook for an issue you've worked on or\nfixing the root cause of common alerts.\n\nThe team might have work ready in a backlog to develop new tooling to help with\nmanaging or providing support, or to automate tasks that happen relatively\noften. Beyond this, pairing with other members of the Technical Operations team\nis a great way to share knowledge across the technical team as a whole.\n\n##### Replicate the bug\n\nIf the issue is a bug, we replicate the behaviour the client has reported before\nworking on a fix. It's important that we can reliably and repeatably create the\nconditions necessary for the bug to arise before we start working on it. If we\ndon't do this, we can't tell whether we've fixed the problem. If we don't have\nenough information to do this, we ask the client to provide it before\ncontinuing.\n\n###### Ensure the client has understood and approved the change\n\nWhen presented with a problem, clients don't always ask us to do the most\nappropriate thing to fix it. Sometimes we can think of a better solution.\nSometimes the change the client asks for has some implication that they haven't\nconsidered.\n\nOur helpdesk service is advisory, so we're not afraid to suggest alternative\napproaches and ideas if we have them - including where there's a better\nsolution, but [at a cost](#charging-for-ticket-work). We give options whenever\nwe can.\n\n##### Pay attention to scope\n\nClients can use the support service to ask for help with any aspect of the\nservice we provide, including help with using the admin panel and advice on\ngetting the best out of their site. But there are some limitations. Under the\nsupport service, we do not:\n\n* add any new functionality requiring anything beyond extremely trivial\n  development or plugin integration\n* alter the source code of a plugin or library maintained by a third party\n* do things that the client can do for themselves, letting them know how to do\n  it themselves instead\n* other than by prior arrangement, communicate on the client's behalf with the\n  operators of third-party services that the site uses\n\nFrom time to time, we may make an exception to these restrictions. If you think\nthat might be appropriate, ask the account manager for the client.\n\n###### Charging for ticket work\n\nIf you decide that a ticket asks for work to be done which falls outside the\nscope for support, then the work is chargeable. In this situation, we reassign\nthe ticket to the account manager with an explanation of why the work is\nchargeable and a rough idea of how much work the client is asking for.\n\nIt is good to try to think of alternative approaches that we could do under our\nsupport service before taking this step - seek advice if you're unsure.\n\nThe person you assign the ticket to will then treat it as a [lead](/#sales), and\ncontact the client to make a plan.\n\n### Impact on your other work\n\nDuring your week on support, you won't be participating in the sprint for your\ncurrent project team. That means that whilst the project will continue as\nnormal, your work on your current project will pause whilst you're on support.\n\nSupport weeks will start on Wednesdays and finish on Tuesdays, so that they fit\ninto our existing sprint cycle. That enables you and your team to plan around\nthe half-sprint you'll be on support, and you'll have the context to rejoin your\nproject for the other half of the sprint.\n\n#### Recruitment\n\nIt's important that you're only involved in meetings that you can practically\nleave if a support issue arises. That means that you can participate in things\nlike CV sifting, but you shouldn't be part of interview panels or worksim teams.\n\n#### Sales\n\nAs with recruitment, the important thing is that you can practically leave any\nmeetings if something urgent crops up. That means you can be as involved as you\nwould usually be in things like writing 100 word responses to sales\nopportunities, giving your input to qualification work, or helping put together\nproposals and pitch decks, but you shouldn't commit to being part of a pitch\nteam.\n\n#### dxw time\n\nYou can still participate in dxw time work whilst you're on support, but you'll\nneed to make sure anyone you're working with knows that you might need to stop\nworking on a project to handle support queries. You might want to choose smaller\nthings when you're on support, so that you don't end up overcommitted.\n\n### Support scheduling and the rota\n\nIn order to support our clients, we ensure there is always a developer dedicated\nto working on support, and that the responsibility cycles around every developer\nat dxw. [There's a rota](https://github.com/dxw/support-rota) which is set at\nleast three months in advance, which is also reflected in 10,000ft.\n\n#### Scheduling around client work\n\nEach week, in the regular scheduling meeting, we look at the upcoming schedule\nfor the rota and look to see if there are any developers not already scheduled\non to client work. If there's a viable change to the rota that will allow us to\ncontinue billing clients for our time, we'll make it.\n\nAny change we make will be made with at least one week of notice. We will update\nthe rota and send an email to the individuals and teams affected.\n\nIf there are multiple developers not on client work, we'll try to spread the\nweeks between all of them, but otherwise, some developers may be asked to do\nmultiple weeks in a row.\n\nIf you have a good reason to need a change but are unable to arrange one, then\nwe'll make sure we can accommodate the change. A good reason might be if you\nhave a service assessment and the named developer is participating. Having lots\nof work on the backlog won't usually be a valid reason. Some notice for changes\nlike this is important, ideally of at least a couple of weeks.\n\n#### Scheduling around out of office time\n\nThe developers affected are encouraged and expected to trade slots in the rota\nto accommodate known or planned absences from work.\n\nIf you need to change your slot, find a slot in the rota that you are able to\ndo, and talk to your delivery lead, the person you'll swap with, and their\ndelivery lead, to ensure that the swap makes sense for both of you and your\nprojects.\n\n## Being on call\n\nBeing on call means you are the first line support for issues that occur out of\nhours. This sometimes means getting woken up or handling things at weekends. As\na result, it's optional, and people who spend time on call will be compensated\nfor the time. Let the Head of Technical Operations know if you'd like to be\nadded to the on call rota.\n\nWhile on call, your responsibility is making sure all the services we support\nare running correctly and effectively.\n\nAs with in-hours support, we use monitoring and alerts to notify you when an\nissue occurs via Opsgenie, and provide\n[runbooks](https://git.govpress.com/ops/docs) to help you respond to those\nissues. The difference to in-hours support is that you'll only be alerted when a\nhigh-severity issue occurs, and you aren't expected to take any action out of\nhours unless alerted.\n\nOutside office hours, the expected response depends on the severity of the\nincident. We have a set of factors that determine the severity of an incident,\nand have included these in our\n[Service Level Agreement](https://contracts.dxw.com/service_level_agreement.md).\n\n### On call escalation\n\nWhile you are on call there is also a second line on call rota formed of senior\nmembers of the technical operations team and the CTO. Opsgenie will alert them\nif you do not acknowledge an alert within 5 minutes. This is to make sure that\nalerts are dealt with in a timely manner. You should not feel bad about missing\nan Opsgenie alert. This is one of the reasons why we have the second line rota.\n\nYou can also use Opsgenie to escalate an alert to them if you are unsure what to\ndo, lack access, or need a hand in general. If it is a major incident you may\nwant to escalate so that they can deal with client communications. If the person\non the second line rota does not respond feel free to escalate the alert to the\nHead of Technical Operations or the CTO to help you. You should also feel free\nto contact other members of the team if the incident is serious enough and you\nhave discussed it with the person you have escalated to.\n\nTo escalate to people not on the current rota, create an alert on Opsgenie with\nthe `Default API` (not the `ops_team api`) and add them as a responder.\n\n### Claiming TOIL for out of hours alerts\n\nIf you are alerted out of hours you can claim Time Off in Lieu (TOIL) in\nBreatheHR.\n\n* For alerts while you are awake you can claim 0.25 days of TOIL.\n* For alerts which wake you up you can claim 0.5 days of TOIL.\n\nIf you have to work more than an hour fixing an alert, you can claim extra TOIL\nat 0.25 days per hour.\n\nIf you receive multiple alerts within an hour of the first one you receive they\ndo not count as an extra alert for claiming TOIL. For example, if you receive 4\nalerts for different issues in the space of 10 minutes you can only claim 0.25\ndays TOIL and not 1 day of TOIL. If after an hour you receive another alert,\nthat is when you can claim again.\n\nIf you have been woken up by an alert you are not expected to start work at your\nnormal time. Let your delivery lead or line manager know via a Slack message if\npossible.\n\nIf you feel that you need a rest from being on call out of hours after a\ndisrupted night of sleep please talk to the Head of Technical Operations or the\nCTO who will find a replacement for that night."},{"id":"team-changes-and-handovers","name":"Team changes and handovers","content":"Projects inevitably undergo team member changes. This can be for a number of\nreasons. If a project has been running for a long time, it is often beneficial\nto introduce some new ideas to the team, and to give incumbent team members a\nchance to experience, and be challenged by, something different. Alternatively,\nthe scope of the project might change, requiring a different set of skills to\nthose provided by the existing team. It's normal that changes need to happen.\nWhatever the reason, it's critical that we ensure personnel changes and\nhandovers:\n\n* maintain the momentum of the team and the project\n* are handled efficiently and with clarity\n* are well understood and agreed to by the individual, the client, and the team\n* ensure an effective transfer of knowledge\n* work well in the context of other ongoing dxw projects\n\nThe following guidance is intended to outline the standard steps that can be\ntaken by anyone moving to a new project.\n\n## People joining and leaving projects\n\n### Before the change\n\n#### Speak with your new delivery lead\n\nYour new delivery lead should arrange a catch up before you start work on the\nnew project. They should be able to answer any questions you have, as well as\nproviding the key details and useful contextual information about the project.\nThey should also make clear to you what the expectations for you working on the\nproject are.\n\n#### Do some reading\n\nIf you are going to be moving on to a new project, do as much reading as you can\nbeforehand, particularly week notes and Trello. Exploring the project folder on\nGoogle Drive is also a good place to start. This will help you in familiarising\nyourself with the project.\n\n### During the change\n\n#### Meet with the team\n\nSome of the team you'll have likely worked with before, but there may be others\nyou haven't. The sooner this happens the better. Take the time to speak with\neveryone in the team to understand what they are working on. The delivery lead\nwill have confirmed any personnel changes with the team. The delivery lead\nshould also confirm to the organisation about the team member change.\n\n#### Familiarise yourself with how the current project is set up\n\nYou can speak with the delivery lead (or outgoing delivery lead if relevant) to\nunderstand which ceremonies happen and when. You should also make sure you know\nof any particular arrangements the team have, for example, remote working\narrangements, the working patterns of team members and so on. Make sure you're\nclear on what the client expectations are for this. Your delivery lead should\nensure you are added to all the relevant calendar invites.\n\n#### Meet the client\n\nAs you're onboarded to the new project, you should be introduced to whoever the\nclient representatives are. It's important they know who you are and what role\nyou do. How formal this process needs to be will depend on the nature of the\nproject.\n\n### After the change\n\n#### Catch up with your line manager\n\nMoving to a new project can be challenging. Take the opportunity to catch up\nwith your line manager to make sure it's gone well and that you're happy with\nthe change.\n\n## When a member of your sprint team is going onto support\n\nIn order to support our clients, we ensure there is always a developer dedicated\nto working on support, and that the responsibility cycles around every developer\nat dxw. This has implications for project sprints and client work, which\ndelivery leads will need to manage.\n\nDuring a developer's time on support, they won't be participating in the sprint\nfor their current project team. That means that whilst the project should\ncontinue as normal, their work on your current project will pause whilst they\nare on support.\n\n[There's a rota](https://github.com/dxw/support-rota) which is set at least\nthree months in advance. The rota is also (eventually) automatically reflected\nin 10,000ft. The support week runs from Wednesday to Tuesday to align with our\nstandard sprint cycles.\n\nSee the [support guide](/guides/support-and-on-call) for more details on how\nsupport scheduling works, and how you can feed into that."},{"id":"tech-team-promotion-process","name":"Technology team promotion process","content":"This policy applies to ad-hoc promotions for roles corresponding to SFIA 1-5\nonly. For gaps we identify in the team, one-off roles, or more senior roles\n(SFIA 6-7), we use a different process, often involving internal or external\nrecruitment.\n\nThe process is based on\n[our progression framework](https://dxw.progressionapp.com/technology) and\ndesigned to help make fair decisions about promotions that reduce the impact any\none person can have on the decision as much as possible. You will be promoted if\na panel from across dxw and your Head of Discipline agree you are currently able\nor will soon be able to do the activities described by the framework for the\nrole you are moving into.\n\nAre you here as a panelist? [Skip ahead to the section for you!](#for-panelists)\n\n## For applicants\n\n### Summary\n\n1. You express an interest in being promoted\n2. The directors decide if there is scope for accepting promotions of that kind\n   from a business perspective\n3. An application deadline is set\n4. You gather evidence into a promotion pack (supported by your line manager)\n5. You submit the promotion pack for review by a promotion panel\n6. Panelists review your pack independently\n7. The panel meets to discuss your application and make a strong recommendation\n   on whether to approve it or not\n8. A decision is made\n9. The decision is shared with you with feedback\n\n### Eligibility\n\nAnyone can apply for a promotion at any time, provided you have completed\nprobation. While it’s helpful and strongly recommended, you do not need your\nline manager’s agreement.\n\nThere is no limit to the frequency of promotions you are allowed to apply for.\n\n### Expression of interest\n\nYou can express your interest in going up for promotion by talking to your line\nmanager and Head of Discipline. Do this before you start preparing your\napplication.\n\nYour Head of Discipline then considers your readiness for promotion based on\ntheir current information and a conversation with your line manager, so they can\nhelp set expectations with you for the result, but they are not allowed to\nprevent you from applying.\n\n### Directors’ review\n\nYour Head of Discipline works with the directors to decide if there is scope for\na role change of this kind. The task here is to consider the business\nimplications of a possible promotion, not to decide whether or not you deserve\nthe promotion. They consider things like the cost and team structure\nimplications and make a decision about whether or not to accept applications.\n\nPossible decisions are:\n\n* Promotions would be accepted, with immediate effect\n* Promotions would be accepted, but at a future specified date\n* Promotions would not be accepted, but may become available within the next\n  year\n* Promotions would not be accepted, and are unlikely to become available within\n  the next year\n\nIf promotions would be accepted, they also decide on an upper limit on the\nnumber of promotions to that role that could be accommodated.\n\nThe Head of Discipline and directors must make their decision **within 4 weeks\nof the request being raised with them**.\n\n### Opening applications\n\nOnce the directors have made a decision, your Head of Discipline lets you and\nyour line manager know what it is.\n\nYour Head of Discipline sets a **deadline for applications to be submitted by,\nbetween 4 weeks and 8 weeks after the date of the directors’ decision** to give\nyou time to prepare your promotion pack.\n\nIf the decision is that promotions are possible, but there is only one position\navailable, your Head of Discipline informs anyone else eligible for a promotion\nto the same role and invites them to apply for the position. For this, a person\nis notified if they are currently at the level below in the discipline.\n\n### Creating the promotion pack\n\nYou put together a promotion pack from one of\n[the templates](https://drive.google.com/drive/folders/1q4idxObiYhqOAWuzudFQcGAk_70yZk-I)\nexplaining why you feel you are ready for a promotion. This pack includes a\nshort personal statement on why you feel you should receive a promotion, a\nstatement from your line manager on the same topic, and evidence to demonstrate\nwhy you would meet the needs of the role you would be promoted into. Good\nevidence for this might include:\n\n* evidence of you doing the things described with how they went\n* feedback from people you have worked with or clients that demonstrate your\n  ability to do the things described\n* evidence of similar activities that give you and your line manager confidence\n  you are ready to take on the responsibilities of the role\n\nMake sure you address all of the needs of the level and don’t leave any gaps.\nIt’s ok to acknowledge that you don’t have direct experience of something in the\nframework. It’s better to do that than have the panel spend time working out if\nyou do or not and run out of time to properly consider your strengths.\n\nYou should involve your line manager in the process, but they are not allowed to\nblock your promotion. They should support you with developing your promotion\npack, but you can put yourself forwards for promotion without your line\nmanager’s support.\n\nIf you are reading this thinking about a future promotion, you might want to\nconsider keeping a [brag document](https://jvns.ca/blog/brag-documents/) or\nusing the Wins feature of Progression to keep track of evidence you might want\nto use in the future.\n\n### Submitting the application\n\nEmail a link to your promotion pack to a member of the HR team, your Head of\nDiscipline and your line manager. You need to also transfer ownership of any\ndocuments to a member of the HR team so it can go into your file and make sure\nyour Head of Discipline has access to modify sharing settings so they can share\nit with panelists.\n\nWhile optional, it’s recommended that you share the pack with your Head of\nDiscipline at least a week in advance of the application deadline so they can do\na pre-check and make suggestions based on their experience reviewing other\npromotions, such as places where you could provide more detail.\n\n### Promotion panel\n\nWhile you create your promotion pack, your Head of Discipline decides on an\nappropriate panel to review your application.\n\nA panel is made up of:\n\n* someone from your discipline at least as senior as the role you are applying\n  for, if possible\n* your Head of Discipline (unless they are your line manager)\n* another member of the technology leadership team (Head of Development, Head of\n  Technical Operations, and Technical Architects)\n* two Heads of Discipline, Principals, or Leads from outside the technology team\n\nThe panel must not include your line manager, buddy, or anyone in a close\npersonal relationship with you to avoid conflicts of interest. This includes\npeople who would consider you a friend as well as a colleague.\n\nYour Head of Discipline appoints one member of the panel (not necessarily the\nmost senior person and not your Head of Discipline) as the lead. It is their\nresponsibility to organize the review process, run the joint panel, and make\nsure your application is properly considered.\n\nYour promotion panel must meet **between 1 and 2 weeks after the application\ndeadline** to be able to give you a timely decision and response while also\nconsidering your application properly.\n\nIf there is more than one applicant for a single promotion opportunity, the\npanel must be different for each applicant. Some overlap between panels is ok if\nnecessary, but should be avoided if possible.\n\n### Review process\n\n#### Independent review\n\n**At least 1 week before the panel meets**, the lead panelist creates a review\nform from\n[a template](https://drive.google.com/drive/folders/1q4idxObiYhqOAWuzudFQcGAk_70yZk-I),\ntransfers ownership of it to a member of the HR team for filing, and sends it\nwith your promotion pack to each member of the panel.\n\nThe panelists then individually review the application without conferring with\neach other and score against each of the criteria in the progression framework.\nThey use a scale of 1 to 5 where:\n\n* 1 means you have a lot to improve before being able to work at the level you\n  are applying for\n* 3 means you are working at or are capable of working at the level you are\n  applying for\n* 5 means you are already working at or are capable of working at a level more\n  senior level than the one you are applying for\n\nEach score given must be accompanied by a few lines of reasoning. This helps\nmake sure the scores can be reviewed for objectivity. The average of all of your\nscores for each criteria are shared with you as part of your feedback, but not\nindividual scores or their reasoning verbatim to enable panelists to be open and\nhonest.\n\nA panel member can choose to abstain from scoring a specific criteria if they\nbelieve they are unable to evaluate it due to a lack of their own expertise.\n\nPanelists should set aside 2 hours to do this for each candidate they are\nreviewing.\n\n**Individual panelists must complete the form at least 24 hours before they are\ndue to meet.**\n\nThe panel meeting may be pushed back or an alternative panelist may be found if\ncollecting all of their scores by this deadline is impossible due to unexpected\nabsence.\n\n#### Joint review\n\nThe full panel meets to discuss the application in the afternoon (to allow for\nchasing any late submitters) **between 1 and 2 weeks after the application\ndeadline**. The purpose of the meeting is for the panel to make a strong\nrecommendation to your Head of Discipline on whether or not to accept your\napplication.\n\nThe panel meeting should not last more than 1 hour for a single candidate.\n\nDuring the meeting, one of the panelists documents the discussion and any new\nscores to be shared at the end with your Head of Discipline.\n\n### Decision\n\nYour Head of Discipline considers the panel’s recommendation along with the\nwider business context. They can choose to override the recommendation, but if\nthey do, they must explain and justify that decision to the panel. If panelist\nbelieves it to be insufficient justification, they should inform the directors\nwho make the final decision.\n\n### Feedback\n\nWhether your application is approved or rejected, your Head of Discipline\ndelivers written feedback at the end of the process. That feedback is based on\nthe discussions in the promotion panel and the independent reviews, and includes\nthe average scores from the individual scoring as well as the final scores\ndecided by the joint panel including where they could not agree.\n\nYour Head of Discipline shares this feedback with you, your line manager, the\npanelists and the HR team.\n\n### Appeals\n\nIf you believe you have not been treated fairly through this process, you can\nappeal the decision. To appeal a decision, you should raise it in writing to the\nManaging Director, copying in a member of the HR team. They then investigate the\nreview process for your application and organize a meeting with you to discuss\ntheir findings. You may bring a colleague or a trade union representative with\nyou to that meeting. After the meeting, the Managing Director makes a final\ndecision about any further actions and shares it with you in writing.\n\n## For panelists\n\n### Expectations of panelists\n\nAs a panelist, you are taking on a lot of responsibility. Your actions and\ndecisions have a material impact on the applicant you are evaluating and have\npotentially far reaching consequences.\n\nThis process asks two things of you:\n\n* 1 hour of your time to meet with the rest of the panel to discuss the\n  application\n* 2 hours in the week leading up to that meeting to evaluate the application\n  independently\n\nYou should make sure that time is protected and is your highest priority, so you\ngive the person you’re deciding the fate of your full attention and\nconsideration. If you don’t think you can do that, you should let the panel\nselectors know before accepting the role.\n\nTo avoid conflicts of interest, you must also not be the applicant’s line\nmanager, buddy, or have a close personal relationship with them, including a\nfriendship relationship.\n\nIf you agree to be a lead panelist, you also need to facilitate the review\nprocess. You should expect to spend an additional 1-2 hours organizing and\npreparing for the reviews on top of the time for you to contribute to it.\n\n### Instructions for lead panelists\n\nOnce you have accepted the position as lead panelist:\n\n1. Ask the Head of Discipline for the names of the other panelists and the\n   application deadline.\n2. Set up an application deadline calendar event at 16:00 on the deadline,\n   inviting the applicant, their line manager, and their Head of Discipline.\n   This is the date by which the applicant must submit their promotion pack by\n   email to a member of the HR team, their Head of Discipline, and their line\n   manager. Include the\n   [instructions on how to submit the application](#submitting-the-application)\n   described in the process above in the event description.\n3. Set up a joint review with all of the panelists. This review must be between\n   7 and 14 days after the application deadline. It should be a 1 hour event in\n   the afternoon. You will want to set this up as soon as possible to hold the\n   time for all of the panelists.\n4. Set up an independent review deadline calendar event exactly 24 hours before\n   the start of the joint review, inviting all of the panelists.\n5. After the application deadline, ask the Head of Discipline to share the\n   promotion pack with you and the other panelists in read-only mode.\n6. Create the independent review form from\n   [the appropriate template](https://drive.google.com/drive/folders/1q4idxObiYhqOAWuzudFQcGAk_70yZk-I)\n   and invite the panelists (including yourself) to complete it by the review\n   deadline.\n7. Don’t look at any other submissions until you have done your own.\n8. Make sure you have received all independent reviews by the deadline\n   (including your own). If you don’t have all the reviews by that time, talk to\n   the Head of Discipline or a director about getting the missing reviews as\n   soon as possible.\n9. Prepare a slide deck from\n   [the template](https://docs.google.com/presentation/d/1ZqwIaVkFDXnY7ifGS3Kp3ZQQvvKF0IapPhnbUGDoQZQ/edit),\n   documenting the results of the independent review. It’s useful to include the\n   graphs. You should organize the criteria for discussion in the following\n   order:\n\n   1. Criteria where some scores are 3 or above and some are 2 or below.\n      Prioritize criteria with the highest variance in scores.\n   2. Criteria where all of the scores are 2 or below.\n   3. Criteria where all of the scores are 3 or above. There is usually no need\n      to discuss these criteria, but start with the ones with the highest\n      variance in scores.\n10. Ask one of the other panelists to take notes during the meeting in a document\n    shared with all panelists.\n11. Facilitate the joint review discussion, sharing the slide deck you prepared.\n\n    1. The first task is to gather consensus on criteria where panelists\n       disagreed in their independent reviews. Invite panelists to talk about\n       their scores and why they gave them, then discuss the evidence and\n       criteria. When ready to move on, simultaneously vote on new scores and\n       record the individual votes. This will take up the bulk of the time, but\n       be prepared to move the panel on if they seem unable to reach consensus.\n       It’s important for the panel to discuss all of the criteria with\n       disagreement, so plan how long to allow on each one in advance.\n    2. The second task is to identify whether or not any criteria now scoring 2\n       or below is sufficient to disqualify the applicant. It’s unusual to\n       approve a promotion for someone with 2 or more criteria in this category.\n       This can be useful to consider if you are struggling to reach consensus on\n       a few criteria with 20 minutes remaining and need something to break the\n       tie.\n    3. The third task is to generate a recommendation for whether or not to\n       accept the application for promotion. Simultaneously vote and record the\n       individual votes. Everyone must cast a vote here. There is no abstention.\n       Allow at least 10 minutes at the end for this step.\n12. Share the new scores and notes from the session with the Head of Discipline.\n13. That’s it. You’re done. Thank you for your help!\n\nPlease keep the Head of Discipline informed as you work through this process!"},{"id":"tone-of-voice","name":"Tone of voice","content":"This is an overview of how we write and should apply to all the writing we do in\ndxw. It’s an important part of how we present ourselves to the outside world,\nalongside our new dxw brand. You can find the brand guidelines and all the\nassets you need in our brand toolkit in the\n[\\#dxw-brand](https://dxw.slack.com/archives/C013ZEQ8XEW) Slack channel.\n\nOur tone of voice is important because it will have a big influence on how\nsomeone reading our content will feel.  This isn’t a set of rules as good\nwriting shouldn’t feel like a tick-box exercise.\n\nWe want people who work in the public and third sectors to benefit from our\napproach and what we learn through working with them. So it’s important that\nwe’re as open and transparent as possible when we communicate. Even better if\nthat persuades others to follow our example.\n\nWe want our readers to feel that:\n\n* they can trust us\n* we care\n* we have lots of experience\n* we’re open and transparent about our work\n\nThere’s lots of good practice guidance in these\n[Readability Guidelines](https://readabilityguidelines.co.uk/) by Content Design\nLondon. To help with readability, it’s also a good idea to use something like\nthe [Hemingway app](http://www.hemingwayapp.com/) which can help you improve\nyour writing. But remember it’s just a guide.\n\n## Overall tone of voice\n\nOur [values](/#values) should guide how we do things, and how we communicate. \nSo our writing should show dxw as:\n\n* helpful - we explain our work openly and clearly\n* positive - with a focus on how we helped others and what we learned\n* reliable - we don’t use superlatives but we show that we do consistently good\n  work that we’re proud of\n* honest  - we’re open about what we think and our work, including where we got\n  things wrong\n* curious - and willing to try new things and improve. As well as helping others\n  to do the same\n* determined - and motivated to tackle difficult things and have high standards\n\nWe should aim to show our audience the value of our work, not just tell them\nabout it. That might mean showing things like screenshots or video footage of\nservices, outputs or pictures from user research sessions and so on.\n\n## No need for formality\n\nWe work with organisations but we should write for the people who work in those\norganisations or use their services. That means using the words that real people\nuse.\n\nThink about what you’ve written and whether it’s something you would say out\nloud. If not, then it’s worth changing your language to sound more\napproachable - more like you.\n\nWe also use contractions so we’ll say “we don’t” rather than “we do not” and\n“I’ll” instead of “I will”.\n\nUse numericals for numbers rather than writing them out so “we built 2\nprototypes” rather than “we built two prototypes”.\n\nSome other suggestions to sound less formal:\n\n* swap “commence” for “start”\n* swap “enable” for “let”\n* swap “ensure” for “make sure”\n* swap “key” for “important/significant/essential”\n* swap “in order to” for “to”\n* swap “utilise” for “use”\n\nAlways think about the most straightforward way of saying something. The\n[GOV.UK style guide](https://www.gov.uk/guidance/style-guide/a-to-z-of-gov-uk-style)\nprovides some helpful examples of words you might want to avoid.\n\nCapitalise specific names for a person, place or thing, words at the beginning\nof sentences, and (if appropriate) abbreviations but nothing else. That includes\nheaders.\n\n## (Not) by monkeys\n\nYour writing will be more readable if you use active sentences rather than\npassive ones.\n\nFor example, “a decision was made to change the name of the service” is passive.\n“We decided to change the name of the service” is active and also uses fewer\nwords.\n\nA good way to check if you’ve used passive language is to add  “by monkeys” to\nthe end of the sentence. It won’t make sense if the sentence is active. We’ve\nborrowed this from\n[Monzo’s tone of voice guidance](https://monzo.com/tone-of-voice/).\n\n## The shorter the better\n\nShorter sentences are quicker for people to read and easier to understand.\nEveryone’s busy so there’s no need to write a 30 word sentence if you can say it\nin fewer words.\n\nTry and aim for most of your sentences to have 15 words or fewer but also try to\nvary the length of your sentences. Using only short sentences can sound robotic\nand get a bit boring.\n\n## Where we differ from the GOV.UK style guide\n\nAvoid using hyphens unless it changes the meaning of a sentence.\n\nFor example: \"a little used-car\" is different from \"a little-used car\" so using\na hyphen here makes sense. But if not using a hyphen doesn’t change the meaning\nlike \"part-time\" and \"part time\" then leave it out.\n\nA couple more words to avoid:\n\n* platform (unless it’s a train platform)\n* portal (unless it’s to another dimension)\n\n## Specific names and technical terms\n\nWe use these names and technical terms quite a lot. So be sure to get them\nright.\n\n**Digital Marketplace**: the government procurement website should be\ncapitalised as it is a proper noun to distinguish it from other digital\nmarketplaces (like eBay).\n\n**dxw**: in client-facing and public-facing documents, dxw should be lowercase.\n\n**G-Cloud**: never 'G-cloud' or 'g-cloud' or 'G Cloud' or 'GCloud'.\n\n**GovPress**: not 'Govpress' or 'Gov Press'\n\n**multisite**: if referring to the feature directly, \"Multisite\" should be\ncapitalised. If referring to a multisite WordPress setup, \"multisite\". Never\n\"multi site\" or \"multi-site\".\n\n**open source**: always lower case.\n\n**plugin**: not 'plug in' or 'plug-in'.\n\n**Rails**: for the Ruby framework, always upcase. Lower case is fine for the\nthings trains run on.\n\n**WordPress**: not 'Word Press', 'Wordpress' or 'WP'.\n\nHappy writing! And remember that the comms and marketing team are here to help\nyou.\n\n## References\n\n* [Monzo’s tone of voice guidance](https://monzo.com/tone-of-voice/)\n* [GOV.UK style guide](https://www.gov.uk/guidance/style-guide/a-to-z-of-gov-uk-style)\n* [GOV.UK words to avoid](https://www.gov.uk/guidance/style-guide/a-to-z-of-gov-uk-style#words-to-avoid)"},{"id":"web-accessibility","name":"Web accessibility","content":"## Why web accessibility matters\n\nEveryone experiences disability in some form throughout their life including\npermanent, temporary and situational types of disability. This is why it matters\nthat everything we create for the web is as easy to use as possible so that no\none is excluded from using a website because of their disability.\n\nIt also matters because making online public services accessible is a legal duty\nunder the\n[Accessibility regulations](http://www.legislation.gov.uk/uksi/2018/952/contents/made)\nnow meet WCAG 2.1 level AA.\n\n## Design for accessibility\n\nTest early and often in the design and prototyping stages to identify problems\nbecause they are often harder and more time-consuming to resolve later on in the\ndevelopment phase.\n\n* Review the GOV.UK Service Manual\n  [(Understanding WCAG 2.1)](https://www.gov.uk/service-manual/helping-people-to-use-your-service/understanding-wcag)\n  to check your designs meets all the criteria to level AA or above.\n* Use a tool such as [Who can use](https://whocanuse.com/) to check all colour\n  combinations meet WCAG grading of level AA or above.\n* Refer to the [GOV.UK Design System](https://design-system.service.gov.uk/) for\n  common components and patterns which have been extensively tested by users\n  with different disabilities.\n\n## Develop for accessibility\n\nWhether working on an existing codebase or starting an entirely new project,\neverything should be accessible to WCAG 2.1 level AA. This includes any plugins\nauthored outside dxw.\n\n* The GOV.UK Service Manual\n  [(Understanding WCAG 2.1)](https://www.gov.uk/service-manual/helping-people-to-use-your-service/understanding-wcag)\n  is also a helpful starting point to assess parts of your development work\n  against for accessibility.\n* Test existing code and plugins for accessibility **before** and **after**\n  working on a fix or feature.\n* When adding details for a pull request flag anything that might need\n  accessibility testing such as output from HTML, CSS and JavaScript.\n\n## Accessibility testing\n\nEverything we create for the web that involves user interaction should be tested\nfor accessibility. Testing may also be necessary during routine maintenance and\nfor any updates or changes to a website. There's also guidelines applicable to\nauthoring tools such as WordPress and other content management systems.\nAuthoring tools need to be accessible, so that people with disabilities can\ncreate web content as well as consume it.\n\n### Automated testing\n\nFor automated testing you should be able to identify around 50% of code-based\naccessibility issues. You must also follow up these with manual tests. A couple\nof extensions you can install on your browser for automated testing include:\n\n* The [WAVE extension](https://wave.webaim.org/extension/) adds on overlay to\n  the webpage which outlines all elements of the page such as landmarks,\n  headings, anchors and aria properties. Alongside this WAVE highlights any\n  problems categorised as either warnings or errors. This can include issues\n  such as poor contrast, empty elements and incorrect use of markup.\n* [axe DevTools](https://www.deque.com/axe/browser-extensions/) is an extension\n  for Chrome, Firefox and Edge which you can use to test for accessibility\n  defects. This identifies defects in relation to their user impact level as\n  well as any corresponding WCAG guidelines.\n* [axe cli](https://github.com/dequelabs/axe-core-npm/tree/develop/packages/cli)\n  is a command line interface for axe to run quick accessibility tests.\n\n### Manual testing\n\nManual testing needs to identify whether a website is accessible with or without\nuse of assistive technologies. In your testing you need to identify any traps,\nbarriers or challenges which make a website hard or impossible to access.\n\n#### Guides manual testing\n\nThere are a couple of helpful tools available for performing manual testing.\nThese provide visual helpers to help your assessment and keep a track of all\ncompleted or outstanding tests.\n\n* [Microsoft Accessibility Insights](https://accessibilityinsights.io/)\n* [axe DevTools Pro](https://www.deque.com/axe/devtools/) (subscription\n  required)\n\nPrepare to spend anything upwards of one day, to a week, to perform manual\ntesting comprehensively depending on the size of your project or task. Try to\ntest with real devices, as opposed to emulators, where possible including:\n\n* Phone or tablet running iOS\n* Phone or tablet running Android\n* Laptop or desktop machine running Windows + NVDA software installed\n* Laptop or desktop machine running macOS\n\nBrowser/screen reader combinations to include in your testing procedure:\n\n#### Mac\n\n* VoiceOver/Safari\n\n#### Windows\n\n* NVDA/Firefox\n* Narrator/Edge\n\n#### iOS\n\n* VoiceOver/Safari\n\n#### Android\n\n* Talkback/Chrome\n\nEach screen reader comes with a variety of different keyboard shortcut commands\nand dialogues to help navigate and interact with a website.\n[Screen Reader Keyboard Shortcuts and Gestures by Deque University](https://dequeuniversity.com/screenreaders/)\nprovides specific guidance on how to use them.\n\n#### Magnification and viewport size\n\nPart of your testing also needs to identify any failures for a website to\n[resize](https://www.w3.org/WAI/WCAG21/Understanding/resize-text.html) and\n[reflow](https://www.w3.org/WAI/WCAG21/Understanding/reflow.html) the text and\nlayout sufficiently to a zoom level of up to 400% and smaller viewport sizes\ndown to 320 CSS pixels. This helps support people with low vision who need to\nenlarge text and read it in a single column as well as anyone who browses with a\nmobile.\n\n## Fixing accessibility issues\n\nAccessibility issues found need fixing before going live. Be sure you fully\nunderstand why an issue isn't accessible before finding ways to resolve it. Once\nyou're confident with the changes made then restart automated and manual testing\nfor the affected pages or component that the issue is present in.\n\n### Prioritisation\n\nUltimately you should be looking to resolve all accessibility issues. Where\nthere's time and budgetary constraints, then prioritise those which have the\nhighest level of user impact, such as critical or serious. Add any unresolved\nissues to an accessibility statement with explanation for when you anticipate\nthey will be fixed. Every release must be accessibility tested.\n\n### Assignment\n\nIt's the responsibility of everyone on a project team to understand how\naccessibility impacts on their role from managing a project to designing,\nbuilding and maintaining it. Communicate often with your team and include\naccessibility in decision-making at all stages.\n\n## Further information\n\n* [How to Meet WCAG (Quick Reference)](https://www.w3.org/WAI/WCAG21/quickref/)\n* [Making online public services accessible](https://accessibility.campaign.gov.uk/)\n* [Authoring Tool Accessibility Guidelines overview](https://www.w3.org/WAI/standards-guidelines/atag/)\n* [GDS Empathy Lab](https://gds.blog.gov.uk/2018/06/20/creating-the-uk-governments-accessibility-empathy-lab/)"},{"id":"web-analytics","name":"Web analytics","content":"We use Google Analytics on most of our sites. It's free\n([within limits](https://support.google.com/analytics/answer/1070983?hl=en)),\nit's easy to implement and there aren't many things it can't track.\n\nThe login details for the shared Google Analytics account are kept in 1Password,\nsearch for \"Google Analytics\".\n\n## Implementing\n\nWe add Google Analytics via\n[gtag.js](https://developers.google.com/analytics/devguides/collection/gtagjs/).\nIf you're using\n[whippet-theme-template](https://github.com/dxw/whippet-theme-template), the\ncode is already included\n[in the footer](https://github.com/dxw/whippet-theme-template/blob/master/app/Theme/Analytics.php)\nand you just have to enter the correct\n[tracking ID](https://support.google.com/analytics/answer/1008080?hl=en).\n\n### Event tracking\n\nBy default, pageviews are the only user interaction that Google Analytics will\nrecord.\n\nIf there are specific events you want to track that Google Analytics will not\ntrack by default (e.g. clicks on links to external sites, file downloads), you\nwill need to implement a custom event, as per\n[Google's instructions](https://developers.google.com/analytics/devguides/collection/gtagjs/sending-data).\n\nIt's important to note the section on\n[handling timeouts](https://developers.google.com/analytics/devguides/collection/gtagjs/sending-data#handle_timeouts).\nIf you don't do that, the links you are tracking won't work if GA doesn't load\n(e.g. if the user has a browser extension that blocks trackers).\n\n## Configuring\n\nThere are a few basic steps it's worth following for any site you've set up in\nGoogle Analytics:\n\n* Set up an unfiltered\n  [view](https://support.google.com/analytics/answer/1009714?hl=en-GB&ref_topic=6014102)\n  that records all traffic, including spam. Any new view you create is\n  unfiltered by default. You won't use this view for most analysis, put it\n  provides a control you can compare against, and a backup in case you get the\n  filtering wrong on other views.\n* Set up a \"main\" view that has Google's \"Bot filtering\" activated (found under\n  Admin > View Settings). This should automatically remove the majority of spam\n  traffic.\n* You may also want to\n  [filter out](https://support.google.com/analytics/answer/1033162?hl=en)\n  internal traffic on the main view (e.g. from within the dxw office, or\n  staging/localhost versions of the site). You can do this by IP (e.g. using\n  dxw's external IP to filter out office traffic) or hostname (e.g. the staging\n  site URL to filter out staging traffic).\n* To avoid double-counting page views that differ only by query string,\n  [follow Google's advice](https://support.google.com/analytics/answer/1009671?hl=en)\n  to build a list of query parameters your site receives, then blacklist the\n  ones you don't care about using the field in View Settings.\n* Set up [Google Search Console](https://search.google.com/search-console/about)\n  (formerly Google Webmaster Tools), and give Analytics access under\n  Acquisition > Search Console. This will allow you to see the search queries\n  people are using that return the site in Google results.\n\nTake some time to think about what activity on the site you might want to track.\n**If you do not record a user action at the time it happens, it is lost\nforever**, so the more you can set up in advance (e.g. goals for transactions\nsuch as newsletter sign-ups, recording of on-site search terms), the better.\n\n## Understanding Google Analytics\n\nGA uses a lot of jargon. It also has a tendency to present its data as absolute\nfact, even when there are all kinds of assumptions or complexities that underlie\nit. Some good resources for understanding it:\n\n* Average Time on Page:\n  [Understanding Google Analytics’ Average Time on Page](https://blog.quiet.ly/insights/understanding-google-analytics-average-time-on-page/)\n* Bounce rate: [Adjusted Bounce Rate](https://moz.com/blog/adjusted-bounce-rate)\n  (does a good job of explaining the limitations of bounce rate, and offers a\n  workaround for them)\n* 'Direct' Traffic:\n  [Guide to Direct Traffic](https://moz.com/blog/guide-to-direct-traffic-google-analytics)\n* \"Next Page Path\":\n  [Misunderstood Metrics: Next Page Path](https://help.analyticsedge.com/googleanalytics/misunderstood-metrics-next-page-path/)\n* View filtering:\n  [A better alternative to exclude filters in Google Analytics](https://www.lunametrics.com/blog/2017/08/10/a-better-alternative-to-exclude-filters-in-google-analytics/).\n  This is an article about Google Tag Manager, which exposes many of the\n  configuration features of GA in JavaScript.\n\n## Useful resources\n\n* [GOV.UK: Using data to improve your service](https://www.gov.uk/service-manual/measuring-success/using-data-to-improve-your-service-an-introduction)"},{"id":"web-performance","name":"Web performance","content":"A web performance budget can be a useful reference for helping you figure out\nwhat should and shouldn't go on your website. Ultimately it can help reduce the\nfootprint of our websites and help make the the experience better for more users\nregardless of their internet connection speed and computer or device\ncapabilities.\n\n## How do I implement a performance budget pre-build?\n\nBefore designing and building a project define a limit to how many bytes you\nshould allow for pages, scripts and assets. In your budget break it down to\ninclude:\n\n* HTML\n* Images\n* CSS\n* JavaScript\n* Other\n\n## Performance Budget calculator\n\nA webpage should ideally load in 3 seconds or less.\n[Performance Budget calculator](https://www.performancebudget.io/) (works best\nin Chrome) helps you to work out a performance budget based on typical\nconnection speeds for a range of connection speeds including cable, dial-up, DSL\n(digital subscriber line) and mobile internet connections.\n\n## How do I implement a performance budget post-build?\n\nCreating a web performance budget retrospectively: follow the pre-build process\nabove and then analyse this against the website with something like\n[WebPageTest.org (External link)](https://www.webpagetest.org/). This should\ngive you an overall picture for which things are slowing down your website and\nneed to be optimised or dropped if they don't serve a useful purpose.\n\n## Where to make improvements and reduce environmental impact\n\nWebpage bloat is a term often mentioned when discussing the environmental impact\nof websites. Looking at a typical website several years old you might find code\nand assets in need of refactoring, removal or updating to adhere to latest web\nstandards. Identify areas for improvement and where possible engage with the\nclient to help identify redundant parts of the website taking up unnecessary\nspace and bandwidth. Help share this understanding of the environmental impact\ntheir website has.\n\n## Further reading\n\n* [Webwaste](https://alistapart.com/article/webwaste/)\n* [Website Carbon Calculator](https://www.websitecarbon.com/)"},{"id":"week-notes","name":"Project weeknotes","content":"## What are weeknotes?\n\nWe use weeknotes to inform the people we’re working with about our progress,\nissues we’re dealing with, and what we’re planning to do. They can be a really\nuseful way to update people you deal with directly, but they can also be shared\nmore widely with people who are less directly involved in a day to day basis.\n\n## What makes a good weeknote?\n\nA good weeknote:\n\n* Sounds like it was written by a human. Ask yourself whether it would be\n  something you’d be happy to receive and read. You don’t need to make it too\n  formal.\n* Is honest about progress as well as issues. This is a good way to flag things\n  that need to get dealt with on a project.\n* Gives a sense of what the team is delivering as whole. Don’t just write\n  bullets covering what every individual on the team did that week.\n* Brings the project to life. Do you have any images you can use to illustrate\n  what you’ve been doing?\n* Is frequent and regular. This is a good way to build trust with the wider\n  team.\n\n## Template\n\n**Weeknotes:** *project name* **Week ending:** *date*\n\n*We send out weeknotes to update you on progress. Weeknotes highlight things\nwe’re worried about, acknowledge achievements and show progress, and layout what\nwe plan to do next. Along with our show and tells, this is the main way you will\nfind out about the project so please read.*\n\n*Get in touch with \\[insert delivery manager name] with any questions or\nfeedback.*\n\n### **Good Things**\n\n*What are the main highlights this week?* *Have you hit any milestones, or\novercome any significant blockers?* *What decisions have been made?* *Do you\nhave any images to show progress? (e.g. a photo from a workshop, or a screenshot\nof something that’s been built?)*\n\n### **Learned things**\n\n*Have the team learned anything from a retro?* *Did anything happen that you\ndidn’t expect?* *Have the team made any changes to how the team operates?* *Have\nthe team uncovered anything new from user research?* *Does anyone from the team\nhave any personal reflections that they’d like to share?*\n\n### **Difficulties**\n\n*What challenges or issues does the wider project team need to be aware of?*\n*How are you dealing with them?* *What help do you need - either from within the\nproject team or elsewhere?*\n\n### **Achievements**\n\n*Are there any team achievements that need recognising?* *Are there any\nindividuals you want to recognise? (they don’t need to be inside the core\nproject team - they could be someone from a different department who helped you\nout this week).*\n\n### **What’s next**\n\n*What are you planning to deliver in the next sprint?* *When is the next show\nand tell?* *What key meetings are coming up?*"},{"id":"working-remotely","name":"Working remotely","content":"When a delivery team aren't all in the same place, it's important that we\ncontinue to communicate and collaborate as well as we can. This guide contains\nsome suggestions about how to create a happy and productive remote working\nenvironment.\n\n## Coming and going\n\nWhen you arrive, go home, or leave your station for a while, let your teammates\nknow in Slack.\n\n## Know the limits of your technology\n\nDialing in to a video conference is usually fine for standups, whereas things\nlike all-day workshops are more difficult. In those cases consider attending by\nspeakerphone, or not at all.\n\n## Keep notes\n\nIf someone is not able to attend a meeting because they are working remotely,\nthey need to have some kind of report of that meeting in writing. The format\ndoesn't really matter - it could be a set of Trello cards, for instance.\n\nIf you need to write out a note, make it as concise as you can.\n\nBe mindful that it is easy for a casual conversation around the office to turn\ninto an ad-hoc meeting. Recognise when this happens, and stop to include remote\nteam members.\n\n## Drawings\n\nIf your conversation will be enhanced by drawings, try to have it in person. If\nyou can't, consider a low-tech solution like holding a sketch up to your webcam\nor sharing a photo in Slack in preference to spending time making graphics on\nthe computer."},{"id":"wrapping-up-a-project","name":"Wrapping up a project","content":"## Why is this important?\n\nWe often only work with a client for a short period of time. But they may rely\non the things that we deliver long after we have moved on. This applies to work\nwe deliver during Discovery and Alpha (other teams and suppliers may need to\nbuild on our work) or Beta and Live (services that we have helped launch will\nneed to be maintained).\n\nWrapping up a project well also helps us keep a good relationship with people\nand organisations that we work with. Leaving a client happy makes it more likely\nthat they will want to work with us in future.\n\nFinally, this is also a good opportunity to reflect on how the project has gone\nas a whole. How successful have we been at achieving the outcomes we wanted to?\nWhat do we want to build on or change for future projects?\n\n## What do you need to think about?\n\n* What needs to be handed over or maintained? Where are you in the project\n  life-cycle?\n* Does the team need to create anything as part of the wrap-up?\n* Who is going to be the owner for this work once you leave? Who are you handing\n  things over to?\n\n## Checklist\n\n### Penultimate sprint (or earlier)\n\n* Revisit the scope and make sure you’ve done everything you needed to\n* If a support contract is in place, make sure you follow the\n  [guide to getting a project ready for support](/guides/getting-a-project-ready-for-support).\n\n### Final sprint\n\n* Run a whole project retro\n* Check client has access to any documents or key pieces of information that\n  they might need in the future. Make this tidy to help them find things later\n  on. e.g. user research outputs or technical documentation\n\n### Final week\n\n* Write a note to everyone who worked on the project. Use this to celebrate the\n  work that has been done, and to look forward to what happens next.\n* Meet with client to close down the project and make sure they are happy. Are\n  there other opportunities that we can support them on?\n* Get feedback from the client.\n* Get email confirmation from the client that the project has wrapped up."}]